{
  "title": "Book I",
  "num": 1,
  "definitions": [
    {
      "id": "elem.1.def.1",
      "text": "A <dfn>point</dfn> is that which has no part."
    },
    {
      "id": "elem.1.def.2",
      "text": "A <dfn>line</dfn> is breadthless length."
    },
    {
      "id": "elem.1.def.3",
      "text": "The extremities of a line are points."
    },
    {
      "id": "elem.1.def.4",
      "text": "A <dfn>straight line</dfn> is a line which lies evenly with the points on itself."
    },
    {
      "id": "elem.1.def.5",
      "text": "A <dfn>surface</dfn> is that which has length and breadth only."
    },
    {
      "id": "elem.1.def.6",
      "text": "The extremities of a surface are lines."
    },
    {
      "id": "elem.1.def.7",
      "text": "A <dfn>plane surface</dfn> is a surface which lies evenly with the straight lines on itself."
    },
    {
      "id": "elem.1.def.8",
      "text": "A <dfn>plane angle</dfn> is the inclination to one another of two lines in a plane which meet one another and do not lie in a straight line."
    },
    {
      "id": "elem.1.def.9",
      "text": "And when the lines containing the angle are straight, the angle is called <dfn>rectilineal</dfn>."
    },
    {
      "id": "elem.1.def.10",
      "text": "When a straight line set up on a straight line makes the adjacent angles equal to one another, each of the equal angles is <dfn>right</dfn>, and the straight line standing on the other is called a <dfn>perpendicular</dfn> to that on which it stands."
    },
    {
      "id": "elem.1.def.11",
      "text": "An <dfn>obtuse angle</dfn> is an angle greater than a right angle."
    },
    {
      "id": "elem.1.def.12",
      "text": "An <dfn>acute angle</dfn> is an angle less than a right angle."
    },
    {
      "id": "elem.1.def.13",
      "text": "A <dfn>boundary</dfn> is that which is an extremity of anything."
    },
    {
      "id": "elem.1.def.14",
      "text": "A <dfn>figure</dfn> is that which is contained by any boundary or boundaries."
    },
    {
      "id": "elem.1.def.15",
      "text": "A <dfn>circle</dfn> is a plane figure contained by one line such that all the straight lines falling upon it from one point among those lying within the figure are equal to one another;"
    },
    {
      "id": "elem.1.def.16",
      "text": "And the point is called the <dfn>centre</dfn> of the circle."
    },
    {
      "id": "elem.1.def.17",
      "text": "A <dfn>diameter</dfn> of the circle is any straight line drawn through the centre and terminated in both directions by the circumference of the circle, and such a straight line also bisects the circle."
    },
    {
      "id": "elem.1.def.18",
      "text": "A <dfn>semicircle</dfn> is the figure contained by the diameter and the circumference cut off by it. And the centre of the semicircle is the same as that of the circle."
    },
    {
      "id": "elem.1.def.19",
      "text": "Rectilineal figures are those which are contained by straight lines, trilateral figures being those contained by three, quadrilateral those contained by four, and multilateral those contained by more than four straight lines."
    },
    {
      "id": "elem.1.def.20",
      "text": "Of trilateral figures, an equilateral triangle is that which has its three sides equal, an isosceles triangle that which has two of its sides alone equal, and a scalene triangle that which has its three sides unequal."
    },
    {
      "id": "elem.1.def.21",
      "text": "Further, of trilateral figures, a right-angled triangle is that which has a right angle, an obtuse-angled triangle that which has an obtuse angle, and an acuteangled triangle that which has its three angles acute."
    },
    {
      "id": "elem.1.def.22",
      "text": "Of quadrilateral figures, a square is that which is both equilateral and right-angled; an oblong that which is right-angled but not equilateral; a rhombus that which is equilateral but not right-angled; and a rhomboid that which has its opposite sides and angles equal to one another but is neither equilateral nor right-angled. And let quadrilaterals other than these be called trapezia."
    },
    {
      "id": "elem.1.def.23",
      "text": "Parallel straight lines are straight lines which, being in the same plane and being produced indefinitely in both directions, do not meet one another in either direction."
    }
  ],
  "postulates": [
    {
      "id": "elem.1.post.1",
      "text": "To draw a straight line from any point to any point."
    },
    {
      "id": "elem.1.post.2",
      "text": "To produce a finite straight line continuously in a straight line."
    },
    {
      "id": "elem.1.post.3",
      "text": "To describe a circle with any centre and distance."
    },
    {
      "id": "elem.1.post.4",
      "text": "That all right angles are equal to one another."
    },
    {
      "id": "elem.1.post.5",
      "text": "That, if a straight line falling on two straight lines make the interior angles on the same side less than two right angles, the two straight lines, if produced indefinitely, meet on that side on which are the angles less than the two right angles."
    }
  ],
  "common_notions": [
    {
      "id": "elem.1.c.n.1",
      "text": "Things which are equal to the same thing are also equal to one another."
    },
    {
      "id": "elem.1.c.n.2",
      "text": "If equals be added to equals, the wholes are equal."
    },
    {
      "id": "elem.1.c.n.3",
      "text": "If equals be subtracted from equals, the remainders are equal."
    },
    {
      "id": "elem.1.c.n.4",
      "text": "[7] Things which coincide with one another are equal to one another."
    },
    {
      "id": "elem.1.c.n.5",
      "text": "[8] The whole is greater than the part."
    }
  ],
  "propositions": [
    {
      "id": "elem.1.1",
      "claim": "On a given finite straight line to construct an equilateral triangle.",
      "proof": [
        "Let <var>AB</var> be the given finite straight line.",
        "Thus it is required to construct an equilateral triangle on the straight line <var>AB</var>. ",
        "With centre <var>A</var> and distance <var>AB</var> let the circle <var>BCD</var> be described; [<a href=\"#elem.1.post.3\">Post. 3</a>] again, with centre <var>B</var> and distance <var>BA</var> let the circle <var>ACE</var> be described; [<a href=\"#elem.1.post.3\">Post. 3</a>] and from the point <var>C</var>, in which the circles cut one another, to the points <var>A</var>, <var>B</var> let the straight lines <var>CA</var>, <var>CB</var> be joined. [<a href=\"#elem.1.post.1\">Post. 1</a>] ",
        "Now, since the point <var>A</var> is the centre of the circle <var>CDB</var>, <var>AC</var> is equal to <var>AB</var>. [<a href=\"#elem.1.def.15\">Def. 15</a>]",
        "Again, since the point <var>B</var> is the centre of the circle <var>CAE</var>, <var>BC</var> is equal to <var>BA</var>. [<a href=\"#elem.1.def.15\">Def. 15</a>]",
        "But <var>CA</var> was also proved equal to <var>AB</var>; therefore each of the straight lines <var>CA</var>, <var>CB</var> is equal to <var>AB</var>.",
        "And things which are equal to the same thing are also equal to one another; [<a href=\"#elem.1.c.n.1\">C.N. 1</a>] therefore <var>CA</var> is also equal to <var>CB</var>.",
        "Therefore the three straight lines <var>CA</var>, <var>AB</var>, <var>BC</var> are equal to one another. ",
        "Therefore the triangle <var>ABC</var> is equilateral; and it has been constructed on the given finite straight line <var>AB</var>."
      ],
      "qed": "(Being) what it was required to do."
    },
    {
      "id": "elem.1.2",
      "claim": "To place at a given point (as an extremity) a straight line equal to a given straight line.",
      "proof": [
        "Let <var>A</var> be the given point, and <var>BC</var> the given straight line.",
        "Thus it is required to place at the point <var>A</var> (as an extremity) a straight line equal to the given straight line <var>BC</var>. ",
        "From the point <var>A</var> to the point <var>B</var> let the straight line <var>AB</var> be joined; [<a href=\"#elem.1.post.1\">Post. 1</a>] and on it let the equilateral triangle <var>DAB</var> be constructed. [<a href=\"#elem.1.1\">I. 1</a>]",
        "Let the straight lines <var>AE</var>, <var>BF</var> be produced in a straight line with <var>DA</var>, <var>DB</var>; [<a href=\"#elem.1.post.2\">Post. 2</a>] with centre <var>B</var> and distance <var>BC</var> let the circle <var>CGH</var> be described; [<a href=\"#elem.1.post.3\">Post. 3</a>] and again, with centre <var>D</var> and distance <var>DG</var> let the circle <var>GKL</var> be described. [<a href=\"#elem.1.post.3\">Post. 3</a>]",
        "Then, since the point <var>B</var> is the centre of the circle <var>CGH</var>, <var>BC</var> is equal to <var>BG</var>.\n        ",
        "Again, since the point <var>D</var> is the centre of the circle <var>GKL</var>, <var>DL</var> is equal to <var>DG</var>.",
        "And in these <var>DA</var> is equal to <var>DB</var>; therefore the remainder <var>AL</var> is equal to the remainder <var>BG.</var> [<a href=\"#elem.1.c.n.3\">C.N. 3</a>]\n        ",
        "But <var>BC</var> was also proved equal to <var>BG</var>; therefore each of the straight lines <var>AL</var>, <var>BC</var> is equal to <var>BG</var>.",
        "And things which are equal to the same thing are also equal to one another; [<a href=\"#elem.1.c.n.1\">C.N. 1</a>] therefore <var>AL</var> is also equal to <var>BC</var>.",
        "Therefore at the given point <var>A</var> the straight line <var>AL</var> is placed equal to the given straight line <var>BC</var>."
      ],
      "qed": "(Being) what it was required to do."
    },
    {
      "id": "elem.1.3",
      "claim": "Given two unequal straight lines, to cut off from the greater a straight line equal to the less. ",
      "proof": [
        "Let <var>AB</var>, <var>C</var> be the-two given unequal straight lines, and let <var>AB</var> be the greater of them.",
        "Thus it is required to cut off from <var>AB</var> the greater a straight line equal to <var>C</var> the less.",
        "At the point <var>A</var> let <var>AD</var> be placed equal to the straight line <var>C</var>; [<a href=\"#elem.1.2\">I. 2</a>] and with centre <var>A</var> and distance <var>AD</var> let the circle <var>DEF</var> be described. [<a href=\"#elem.1.post.3\">Post. 3</a>] Now, since the point <var>A</var> is the centre of the circle <var>DEF</var>, <var>AE</var> is equal to <var>AD</var>. [<a href=\"#elem.1.def.15\">Def. 15</a>] But <var>C</var> is also equal to <var>AD</var>. Therefore each of the straight lines <var>AE</var>, <var>C</var> is equal to <var>AD</var>; so that <var>AE</var> is also equal to <var>C</var>. [<a href=\"#elem.1.c.n.1\">C.N. 1</a>]",
        "Therefore, given the two straight lines <var>AB</var>, <var>C</var>, from <var>AB</var> the greater <var>AE</var> has been cut off equal to <var>C</var> the less."
      ],
      "qed": "(Being) what it was required to do."
    },
    {
      "id": "elem.1.4",
      "claim": "If two triangles have the two sides equal to two sides respectively, and have the angles contained by the equal straight lines equal, they will also have the base equal to the base, the triangle will be equal to the triangle, and the remaining angles will be equal to the remaining angles respectively, namely those which the equal sides subtend.",
      "proof": [
        "Let <var>ABC</var>, <var>DEF</var> be two triangles having the two sides <var>AB</var>, <var>AC</var> equal to the two sides <var>DE</var>, <var>DF</var> respectively, namely <var>AB</var> to <var>DE</var> and <var>AC</var> to <var>DF</var>, and the angle <var>BAC</var> equal to the angle <var>EDF</var>.",
        "I say that the base <var>BC</var> is also equal to the base <var>EF</var>, the triangle <var>ABC</var> will be equal to the triangle <var>DEF</var>, and the remaining angles will be equal to the remaining angles respectively, namely those which the equal sides subtend, that is, the angle <var>ABC</var> to the angle <var>DEF</var>, and the angle <var>ACB</var> to the angle <var>DFE</var>.",
        "For, if the triangle <var>ABC</var> be applied to the triangle <var>DEF</var>, and if the point <var>A</var> be placed on the point <var>D</var> and the straight line <var>AB</var> on <var>DE</var>, then the point <var>B</var> will also coincide with <var>E</var>, because <var>AB</var> is equal to <var>DE</var>. \n        ",
        "Again, <var>AB</var> coinciding with <var>DE</var>, the straight line <var>AC</var> will also coincide with <var>DF</var>, because the angle <var>BAC</var> is equal to the angle <var>EDF</var>; hence the point <var>C</var> will also coincide with the point <var>F</var>, because <var>AC</var> is again equal to <var>DF</var>.\n        ",
        "But <var>B</var> also coincided with <var>E</var>; hence the base <var>BC</var> will coincide with the base <var>EF</var>.",
        "[For if, when <var>B</var> coincides with <var>E</var> and <var>C</var> with <var>F</var>, the base <var>BC</var> does not coincide with the base <var>EF</var>, two straight lines will enclose a space: which is impossible. Therefore the base <var>BC</var> will coincide with <var>EF</var>] and will be equal to it. [<a href=\"#elem.1.c.n.4\">C.N. 4</a>]",
        "Thus the whole triangle <var>ABC</var> will coincide with the whole triangle <var>DEF</var>, and will be equal to it.\n        ",
        "And the remaining angles will also coincide with the remaining angles and will be equal to them, the angle <var>ABC</var> to the angle <var>DEF</var>, and the angle <var>ACB</var> to the angle <var>DFE</var>.",
        "Therefore etc. "
      ],
      "qed": "(Being) what it was required to prove."
    },
    {
      "id": "elem.1.5",
      "claim": "In isosceles triangles the angles at the base are equal to one another, and, if the equal straight lines be produced further, the angles under the base will be equal to one another.",
      "proof": [
        "Let <var>ABC</var> be an isosceles triangle having the side <var>AB</var>\n        equal to the side <var>AC</var>; and let the straight lines <var>BD</var>, <var>CE</var> be produced further in a straight line with <var>AB</var>, <var>AC</var>. [<a href=\"#elem.1.post.2\">Post. 2</a>]",
        "I say that the angle <var>ABC</var> is equal to the angle <var>ACB</var>, and the angle <var>CBD</var> to the angle <var>BCE</var>. ",
        "Let a point <var>F</var> be taken at random on <var>BD</var>;  from <var>AE</var> the greater let <var>AG</var> be cut off equal to <var>AF</var> the less; [<a href=\"#elem.1.3\">I. 3</a>] and let the straight lines <var>FC</var>, <var>GB</var> be joined. [<a href=\"#elem.1.post.1\">Post. 1</a>] ",
        "Then, since <var>AF</var> is equal to <var>AG</var> and <var>AB</var> to <var>AC</var>, the two sides <var>FA</var>, <var>AC</var> are equal to the two sides <var>GA</var>, <var>AB</var>, respectively; and they contain a common angle, the angle <var>FAG</var>. Therefore the base <var>FC</var> is equal to the base <var>GB</var>, and the triangle <var>AFC</var> is equal to the triangle <var>AGB</var>, and the remaining angles will be equal to the remaining angles respectively, namely those which the equal sides subtend, that is, the angle <var>ACF</var> to the angle <var>ABG</var>, and the angle <var>AFC</var> to the angle <var>AGB</var>. [<a href=\"#elem.1.4\">I. 4</a>]",
        "And, since the whole <var>AF</var> is equal to the whole <var>AG</var>, and in these <var>AB</var> is equal to <var>AC</var>, the remainder <var>BF</var> is equal to the remainder <var>CG</var>.",
        "But <var>FC</var> was also proved equal to <var>GB</var>; therefore the two sides <var>BF</var>, <var>FC</var> are equal to the two sides <var>CG</var>, <var>GB</var> respectively; and the angle <var>BFC</var> is equal to the angle <var>CGB</var>, while the base <var>BC</var> is common to them; therefore the triangle <var>BFC</var> is also equal to the triangle <var>CGB</var>, and the remaining angles will be equal to the remaining angles respectively, namely those which the equal sides subtend; therefore the angle <var>FBC</var> is equal to the angle <var>GCB</var>, and the angle <var>BCF</var> to the angle <var>CBG</var>.\n        ",
        "Accordingly, since the whole angle <var>ABG</var> was proved equal to the angle <var>ACF</var>, and in these the angle <var>CBG</var> is equal to the angle <var>BCF</var>, the remaining angle <var>ABC</var> is equal to the remaining angle <var>ACB</var>; and they are at the base of the triangle <var>ABC</var>. But the angle <var>FBC</var> was also proved equal to the angle <var>GCB</var>; and they are under the base.",
        "Therefore etc."
      ],
      "qed": "Q. E. D."
    },
    {
      "id": "elem.1.6",
      "claim": "If in a triangle two angles be equal to one another, the sides which subtend the equal angles will also be equal to one another.",
      "proof": [
        "Let <var>ABC</var> be a triangle having the angle <var>ABC</var> equal to the angle <var>ACB</var>;",
        "I say that the side <var>AB</var> is also equal to the side <var>AC</var>.",
        "For, if <var>AB</var> is unequal to <var>AC</var>, one of them is greater.",
        "Let <var>AB</var> be greater; and from <var>AB</var> the greater let <var>DB</var> be cut off equal to <var>AC</var> the less;",
        "let <var>DC</var> be joined. ",
        "Then, since <var>DB</var> is equal to <var>AC</var>, and <var>BC</var> is common, the two sides <var>DB</var>, <var>BC</var> are equal to the two sides <var>AC</var>, <var>CB</var> respectively;\n        and the angle <var>DBC</var> is equal to the angle <var>ACB</var>; therefore the base <var>DC</var> is equal to the base <var>AB</var>, and the triangle <var>DBC</var> will be equal to the triangle <var>ACB</var>, the less to the greater: which is absurd. Therefore <var>AB</var> is not unequal to <var>AC</var>; it is therefore equal to it.",
        "Therefore etc."
      ],
      "qed": "Q. E. D."
    },
    {
      "id": "elem.1.7",
      "claim": "Given two straight lines constructed on a straight line (from its extremities) and meeting in a point, there cannot be constructed on the same straight line (from its extremities), and on the same side of it, two other straight lines meeting in another point and equal to the former two respectively, namely each to that which has the same extremity with it.",
      "proof": [
        "For, if possible, given two straight lines <var>AC</var>, <var>CB</var> constructed on the straight line <var>AB</var> and meeting at the point <var>C</var>, let two other straight lines \n        <var>AD</var>, <var>DB</var> be constructed on the same straight line <var>AB</var>, on the same side of it, meeting in another point <var>D</var> and equal to the former two respectively, namely each to that which has the same extremity with it, so that <var>CA</var> is equal to <var>DA</var> which has the same extremity <var>A</var> with it, and <var>CB</var> to <var>DB</var> which has the same extremity <var>B</var> with it; and let <var>CD</var> be joined.",
        "Then, since <var>AC</var> is equal to <var>AD</var>, the angle <var>ACD</var> is also equal to the angle <var>ADC</var>; [<a href=\"#elem.1.5\">I. 5</a>] therefore the angle <var>ADC</var> is greater than the angle <var>DCB</var>; therefore the angle <var>CDB</var> is much greater than the angle <var>DCB</var>.",
        "Again, since <var>CB</var> is equal to <var>DB</var>, the angle <var>CDB</var> is also equal to the angle <var>DCB</var>.\n        But it was also proved much greater than it: which is impossible.",
        "Therefore etc."
      ],
      "qed": "Q. E. D."
    },
    {
      "id": "elem.1.8",
      "claim": "If two triangles have the two sides equal to two sides respectively, and have also the base equal to the base, they will also have the angles equal which are contained by the equal straight lines. ",
      "proof": [
        "Let <var>ABC</var>, <var>DEF</var> be two triangles having the two sides <var>AB</var>, <var>AC</var> equal to the two sides <var>DE</var>, <var>DF</var> respectively, namely <var>AB</var> to <var>DE</var>, and <var>AC</var> to <var>DF</var>; and let them have the base <var>BC</var> equal to the base <var>EF</var>; ",
        "I say that the angle <var>BAC</var> is also equal to the angle <var>EDF</var>.",
        "For, if the triangle <var>ABC</var> be applied to the triangle <var>DEF</var>, and if the point <var>B</var> be placed on the point <var>E</var> and the straight line <var>BC</var> on <var>EF</var>, the point <var>C</var> will also coincide with <var>F</var>, because <var>BC</var> is equal to <var>EF</var>.\n        ",
        "Then, <var>BC</var> coinciding with <var>EF</var>, <var>BA</var>, <var>AC</var> will also coincide with <var>ED</var>, <var>DF</var>;\n        for, if the base <var>BC</var> coincides with the base <var>EF</var>, and the sides <var>BA</var>, <var>AC</var> do not coincide with <var>ED</var>, <var>DF</var> but fall beside them as <var>EG</var>, <var>GF</var>, then, given two straight lines constructed on a straight line (from its extremities) and meeting in a point, there will have been constructed on the same straight line (from its extremities), and on the same side of it, two other straight lines meeting in another point and equal to the former two respectively, namely each to that which has the same extremity with it. But they cannot be so constructed. [<a href=\"#elem.1.7\">I. 7</a>]",
        "Therefore it is not possible that, if the base <var>BC</var> be applied to the base <var>EF</var>, the sides <var>BA</var>, <var>AC</var> should not coincide with <var>ED</var>, <var>DF</var>; they will therefore coincide,\n        so that the angle <var>BAC</var> will also coincide with the angle <var>EDF</var>, and will be equal to it.",
        "If therefore etc."
      ],
      "qed": "Q. E. D."
    },
    {
      "id": "elem.1.9",
      "claim": "To bisect a given rectilineal angle.",
      "proof": [
        "Let the angle <var>BAC</var> be the given rectilineal angle.",
        "Thus it is required to bisect it.",
        "Let a point <var>D</var> be taken at random on <var>AB</var>; let <var>AE</var> be cut off from <var>AC</var> equal to <var>AD</var>; [<a href=\"#elem.1.3\">I. 3</a>] let <var>DE</var> be joined, and on <var>DE</var> let the equilateral triangle <var>DEF</var> be constructed; let <var>AF</var> be joined. ",
        "I say that the angle <var>BAC</var> has been bisected by the straight line <var>AF</var>.",
        "For, since <var>AD</var> is equal to <var>AE</var>, and <var>AF</var> is common, the two sides <var>DA</var>, <var>AF</var> are equal to the two sides <var>EA</var>, <var>AF</var> respectively.",
        "And the base <var>DF</var> is equal to the base <var>EF</var>; therefore the angle <var>DAF</var> is equal to the angle <var>EAF</var>. [<a href=\"#elem.1.8\">I. 8</a>]",
        "Therefore the given rectilineal angle <var>BAC</var> has been bisected by the straight line <var>AF</var>."
      ],
      "qed": "Q. E. F."
    },
    {
      "id": "elem.1.10",
      "claim": "To bisect a given finite straight line.",
      "proof": [
        "Let <var>AB</var> be the given finite straight line.",
        "Thus it is required to bisect the finite straight line <var>AB</var>.",
        "Let the equilateral triangle <var>ABC</var> be constructed on it, [<a href=\"#elem.1.1\">I. 1</a>] and let the angle <var>ACB</var> be bisected by the straight line <var>CD</var>; [<a href=\"#elem.1.9\">I. 9</a>]",
        "I say that the straight line <var>AB</var> has been bisected at the point <var>D</var>.",
        "For, since <var>AC</var> is equal to <var>CB</var>, and <var>CD</var> is common, \n        the two sides <var>AC</var>, <var>CD</var> are equal to the two sides <var>BC</var>, <var>CD</var> respectively; and the angle <var>ACD</var> is equal to the angle <var>BCD</var>; therefore the base <var>AD</var> is equal to the base <var>BD</var>. [<a href=\"#elem.1.4\">I. 4</a>]",
        "Therefore the given finite straight line <var>AB</var> has been bisected at <var>D</var>."
      ],
      "qed": "Q. E. F."
    },
    {
      "id": "elem.1.11",
      "claim": "To draw a straight line at right angles to a given straight line from a given point on it.",
      "proof": [
        "Let <var>AB</var> be the given straight line, and <var>C</var> the given point on it. ",
        "Thus it is required to draw from the point <var>C</var> a straight line at right angles to the straight line <var>AB</var>.",
        "Let a point <var>D</var> be taken at random on <var>AC</var>; let <var>CE</var> be made equal to <var>CD</var>; [<a href=\"#elem.1.3\">I. 3</a>] on <var>DE</var> let the equilateral triangle <var>FDE</var> be constructed, [<a href=\"#elem.1.1\">I. 1</a>] and let <var>FC</var> be joined; ",
        "I say that the straight line <var>FC</var> has been drawn at right angles to the given straight line <var>AB</var> from <var>C</var> the given point on it.",
        "For, since <var>DC</var> is equal to <var>CE</var>, and <var>CF</var> is common, the two sides <var>DC</var>, <var>CF</var> are equal to the two sides <var>EC</var>, <var>CF</var> respectively; and the base <var>DF</var> is equal to the base <var>FE</var>; therefore the angle <var>DCF</var> is equal to the angle <var>ECF</var>; [<a href=\"#elem.1.8\">I. 8</a>] and they are adjacent angles.",
        "But, when a straight line set up on a straight line makes the adjacent angles equal to one another, each of the equal angles is right; [<ref target=\"elem.1.def.10\" targOrder=\"U\">Def. 10</a>] therefore each of the angles <var>DCF</var>, <var>FCE</var> is right.",
        "Therefore the straight line <var>CF</var> has been drawn at right angles to the given straight line <var>AB</var> from the given point <var>C</var> on it."
      ],
      "qed": "Q. E. F."
    },
    {
      "id": "elem.1.12",
      "claim": "To a given infinite straight line, from a given point which is not on it, to draw a perpendicular straight line.",
      "proof": [
        "Let <var>AB</var> be the given infinite straight line, and <var>C</var> the given point which is not on it; thus it is required to draw to the given infinite straight line <var>AB</var>, from the given point <var>C</var> which is not on it, a perpendicular straight line.",
        "For let a point <var>D</var> be taken at random on the other side of the straight line <var>AB</var>, and with centre <var>C</var> and distance <var>CD</var> let the circle <var>EFG</var> be described; [<a href=\"#elem.1.post.3\">Post. 3</a>] \n        let the straight line <var>EG</var>\n         be bisected at <var>H</var>, [<ref target=\"elem.1.10\" targOrder=\"U\">I. 10</a>] and let the straight lines <var>CG</var>, <var>CH</var>, <var>CE</var> be joined. [<a href=\"#elem.1.post.1\">Post. 1</a>]",
        "I say that <var>CH</var> has been drawn perpendicular to the given infinite straight line <var>AB</var> from the given point <var>C</var> which is not on it. ",
        "For, since <var>GH</var> is equal to <var>HE</var>, and <var>HC</var> is common, the two sides <var>GH</var>, <var>HC</var> are equal to the two sides <var>EH</var>, <var>HC</var> respectively; and the base <var>CG</var> is equal to the base <var>CE</var>; therefore the angle <var>CHG</var> is equal to the angle <var>EHC</var>. [<a href=\"#elem.1.8\">I. 8</a>] And they are adjacent angles.",
        "But, when a straight line set up on a straight line makes the adjacent angles equal to one another, each of the equal angles is right, and the straight line standing on the other is called a perpendicular to that on which it stands. [<ref target=\"elem.1.def.10\" targOrder=\"U\">Def. 10</a>]",
        "Therefore <var>CH</var> has been drawn perpendicular to the given infinite straight line <var>AB</var> from the given point <var>C</var> which is not on it."
      ],
      "qed": "Q. E. F."
    },
    {
      "id": "elem.1.13",
      "claim": "If a straight line set up on a straight line make angles, it will make either two right angles or angles equal to two right angles.",
      "proof": [
        "For let any straight line <var>AB</var> set up on the straight line <var>CD</var> make the angles <var>CBA</var>, <var>ABD</var>;",
        "I say that the angles <var>CBA</var>, <var>ABD</var> are either two right angles or equal to two right angles. ",
        "Now, if the angle <var>CBA</var> is equal to the angle <var>ABD</var>, they are two right angles. [<ref target=\"elem.1.def.10\" targOrder=\"U\">Def. 10</a>]",
        "But, if not, let <var>BE</var> be drawn from the point <var>B</var> at right angles to <var>CD</var>; [<a href=\"#elem.1.11\">I. 11</a>] therefore the angles <var>CBE</var>, <var>EBD</var> are two right angles.\n        ",
        "Then, since the angle <var>CBE</var> is equal to the two angles <var>CBA</var>, <var>ABE</var>, let the angle <var>EBD</var> be added to each; therefore the angles <var>CBE</var>, <var>EBD</var> are equal to the three angles <var>CBA</var>, <var>ABE</var>, <var>EBD</var>. [<title>C. N</title>. 2]\n        ",
        "Again, since the angle <var>DBA</var> is equal to the two angles <var>DBE</var>, <var>EBA</var>, let the angle <var>ABC</var> be added to each; therefore the angles <var>DBA</var>. <var>ABC</var> are equal to the three angles <var>DBE</var>, <var>EBA</var>, <var>ABC</var>. [<title>C. N</title>. 2]\n        ",
        "But the angles <var>CBE</var>, <var>EBD</var> were also proved equal to the same three angles; and things which are equal to the same thing are also equal to one another; [<title>C. N</title>. 1] therefore the angles <var>CBE</var>, <var>EBD</var> are also equal to the angles <var>DBA</var>, <var>ABC</var>.\n        But the angles <var>CBE</var>, <var>EBD</var> are two right angles; therefore the angles <var>DBA</var>, <var>ABC</var> are also equal to two right angles.",
        "Therefore etc."
      ],
      "qed": "Q. E. D."
    },
    {
      "id": "elem.1.14",
      "claim": "If with any straight line, and at a point on it, two straight lines not lying on the same side make the adjacent angles equal to two right angles, the two straight lines will be in a straight line with one another. ",
      "proof": [
        "For with any straight line <var>AB</var>, and at the point <var>B</var> on it, let the two straight lines <var>BC</var>, <var>BD</var> not lying on the same side make the adjacent angles <var>ABC</var>, <var>ABD</var> equal to two right angles;",
        "I say that <var>BD</var> is in a straight line with <var>CB</var>. ",
        "For, if <var>BD</var> is not in a straight line with <var>BC</var>, let <var>BE</var> be in a straight line with <var>CB</var>.",
        "Then, since the straight line <var>AB</var> stands on the straight line <var>CBE</var>, \n        the angles <var>ABC</var>, <var>ABE</var> are equal to two right angles. [<a href=\"#elem.1.13\">I. 13</a>] But the angles <var>ABC</var>, <var>ABD</var> are also equal to two right angles; therefore the angles <var>CBA</var>, <var>ABE</var> are equal to the angles <var>CBA</var>, <var>ABD</var>. [<a href=\"#elem.1.post.4\">Post. 4</a> and <a href=\"#elem.1.c.n.1\">C.N. 1</a>]",
        "Let the angle <var>CBA</var> be subtracted from each; therefore the remaining angle <var>ABE</var> is equal to the remaining angle <var>ABD</var>, [<a href=\"#elem.1.c.n.3\">C.N. 3</a>] the less to the greater: which is impossible. Therefore <var>BE</var> is not in a straight line with <var>CB</var>.",
        "Similarly we can prove that neither is any other straight line except <var>BD</var>. Therefore <var>CB</var> is in a straight line with <var>BD</var>.",
        "Therefore etc."
      ],
      "qed": "Q. E. D."
    },
    {
      "id": "elem.1.15",
      "claim": "If two straight lines cut one another, they make the vertical angles equal to one another.",
      "proof": [
        "For let the straight lines <var>AB</var>, <var>CD</var> cut one another at the point <var>E</var>; ",
        "I say that the angle <var>AEC</var> is equal to the angle <var>DEB</var>, and the angle <var>CEB</var> to the angle <var>AED</var>.\n        ",
        "For, since the straight line <var>AE</var> stands on the straight line <var>CD</var>, making the angles <var>CEA</var>, <var>AED</var>, the angles <var>CEA</var>, <var>AED</var> are equal to two right angles [<a href=\"#elem.1.13\">I. 13</a>]\n        ",
        "Again, since the straight line <var>DE</var> stands on the straight line <var>AB</var>, making the angles <var>AED</var>, <var>DEB</var>, the angles <var>AED</var>, <var>DEB</var> are equal to two right angles. [<a href=\"#elem.1.13\">I. 13</a>]\n        ",
        "But the angles <var>CEA</var>, <var>AED</var> were also proved equal to two right angles; therefore the angles <var>CEA</var>, <var>AED</var> are equal to the angles <var>AED</var>\n         <var>DEB</var>. [<a href=\"#elem.1.post.4\">Post. 4</a> and <a href=\"#elem.1.c.n.1\">C. N. 1</a>] Let the angle <var>AED</var> be subtracted from each; therefore the remaining angle <var>CEA</var> is equal to the remaining angle <var>BED</var>. [<a href=\"#elem.1.c.n.3\">C. N. 3</a>]",
        "Similarly it can be proved that the angles <var>CEB</var>, <var>DEA</var> are also equal.",
        "Therefore etc. Q. E. D. "
      ]
    },
    {
      "id": "elem.1.16",
      "claim": "In any triangle, if one of the sides be produced, the exterior angle is greater than either of the interior and opposite angles.",
      "proof": [
        "Let <var>ABC</var> be a triangle, and let one side of it <var>BC</var> be produced to <var>D</var>; ",
        "I say that the exterior angle <var>ACD</var> is greater than either of the interior and opposite angles <var>CBA</var>, <var>BAC</var>.",
        "Let <var>AC</var> be bisected at <var>E</var> [<ref target=\"elem.1.10\" targOrder=\"U\">I. 10</a>], and let <var>BE</var> be joined and produced in a straight line to <var>F</var>; ",
        "let <var>EF</var> be made equal to <var>BE</var>[<a href=\"#elem.1.3\">I. 3</a>], let <var>FC</var> be joined [<a href=\"#elem.1.post.1\">Post. 1</a>], and let <var>AC</var> be drawn through to <var>G</var> [<a href=\"#elem.1.post.2\">Post. 2</a>].",
        "Then, since <var>AE</var> is equal to <var>EC</var>, and <var>BE</var> to <var>EF</var>, the two sides <var>AE</var>, <var>EB</var> are equal to the two sides <var>CE</var>, <var>EF</var> respectively; and the angle <var>AEB</var> is equal to the angle <var>FEC</var>, for they are vertical angles. [<a href=\"#elem.1.15\">I. 15</a>] Therefore the base <var>AB</var> is equal to the base <var>FC</var>, and the triangle <var>ABE</var> is equal to the triangle <var>CFE</var>, and the remaining angles are equal to the remaining angles respectively, namely those which the equal sides subtend; [<a href=\"#elem.1.4\">I. 4</a>] therefore the angle <var>BAE</var> is equal to the angle <var>ECF</var>.\n        ",
        "But the angle <var>ECD</var> is greater than the angle <var>ECF</var>; [<title>C. N</title>. 5] therefore the angle <var>ACD</var> is greater than the angle <var>BAE</var>.",
        "Similarly also, if <var>BC</var> be bisected, the angle <var>BCG</var>, that is, the angle <var>ACD</var> [<a href=\"#elem.1.15\">I. 15</a>], can be proved greater than the angle <var>ABC</var> as well.",
        "Therefore etc."
      ],
      "qed": "Q. E. D."
    },
    {
      "id": "elem.1.17",
      "claim": "In any triangle two angles taken together in any manner are less than two right angles.",
      "proof": [
        "Let <var>ABC</var> be a triangle; I say that two angles of the triangle <var>ABC</var> taken together in any manner are less than two right angles.",
        "For let <var>BC</var> be produced to <var>D</var>. [<a href=\"#elem.1.post.2\">Post. 2</a>]",
        "Then, since the angle <var>ACD</var> is an exterior angle of the triangle <var>ABC</var>,",
        "it is greater than the interior and opposite angle <var>ABC</var>. [<a href=\"#elem.1.16\">I. 16</a>] Let the angle <var>ACB</var> be added to each; therefore the angles <var>ACD</var>, <var>ACB</var> are greater than the angles <var>ABC</var>, <var>BCA</var>.  But the angles <var>ACD</var>, <var>ACB</var> are equal to two right angles. [<a href=\"#elem.1.13\">I. 13</a>]",
        "Therefore the angles <var>ABC</var>, <var>BCA</var> are less than two right angles.",
        "Similarly we can prove that the angles <var>BAC</var>, <var>ACB</var> are also less than two right angles, and so are the angles <var>CAB</var>, <var>ABC</var> as well.",
        "Therefore etc."
      ],
      "qed": "Q. E. D."
    },
    {
      "id": "elem.1.18",
      "claim": "In any triangle the greater side subtends the greater angle.",
      "proof": [
        "For let <var>ABC</var> be a triangle having the side <var>AC</var> greater than <var>AB</var>;",
        "I say that the angle <var>ABC</var> is also greater than the angle <var>BCA</var>.",
        "For, since <var>AC</var> is greater than <var>AB</var>, let <var>AD</var> be made equal to <var>AB</var> [<a href=\"#elem.1.3\">I. 3</a>], and let <var>BD</var> bejoined.",
        "Then, since the angle <var>ADB</var> is an exterior angle of the triangle <var>BCD</var>, ",
        "it is greater than the interior and opposite angle <var>DCB</var>. [<a href=\"#elem.1.16\">I. 16</a>]",
        "But the angle <var>ADB</var> is equal to the angle <var>ABD</var>, since the side <var>AB</var> is equal to <var>AD</var>; therefore the angle <var>ABD</var> is also greater than the angle <var>ACB</var>; therefore the angle <var>ABC</var> is much greater than the angle <var>ACB</var>.",
        "Therefore etc."
      ],
      "qed": "Q. E. D."
    },
    {
      "id": "elem.1.19",
      "claim": "In any triangle the greater angle is subtended by the greater side.",
      "proof": [
        "Let <var>ABC</var> be a triangle having the angle <var>ABC</var> greater than the angle <var>BCA</var>;",
        "I say that the side <var>AC</var> is also greater than the side <var>AB</var>.",
        "For, if not, <var>AC</var> is either equal to <var>AB</var> or less.",
        "Now <var>AC</var> is not equal to <var>AB</var>; for then the angle <var>ABC</var> would also have been equal to the angle <var>ACB</var>; [<a href=\"#elem.1.5\">I. 5</a>] but it is not; \n        therefore <var>AC</var> is not equal to <var>AB</var>.",
        "Neither is <var>AC</var> less than <var>AB</var>, for then the angle <var>ABC</var> would also have been less than the angle <var>ACB</var>; [<a href=\"#elem.1.18\">I. 18</a>] but it is not; therefore <var>AC</var> is not less than <var>AB</var>.",
        "And it was proved that it is not equal either. Therefore <var>AC</var> is greater than <var>AB</var>.",
        "Therefore etc."
      ],
      "qed": "Q. E. D."
    },
    {
      "id": "elem.1.20",
      "claim": "In any triangle two sides taken together in any manner are greater than the remaining one.",
      "proof": [
        "For let <var>ABC</var> be a triangle; I say that in the triangle <var>ABC</var> two sides taken together in any manner are greater than the remaining one, namely <var>BA</var>, <var>AC</var> greater than <var>BC</var>, <var>AB</var>, <var>BC</var> greater than <var>AC</var>, <var>BC</var>, <var>CA</var> greater than <var>AB</var>.",
        "For let <var>BA</var> be drawn through to the point <var>D</var>, let <var>DA</var> be made equal to <var>CA</var>, and let <var>DC</var> be joined.",
        "Then, since <var>DA</var> is equal to <var>AC</var>, the angle <var>ADC</var> is also equal to the angle <var>ACD</var>; [<a href=\"#elem.1.5\">I. 5</a>] \n        therefore the angle <var>BCD</var> is greater than the angle <var>ADC</var>. [<a href=\"#elem.1.c.n.5\">C.N. 5</a>]",
        "And, since <var>DCB</var> is a triangle having the angle <var>BCD</var> greater than the angle <var>BDC</var>, and the greater angle is subtended by the greater side, [<a href=\"#elem.1.19\">I. 19</a>] therefore <var>DB</var> is greater than <var>BC</var>.\n        ",
        "But <var>DA</var> is equal to <var>AC</var>; therefore <var>BA</var>, <var>AC</var> are greater than <var>BC</var>.",
        "Similarly we can prove that <var>AB</var>, <var>BC</var> are also greater than <var>CA</var>, and <var>BC</var>, <var>CA</var> than <var>AB</var>.",
        "Therefore etc."
      ],
      "qed": "Q. E. D."
    },
    {
      "id": "elem.1.21",
      "claim": "If on one of the sides of a triangle, from its extremities, there be constructed two straight lines meeting within the triangle, the straight lines so constructed will be less than the remaining two sides of the triangle, but will contain a greater angle.",
      "proof": [
        "On <var>BC</var>, one of the sides of the triangle <var>ABC</var>, from its extremities <var>B</var>, <var>C</var>, let the two straight lines <var>BD</var>, <var>DC</var> be constructed meeting within the triangle;",
        "I say that <var>BD</var>, <var>DC</var> are less than the remaining two sides of the triangle <var>BA</var>, <var>AC</var>, but contain an angle <var>BDC</var> greater than the angle <var>BAC</var>. ",
        "For let <var>BD</var> be drawn through to <var>E</var>.",
        "Then, since in any triangle two sides are greater than the remaining one, [<ref target=\"elem.1.20\" targOrder=\"U\">I. 20</a>] therefore, in the triangle <var>ABE</var>, the two sides <var>AB</var>, <var>AE</var> are greater than <var>BE</var>.",
        "Let <var>EC</var> be added to each; therefore <var>BA</var>, <var>AC</var> are greater than <var>BE</var>, <var>EC</var>.\n        ",
        "Again, since, in the triangle <var>CED</var>, the two sides <var>CE</var>, <var>ED</var> are greater than <var>CD</var>, let <var>DB</var> be added to each; therefore <var>CE</var>, <var>EB</var> are greater than <var>CD</var>, <var>DB</var>.",
        "But <var>BA</var>, <var>AC</var> were proved greater than <var>BE</var>, <var>EC</var>; therefore <var>BA</var>, <var>AC</var> are much greater than <var>BD</var>, <var>DC</var>.",
        "Again, since in any triangle the exterior angle is greater than the interior and opposite angle, [<a href=\"#elem.1.16\">I. 16</a>] therefore, in the triangle <var>CDE</var>, the exterior angle <var>BDC</var> is greater than the angle <var>CED</var>.\n        ",
        "For the same reason, moreover, in the triangle <var>ABE</var> also, the exterior angle <var>CEB</var> is greater than the angle <var>BAC</var>. But the angle <var>BDC</var> was proved greater than the angle <var>CEB</var>; therefore the angle <var>BDC</var> is much greater than the angle <var>BAC</var>.\n        ",
        "Therefore etc."
      ],
      "qed": "Q. E. D."
    },
    {
      "id": "elem.1.22",
      "claim": "Out of three straight lines, which are equal to three given straight lines, to construct a triangle: thus it is necessary that two of the straight lines taken together in any manner should be greater than the remaining one. [<ref target=\"elem.1.20\" targOrder=\"U\">I. 20</a>]",
      "proof": [
        "Let the three given straight lines be <var>A</var>, <var>B</var>, <var>C</var>, and of these let two taken together in any manner be greater than the remaining one, namely <var>A</var>, <var>B</var> greater than <var>C</var>, <var>A</var>, <var>C</var> greater than <var>B</var>, and <var>B</var>, <var>C</var> greater than <var>A</var>; thus it is required to construct a triangle out of straight lines equal to <var>A</var>, <var>B</var>, <var>C</var>. ",
        "Let there be set out a straight line <var>DE</var>, terminated at <var>D</var> but of infinite length in the direction of <var>E</var>, and let <var>DF</var> be made equal to <var>A</var>, <var>FG</var> equal to <var>B</var>, and <var>GH</var> equal to <var>C</var>. [<a href=\"#elem.1.3\">I. 3</a>]",
        "With centre <var>F</var> and distance <var>FD</var> let the circle <var>DKL</var> be described; again, with centre <var>G</var> and distance <var>GH</var> let the circle <var>KLH</var> be described; and let <var>KF</var>, <var>KG</var> be joined;",
        "I say that the triangle <var>KFG</var> has been constructed out of three straight lines equal to <var>A</var>, <var>B</var>, <var>C</var>. ",
        "For, since the point <var>F</var> is the centre of the circle <var>DKL</var>, <var>FD</var> is equal to <var>FK</var>.",
        "But <var>FD</var> is equal to <var>A</var>; therefore <var>KF</var> is also equal to <var>A</var>.",
        "Again, since the point <var>G</var> is the centre of the circle <var>LKH</var>, <var>GH</var> is equal to <var>GK</var>.",
        "But <var>GH</var> is equal to <var>C</var>; therefore <var>KG</var> is also equal to <var>C</var>. And <var>FG</var> is also equal to <var>B</var>; therefore the three straight lines <var>KF</var>, <var>FG</var>, <var>GK</var> are equal to the three straight lines <var>A</var>, <var>B</var>, <var>C</var>.",
        "Therefore out of the three straight lines <var>KF</var>, <var>FG</var>, <var>GK</var>, which are equal to the three given straight lines <var>A</var>, <var>B</var>, <var>C</var>, the triangle <var>KFG</var> has been constructed."
      ],
      "qed": "Q. E. F."
    },
    {
      "id": "elem.1.23",
      "claim": "On a given straight line and at a point on it to construct a rectilineal angle equal to a given rectilineal angle.",
      "proof": [
        "Let <var>AB</var> be the given straight line, <var>A</var> the point on it, and the angle <var>DCE</var> the given rectilineal angle;",
        "thus it is required to construct on the given straight line <var>AB</var>, and at the point <var>A</var> on it, a rectilineal angle equal to the given rectilineal angle <var>DCE</var>. ",
        "On the straight lines <var>CD</var>, <var>CE</var> respectively let the points <var>D</var>, <var>E</var> be taken at random; let <var>DE</var> be joined, and out of three straight lines which are equal to the three straight lines <var>CD</var>, <var>DE</var>, <var>CE</var> let the triangle <var>AFG</var> be constructed in such a way that <var>CD</var> is equal to <var>AF</var>, <var>CE</var> to <var>AG</var>, and further <var>DE</var> to <var>FG</var>.",
        "Then, since the two sides <var>DC</var>, <var>CE</var> are equal to the two sides <var>FA</var>, <var>AG</var> respectively, and the base <var>DE</var> is equal to the base <var>FG</var>, the angle <var>DCE</var> is equal to the angle <var>FAG</var>. [<a href=\"#elem.1.8\">I. 8</a>]",
        "Therefore on the given straight line <var>AB</var>, and at the point <var>A</var> on it, the rectilineal angle <var>FAG</var> has been constructed equal to the given rectilineal angle <var>DCE</var>."
      ],
      "qed": "Q. E. F."
    },
    {
      "id": "elem.1.24",
      "claim": "If two triangles have the two sides equal to two sides respectively, but have the one of the angles contained by the equal straight lines greater than the other, they will also have the base greater than the base. ",
      "proof": [
        "Let <var>ABC</var>, <var>DEF</var> be two triangles having the two sides <var>AB</var>, <var>AC</var> equal to the two sides <var>DE</var>, <var>DF</var> respectively, namely <var>AB</var> to <var>DE</var>, and <var>AC</var> to <var>DF</var>, and let the angle at <var>A</var> be greater than the angle at <var>D</var>;",
        "I say that the base <var>BC</var> is also greater than the base <var>EF</var>. ",
        "For, since the angle <var>BAC</var> is greater than the angle <var>EDF</var>, let there be constructed, on the straight line <var>DE</var>, and at the point <var>D</var> on it, the angle <var>EDG</var>\n        equal to the angle <var>BAC</var>; [<a href=\"#elem.1.23\">I. 23</a>] let <var>DG</var> be made equal to either of the two straight lines <var>AC</var>, <var>DF</var>, and let <var>EG</var>, <var>FG</var> be joined. \n        ",
        "Then, since <var>AB</var> is equal to <var>DE</var>, and <var>AC</var> to <var>DG</var>, the two sides <var>BA</var>, <var>AC</var> are equal to the two sides <var>ED</var>, <var>DG</var>, respectively; and the angle <var>BAC</var> is equal to the angle <var>EDG</var>; therefore the base <var>BC</var> is equal to the base <var>EG</var>. [<a href=\"#elem.1.4\">I. 4</a>]",
        "Again, since <var>DF</var> is equal to <var>DG</var>, the angle <var>DGF</var> is also equal to the angle <var>DFG</var>; [<a href=\"#elem.1.5\">I. 5</a>] therefore the angle <var>DFG</var> is greater than the angle <var>EGF</var>.",
        "Therefore the angle <var>EFG</var> is much greater than the angle <var>EGF</var>.",
        "And, since <var>EFG</var> is a triangle having the angle <var>EFG</var>\n        greater than the angle <var>EGF</var>, and the greater angle is subtended by the greater side, [<a href=\"#elem.1.19\">I. 19</a>] the side <var>EG</var> is also greater than <var>EF</var>.",
        "But <var>EG</var> is equal to <var>BC</var>. Therefore <var>BC</var> is also greater than <var>EF</var>.\n        ",
        "Therefore etc."
      ],
      "qed": "Q. E. D."
    },
    {
      "id": "elem.1.25",
      "claim": "If two triangles have the two sides equal to two sides respectively, but have the base greater than the base, they will also have the one of the angles contained by the equal straight lines greater than the other.",
      "proof": [
        "Let <var>ABC</var>, <var>DEF</var> be two triangles having the two sides <var>AB</var>, <var>AC</var> equal to the two sides <var>DE</var>, <var>DF</var> respectively, namely <var>AB</var> to <var>DE</var>, and <var>AC</var> to <var>DF</var>; and let the base <var>BC</var> be greater than the base <var>EF</var>;",
        "I say that the angle <var>BAC</var> is also greater than the angle <var>EDF</var>. ",
        "For, if not, it is either equal to it or less.",
        "Now the angle <var>BAC</var> is not equal to the angle <var>EDF</var>; for then the base <var>BC</var> would also have been equal to the base <var>EF</var>, [<a href=\"#elem.1.4\">I. 4</a>] but it is not; therefore the angle <var>BAC</var> is not equal to the angle <var>EDF</var>.",
        "Neither again is the angle <var>BAC</var> less than the angle <var>EDF</var>; for then the base <var>BC</var> would also have been less than the base <var>EF</var>, [<a href=\"#elem.1.24\">I. 24</a>] but it is not; therefore the angle <var>BAC</var> is not less than the angle <var>EDF</var>.",
        "But it was proved that it is not equal either; therefore the angle <var>BAC</var> is greater than the angle <var>EDF</var>.",
        "Therefore etc."
      ],
      "qed": "Q. E. D."
    },
    {
      "id": "elem.1.26",
      "claim": "If two triangles have the two angles equal to two angles respectively, and one side equal to one side, namely, either the side adjoining the equal angles, or that subtending one of the equal angles, they will also have the remaining sides equal to the remaining sides and the remaining angle to the remaining angle. ",
      "proof": [
        "Let <var>ABC</var>, <var>DEF</var> be two triangles having the two angles <var>ABC</var>, <var>BCA</var> equal to the two angles <var>DEF</var>, <var>EFD</var> respectively, namely the angle <var>ABC</var> to the angle <var>DEF</var>, and the angle <var>BCA</var> to the angle <var>EFD</var>; and let them also have one side equal to one side, first that adjoining the equal angles, namely <var>BC</var> to <var>EF</var>;",
        "I say that they will also have the remaining sides equal to the remaining sides respectively, namely <var>AB</var> to <var>DE</var> and <var>AC</var> to <var>DF</var>, and the remaining angle to the remaining angle, namely the angle <var>BAC</var> to the angle <var>EDF</var>. ",
        "For, if <var>AB</var> is unequal to <var>DE</var>, one of them is greater.",
        "Let <var>AB</var> be greater, and let <var>BG</var> be made equal to <var>DE</var>; and let <var>GC</var> be joined. ",
        "Then, since <var>BG</var> is equal to <var>DE</var>, and <var>BC</var> to <var>EF</var>, the two sides <var>GB</var>, <var>BC</var> are equal to the two sides <var>DE</var>, <var>EF</var> respectively; and the angle <var>GBC</var> is equal to the angle <var>DEF</var>; therefore the base <var>GC</var> is equal to the base <var>DF</var>, and the triangle <var>GBC</var> is equal to the triangle <var>DEF</var>, and the remaining angles will be equal to the remaining angles, namely those which the equal sides subtend; [<a href=\"#elem.1.4\">I. 4</a>] therefore the angle <var>GCB</var> is equal to the angle <var>DFE</var>. But the angle <var>DFE</var> is by hypothesis equal to the angle <var>BCA</var>; therefore the angle <var>BCG</var> is equal to the angle <var>BCA</var>, the less to the greater: which is impossible. Therefore <var>AB</var> is not unequal to <var>DE</var>, and is therefore equal to it.",
        "But <var>BC</var> is also equal to <var>EF</var>; therefore the two sides <var>AB</var>, <var>BC</var> are equal to the two sides <var>DE</var>, <var>EF</var> respectively, and the angle <var>ABC</var> is equal to the angle <var>DEF</var>; therefore the base <var>AC</var> is equal to the base <var>DF</var>, and the remaining angle <var>BAC</var> is equal to the remaining angle <var>EDF</var>. [<a href=\"#elem.1.4\">I. 4</a>]\n        ",
        "Again, let sides subtending equal angles be equal, as <var>AB</var> to <var>DE</var>;",
        "I say again that the remaining sides will be equal to the remaining sides, namely <var>AC</var> to <var>DF</var> and <var>BC</var> to <var>EF</var>, and further the remaining angle <var>BAC</var> is equal to the remaining angle <var>EDF</var>.",
        "For, if <var>BC</var> is unequal to <var>EF</var>, one of them is greater.",
        "Let <var>BC</var> be greater, if possible, and let <var>BH</var> be made equal to <var>EF</var>; let <var>AH</var> be joined. ",
        "Then, since <var>BH</var> is equal to <var>EF</var>, and <var>AB</var> to <var>DE</var>, the two sides <var>AB</var>, <var>BH</var> are equal to the two sides <var>DE</var>, <var>EF</var> respectively, and they contain equal angles; therefore the base <var>AH</var> is equal to the base <var>DF</var>, and the triangle <var>ABH</var> is equal to the triangle <var>DEF</var>, and the remaining angles will be equal to the remaining angles, namely those which the equal sides subtend; [<a href=\"#elem.1.4\">I. 4</a>] therefore the angle <var>BHA</var> is equal to the angle <var>EFD</var>.",
        "But the angle <var>EFD</var> is equal to the angle <var>BCA</var>; therefore, in the triangle <var>AHC</var>, the exterior angle <var>BHA</var> is equal to the interior and opposite angle <var>BCA</var>: which is impossible. [<a href=\"#elem.1.16\">I. 16</a>]",
        "Therefore <var>BC</var> is not unequal to <var>EF</var>, and is therefore equal to it.",
        "But <var>AB</var> is also equal to <var>DE</var>; therefore the two sides <var>AB</var>, <var>BC</var> are equal to the two sides <var>DE</var>, <var>EF</var> respectively, and they contain equal angles; therefore the base <var>AC</var> is equal to the base <var>DF</var>, the triangle <var>ABC</var> equal to the triangle <var>DEF</var>, and the remaining angle <var>BAC</var> equal to the remaining angle <var>EDF</var>. [<a href=\"#elem.1.4\">I. 4</a>]",
        "Therefore etc."
      ],
      "qed": "Q. E. D."
    },
    {
      "id": "elem.1.27",
      "claim": "If a straight line falling on two straight lines make the alternate angles equal to one another, the straight lines will be parallel to one another.",
      "proof": [
        "For let the straight line <var>EF</var> falling on the two straight lines <var>AB</var>, <var>CD</var> make the alternate angles <var>AEF</var>, <var>EFD</var> equal to one another;",
        "I say that <var>AB</var> is parallel to <var>CD</var>.",
        "For, if not, <var>AB</var>, <var>CD</var> when produced will meet either in the direction of <var>B</var>, <var>D</var> or towards <var>A</var>, <var>C</var>. ",
        "Let them be produced and meet, in the direction of <var>B</var>, <var>D</var>, at <var>G</var>.",
        "Then, in the triangle <var>GEF</var>, the exterior angle <var>AEF</var> is equal to the interior and opposite angle <var>EFG</var>: which is impossible. [<a href=\"#elem.1.16\">I. 16</a>]",
        "Therefore <var>AB</var>, <var>CD</var> when produced will not meet in the direction of <var>B</var>, <var>D</var>.",
        "Similarly it can be proved that neither will they meet towards <var>A</var>, <var>C</var>. ",
        "But straight lines which do not meet in either direction are parallel; [<a href=\"#elem.1.def.23\">Def. 23</a>] therefore <var>AB</var> is parallel to <var>CD</var>.",
        "Therefore etc."
      ],
      "qed": "Q. E. D."
    },
    {
      "id": "elem.1.28",
      "claim": "If a straight line falling on two straight lines make the exterior angle equal to the interior and opposite angle on the same side, or the interior angles on the same side equal to two right angles, the straight lines will be parallel to one another. ",
      "proof": [
        "For let the straight line <var>EF</var> falling on the two straight lines <var>AB</var>, <var>CD</var> make the exterior angle <var>EGB</var> equal to the interior and opposite angle <var>GHD</var>, or the interior angles on the same side, namely <var>BGH</var>, <var>GHD</var>, equal to two right angles;",
        "I say that <var>AB</var> is parallel to <var>CD</var>.",
        "For, since the angle <var>EGB</var> is equal to the angle <var>GHD</var>, while the angle <var>EGB</var> is equal to the angle <var>AGH</var>, [<a href=\"#elem.1.15\">I. 15</a>]  the angle <var>AGH</var> is also equal to the angle <var>GHD</var>; and they are alternate; therefore <var>AB</var> is parallel to <var>CD</var>. [<a href=\"#elem.1.27\">I. 27</a>]",
        "Again, since the angles <var>BGH</var>, <var>GHD</var> are equal to two right angles, and the angles <var>AGH</var>, <var>BGH</var> are also equal to two right angles, [<a href=\"#elem.1.13\">I. 13</a>] the angles <var>AGH</var>, <var>BGH</var> are equal to the angles <var>BGH</var>, <var>GHD</var>.",
        "Let the angle <var>BGH</var> be subtracted from each; therefore the remaining angle <var>AGH</var> is equal to the remaining angle <var>GHD</var>; and they are alternate; therefore <var>AB</var> is parallel to <var>CD</var>. [<a href=\"#elem.1.27\">I. 27</a>]",
        "Therefore etc."
      ],
      "qed": "Q. E. D."
    },
    {
      "id": "elem.1.29",
      "claim": "A straight line falling on parallel straight lines makes the alternate angles equal to one another, the exterior angle equal to the interior and opposite angle, and the interior angles on the same side equal to two right angles. ",
      "proof": [
        "For let the straight line <var>EF</var> fall on the parallel straight lines <var>AB</var>, <var>CD</var>;",
        "I say that it makes the alternate angles <var>AGH</var>, <var>GHD</var> equal, the exterior angle <var>EGB</var> equal to the interior and opposite angle <var>GHD</var>, and the interior angles on the same side, namely <var>BGH</var>, <var>GHD</var>, equal to two right angles.",
        "For, if the angle <var>AGH</var> is unequal to the angle <var>GHD</var>, one of them is greater. ",
        "Let the angle <var>AGH</var> be greater. ",
        "Let the angle <var>BGH</var> be added to each; therefore the angles <var>AGH</var>, <var>BGH</var> are greater than the angles <var>BGH</var>, <var>GHD</var>. ",
        "But the angles <var>AGH</var>, <var>BGH</var> are equal to two right angles; [<a href=\"#elem.1.13\">I. 13</a>] therefore the angles <var>BGH</var>, <var>GHD</var> are less than two right angles.",
        "But straight lines produced indefinitely from angles less than two right angles meet; [<a href=\"#elem.1.post.5\">Post. 5</a>] therefore <var>AB</var>, <var>CD</var>, if produced indefinitely, will meet; but they do not meet, because they are by hypothesis parallel.",
        "Therefore the angle <var>AGH</var> is not unequal to the angle <var>GHD</var>, and is therefore equal to it.\n        ",
        "Again, the angle <var>AGH</var> is equal to the angle <var>EGB</var>; [<a href=\"#elem.1.15\">I. 15</a>] therefore the angle <var>EGB</var> is also equal to the angle <var>GHD</var>. [<a href=\"#elem.1.c.n.1\">C.N. 1</a>]",
        "Let the angle <var>BGH</var> be added to each; therefore the angles <var>EGB</var>, <var>BGH</var> are equal to the angles <var>BGH</var>, <var>GHD</var>. [<a href=\"#elem.1.c.n.2\">C.N. 2</a>]",
        "But the angles <var>EGB</var>, <var>BGH</var> are equal to two right angles; [<a href=\"#elem.1.13\">I. 13</a>] therefore the angles <var>BGH</var>, <var>GHD</var> are also equal to two right angles.",
        "Therefore etc."
      ],
      "qed": "Q. E. D."
    },
    {
      "id": "elem.1.30",
      "claim": "Straight lines parallel to the same straight line are also parallel to one another.",
      "proof": [
        "Let each of the straight lines <var>AB</var>, <var>CD</var> be parallel to <var>EF</var>; I say that <var>AB</var> is also parallel to <var>CD</var>. ",
        "For let the straight line <var>GK</var> fall upon them; ",
        "Then, since the straight line <var>GK</var> has fallen on the parallel straight lines <var>AB</var>, <var>EF</var>, the angle <var>AGK</var> is equal to the angle <var>GHF</var>. [<a href=\"#elem.1.29\">I. 29</a>]",
        "Again, since the straight line <var>GK</var> has fallen on the parallel straight lines <var>EF</var>, <var>CD</var>, the angle <var>GHF</var> is equal to the angle <var>GKD</var>. [<a href=\"#elem.1.29\">I. 29</a>]\n        ",
        "But the angle <var>AGK</var> was also proved equal to the angle <var>GHF</var>; therefore the angle <var>AGK</var> is also equal to the angle <var>GKD</var>; [<a href=\"#elem.1.c.n.1\">C.N. 1</a>] and they are alternate. ",
        "Therefore <var>AB</var> is parallel to <var>CD</var>."
      ],
      "qed": "Q. E. D."
    },
    {
      "id": "elem.1.31",
      "claim": "Through a given point to draw a straight line parallel to a given straight line.",
      "proof": [
        "Let <var>A</var> be the given point, and <var>BC</var> the given straight line; thus it is required to draw through the point <var>A</var> a straight line parallel to the straight line <var>BC</var>. ",
        "Let a point <var>D</var> be taken at random on <var>BC</var>, and let <var>AD</var> be joined; on the straight line <var>DA</var>, and at the point <var>A</var> on it, let the angle <var>DAE</var> be constructed equal to the angle <var>ADC</var> [<a href=\"#elem.1.23\">I. 23</a>]; and let the straight line <var>AF</var> be produced in a straight line with <var>EA</var>. ",
        "Then, since the straight line <var>AD</var> falling on the two straight lines <var>BC</var>, <var>EF</var> has made the alternate angles <var>EAD</var>, <var>ADC</var> equal to one another, therefore <var>EAF</var> is parallel to <var>BC</var>. [<a href=\"#elem.1.27\">I. 27</a>]",
        "Therefore through the given point <var>A</var> the straight line <var>EAF</var> has been drawn parallel to the given straight line <var>BC</var>."
      ],
      "qed": "Q. E. F."
    },
    {
      "id": "elem.1.32",
      "claim": "In any triangle, if one of the sides be produced, the exterior angle is equal to the two interior and opposite angles, and the three interior angles of the triangle are equal to two right angles.",
      "proof": [
        "Let <var>ABC</var> be a triangle, and let one side of it <var>BC</var> be produced to <var>D</var>;",
        "I say that the exterior angle <var>ACD</var> is equal to the two interior and opposite angles <var>CAB</var>, <var>ABC</var>, and the three interior angles of the triangle <var>ABC</var>, <var>BCA</var>, <var>CAB</var> are equal to two right angles. ",
        "For let <var>CE</var> be drawn through the point <var>C</var> parallel to the straight line <var>AB</var>. [<a href=\"#elem.1.31\">I. 31</a>]",
        "Then, since <var>AB</var> is parallel to <var>CE</var>, and <var>AC</var> has fallen upon them, the alternate angles <var>BAC</var>, <var>ACE</var> are equal to one another. [<a href=\"#elem.1.29\">I. 29</a>]\n        ",
        "Again, since <var>AB</var> is parallel to <var>CE</var>, and the straight line <var>BD</var> has fallen upon them, the exterior angle <var>ECD</var> is equal to the interior and opposite angle <var>ABC</var>. [<a href=\"#elem.1.29\">I. 29</a>]",
        "But the angle <var>ACE</var> was also proved equal to the angle <var>BAC</var>; therefore the whole angle <var>ACD</var> is equal to the two interior and opposite angles <var>BAC</var>, <var>ABC</var>.",
        "Let the angle <var>ACB</var> be added to each; therefore the angles <var>ACD</var>, <var>ACB</var> are equal to the three angles <var>ABC</var>, <var>BCA</var>, <var>CAB</var>.",
        "But the angles <var>ACD</var>, <var>ACB</var> are equal to two right angles; [<a href=\"#elem.1.13\">I. 13</a>] therefore the angles <var>ABC</var>, <var>BCA</var>, <var>CAB</var> are also equal to two right angles.",
        "Therefore etc."
      ],
      "qed": "Q. E. D."
    },
    {
      "id": "elem.1.33",
      "claim": "The straight lines joining equal and parallel straight lines (at the extremities which are) in the same directions (respectively) are themselves also equal and parallel.",
      "proof": [
        "Let <var>AB</var>, <var>CD</var> be equal and parallel, and let the straight  lines <var>AC</var>, <var>BD</var> join them (at the extremities which are) in the same directions (respectively); I say that <var>AC</var>, <var>BD</var> are also equal and parallel.",
        "Let <var>BC</var> be joined. ",
        "Then, since <var>AB</var> is parallel to <var>CD</var>,  and <var>BC</var> has fallen upon them, the alternate angles <var>ABC</var>, <var>BCD</var> are equal to one another. [<a href=\"#elem.1.29\">I. 29</a>]",
        "And, since <var>AB</var> is equal to <var>CD</var>, and <var>BC</var> is common, the two sides <var>AB</var>, <var>BC</var> are equal to the two sides <var>DC</var>, <var>CB</var>; and the angle <var>ABC</var> is equal to the angle <var>BCD</var>; therefore the base <var>AC</var> is equal to the base <var>BD</var>, and the griangle <var>ABC</var> is equal to the triangle <var>DCB</var>, and the remaining angles will be equal to the remaining angles respectively, namely those which the equal sides subtend; [<a href=\"#elem.1.4\">I. 4</a>] therefore the angle <var>ACB</var> is equal to the angle <var>CBD</var>.",
        "And, since the straight line <var>BC</var> falling on the two straight lines <var>AC</var>, <var>BD</var> has made the alternate angles equal to one another, <var>AC</var> is parallel to <var>BD</var>. [<a href=\"#elem.1.27\">I. 27</a>]",
        "And it was also proved equal to it.",
        "Therefore etc."
      ],
      "qed": "Q. E. D."
    },
    {
      "id": "elem.1.34",
      "claim": "In parallelogrammic areas the opposite sides and angles are equal to one another, and the diameter bisects the areas.",
      "proof": [
        "Let <var>ACDB</var> be a parallelogrammic area, and <var>BC</var> its diameter; I say that the opposite sides and angles of the parallelogram <var>ACDB</var> are equal to one another, and the diameter <var>BC</var> bisects it. ",
        "For, since <var>AB</var> is parallel to <var>CD</var>, and the straight line <var>BC</var> has fallen  upon them, the alternate angles <var>ABC</var>, <var>BCD</var> are equal to one another. [<a href=\"#elem.1.29\">I. 29</a>]",
        "Again, since <var>AC</var> is parallel to <var>BD</var>, and <var>BC</var>has fallen upon them, the alternate angles <var>ACB</var>, <var>CBD</var> are equal to one another. [<a href=\"#elem.1.29\">I. 29</a>]",
        "Therefore <var>ABC</var>, <var>DCB</var> are two triangles having the two angles <var>ABC</var>, <var>BCA</var> equal to the two angles <var>DCB</var>, <var>CBD</var> respectively, and one side equal to one side, namely that adjoining the equal angles and common to both of them, <var>BC</var>; therefore they will also have the remaining sides equal to the remaining sides respectively, and the remaining angle to the remaining angle; [<a href=\"#elem.1.26\">I. 26</a>] therefore the side <var>AB</var> is equal to <var>CD</var>, and <var>AC</var> to <var>BD</var>, and further the angle <var>BAC</var> is equal to the angle <var>CDB</var>.",
        "And, since the angle <var>ABC</var> is equal to the angle <var>BCD</var>, and the angle <var>CBD</var> to the angle <var>ACB</var>, the whole angle <var>ABD</var> is equal to the whole angle <var>ACD</var>. [<a href=\"#elem.1.c.n.2\">C.N. 2</a>]\n        And the angle <var>BAC</var> was also proved equal to the angle <var>CDB</var>.",
        "Therefore in parallelogrammic areas the opposite sides and angles are equal to one another.",
        "I say, next, that the diameter also bisects the areas.",
        "For, since <var>AB</var> is equal to <var>CD</var>, and <var>BC</var> is common, the two sides <var>AB</var>, <var>BC</var> are equal to the two sides <var>DC</var>, <var>CB</var> respectively; and the angle <var>ABC</var> is equal to the angle <var>BCD</var>; therefore the base <var>AC</var> is also equal to <var>DB</var>, and the triangle <var>ABC</var> is equal to the triangle <var>DCB</var>. [<a href=\"#elem.1.4\">I. 4</a>]",
        "Therefore the diameter <var>BC</var> bisects the parallelogram <var>ACDB</var>."
      ],
      "qed": "Q. E. D."
    },
    {
      "id": "elem.1.35",
      "claim": "Parallelograms which are on the same base and in the same parallels are equal to one another.",
      "proof": [
        "Let <var>ABCD</var>, <var>EBCF</var> be parallelograms on the same base <var>BC</var> and in the same parallels <var>AF</var>, <var>BC</var>; I say that <var>ABCD</var> is equal to the parallelogram <var>EBCF</var>.",
        "For, since <var>ABCD</var> is a parallelogram, <var>AD</var> is equal to <var>BC</var>. [<a href=\"#elem.1.34\">I. 34</a>]\n        ",
        "For the same reason also <var>EF</var> is equal to <var>BC</var>, so that <var>AD</var> is also equal to <var>EF</var>; [<a href=\"#elem.1.c.n.1\">C.N. 1</a>] and <var>DE</var> is common; therefore the whole <var>AE</var> is equal to the whole <var>DF</var>. [<a href=\"#elem.1.c.n.2\">C.N. 2</a>]",
        "But <var>AB</var> is also equal to <var>DC</var>; [<a href=\"#elem.1.34\">I. 34</a>] therefore the two sides <var>EA</var>, <var>AB</var> are equal to the two sides <var>FD</var>, <var>DC</var> respectively, \n        and the angle <var>FDC</var> is equal to the angle <var>EAB</var>, the exterior to the interior; [<a href=\"#elem.1.29\">I. 29</a>] therefore the base <var>EB</var> is equal to the base <var>FC</var>, and the triangle <var>EAB</var> will be equal to the triangle <var>FDC</var>. [<a href=\"#elem.1.4\">I. 4</a>]",
        "Let <var>DGE</var> be subtracted from each; therefore the trapezium <var>ABGD</var> which remains is equal to the trapezium <var>EGCF</var> which remains. [<a href=\"#elem.1.c.n.3\">C.N. 3</a>] ",
        "Let the triangle <var>GBC</var> be added to each; therefore the whole parallelogram <var>ABCD</var> is equal to the whole parallelogram <var>EBCF</var>. [<a href=\"#elem.1.c.n.2\">C.N. 2</a>]",
        "Therefore etc."
      ],
      "qed": "Q. E. D."
    },
    {
      "id": "elem.1.36",
      "claim": "Parallelograms which are on equal bases and in the same parallels are equal to one another.",
      "proof": [
        "Let <var>ABCD</var>, <var>EFGH</var> be parallelograms which are on equal bases <var>BC</var>, <var>FG</var> and in the same parallels <var>AH</var>, <var>BG</var>;  I say that the parallelogram <var>ABCD</var> is equal to <var>EFGH</var>.",
        "For let <var>BE</var>, <var>CH</var> be joined.",
        "Then, since <var>BC</var> is equal to <var>FG</var> while <var>FG</var> is equal to <var>EH</var>, <var>BC</var> is also equal to <var>EH</var>. [<a href=\"#elem.1.c.n.1\">C.N. 1</a>]",
        "But they are also parallel.",
        "And <var>EB</var>, <var>HC</var> join them; but straight lines joining equal and parallel straight lines (at the extremities which are) in the same directions (respectively) are equal and parallel. [<a href=\"#elem.1.33\">I. 33</a>]",
        "Therefore <var>EBCH</var> is a parallelogram. [<a href=\"#elem.1.34\">I. 34</a>]",
        "And it is equal to <var>ABCD</var>; for it has the same base <var>BC</var> with it, and is in the same parallels <var>BC</var>, <var>AH</var> with it. [<a href=\"#elem.1.35\">I. 35</a>]",
        "For the same reason also <var>EFGH</var> is equal to the same <var>EBCH</var>; [<a href=\"#elem.1.35\">I. 35</a>] so that the parallelogram <var>ABCD</var> is also equal to <var>EFGH</var>. [<a href=\"#elem.1.c.n.1\">C.N. 1</a>]",
        "Therefore etc. Q. E. D."
      ]
    },
    {
      "id": "elem.1.37",
      "claim": "Triangles which are on the same base and in the same parallels are equal to one another.",
      "proof": [
        "Let <var>ABC</var>, <var>DBC</var> be triangles on the same base <var>BC</var> and in the same parallels <var>AD</var>, <var>BC</var>; I say that the triangle <var>ABC</var> is equal to the triangle <var>DBC</var>.",
        "Let <var>AD</var> be produced in both directions to <var>E</var>, <var>F</var>; through <var>B</var> let <var>BE</var> be drawn parallel to <var>CA</var>, [<a href=\"#elem.1.31\">I. 31</a>] and through <var>C</var> let <var>CF</var> be drawn parallel to <var>BD</var>. [<a href=\"#elem.1.31\">I. 31</a>] ",
        "Then each of the figures <var>EBCA</var>, <var>DBCF</var> is a parallelogram; and they are equal, ",
        "for they are on the same base <var>BC</var> and in the same parallels <var>BC</var>, <var>EF</var>. [<a href=\"#elem.1.35\">I. 35</a>]",
        "Moreover the triangle <var>ABC</var> is half of the parallelogram <var>EBCA</var>; for the diameter <var>AB</var> bisects it. [<a href=\"#elem.1.34\">I. 34</a>]",
        "And the triangle <var>DBC</var> is half of the parallelogram <var>DBCF</var>; for the diameter <var>DC</var> bisects it. [<a href=\"#elem.1.34\">I. 34</a>]",
        "[But the halves of equal things are equal to one another.]",
        "Therefore the triangle <var>ABC</var> is equal to the triangle <var>DBC</var>.",
        "Therefore etc."
      ],
      "qed": "Q. E. D."
    },
    {
      "id": "elem.1.38",
      "claim": "Triangles which are on equal bases and in the same parallels are equal to one another.",
      "proof": [
        "Let <var>ABC</var>, <var>DEF</var> be triangles on equal bases <var>BC</var>, <var>EF</var> and in the same parallels <var>BF</var>, <var>AD</var>; I say that the triangle <var>ABC</var> is equal to the triangle <var>DEF</var>. ",
        "For let <var>AD</var> be produced in both directions to <var>G</var>, <var>H</var>; through <var>B</var> let <var>BG</var> be drawn parallel to <var>CA</var>, [<a href=\"#elem.1.31\">I. 31</a>] and through <var>F</var> let <var>FH</var> be drawn parallel to <var>DE</var>.",
        "Then each of the figures <var>GBCA</var>, <var>DEFH</var> is a parallelogram; and <var>GBCA</var> is equal to <var>DEFH</var>; ",
        "for they are on equal bases <var>BC</var>, <var>EF</var> and in the same parallels <var>BF</var>, <var>GH</var>. [<a href=\"#elem.1.36\">I. 36</a>]",
        "Moreover the triangle <var>ABC</var> is half of the parallelogram <var>GBCA</var>; for the diameter <var>AB</var> bisects it. [<a href=\"#elem.1.34\">I. 34</a>]",
        "And the triangle <var>FED</var> is half of the parallelogram <var>DEFH</var>; for the diameter <var>DF</var> bisects it. [<a href=\"#elem.1.34\">I. 34</a>]",
        "[But the halves of equal things are equal to one another.]",
        "Therefore the triangle <var>ABC</var> is equal to the triangle <var>DEF</var>.",
        "Therefore etc."
      ],
      "qed": "Q. E. D."
    },
    {
      "id": "elem.1.39",
      "claim": "Equal triangles which are on the same base and on the same side are also in the same parallels.",
      "proof": [
        "Let <var>ABC</var>, <var>DBC</var> be equal triangles which are on the same base <var>BC</var> and on the same side of it; [I say that they are also in the same parallels.]",
        "And [For] let <var>AD</var> be joined; I say that <var>AD</var> is parallel to <var>BC</var>.",
        "For, if not, let <var>AE</var> be drawn through the point <var>A</var> parallel to the straight line <var>BC</var>, [<a href=\"#elem.1.31\">I. 31</a>] and let <var>EC</var> be joined. ",
        "Therefore the triangle <var>ABC</var> is equal to the triangle <var>EBC</var>; for it is on the same base <var>BC</var> with it and in the same parallels. [<a href=\"#elem.1.37\">I. 37</a>]",
        "But <var>ABC</var> is equal to <var>DBC</var>; therefore <var>DBC</var> is also equal to <var>EBC</var>, [<a href=\"#elem.1.c.n.1\">C.N. 1</a>] the greater to the less: which is impossible.",
        "Therefore <var>AE</var> is not parallel to <var>BC</var>. ",
        "Similarly we can prove that neither is any other straight line except <var>AD</var>; therefore <var>AD</var> is parallel to <var>BC</var>.",
        "Therefore etc."
      ],
      "qed": "Q. E. D."
    },
    {
      "id": "elem.1.40",
      "claim": "Equal triangles which are on equal bases and on the same side are also in the same parallels.",
      "proof": [
        "Let <var>ABC</var>, <var>CDE</var> be equal triangles on equal bases <var>BC</var>, <var>CE</var> and on the same side.",
        "I say that they are also in the same parallels.",
        "For let <var>AD</var> be joined; I say that <var>AD</var> is parallel to <var>BE</var>.",
        "For, if not, let <var>AF</var> be drawn through <var>A</var> parallel to <var>BE</var> [<a href=\"#elem.1.31\">I. 31</a>], and let <var>FE</var> be joined. ",
        "Therefore the triangle <var>ABC</var> is equal to the triangle <var>FCE</var>; for they are on equal bases <var>BC</var>, <var>CE</var> and in the same parallels <var>BE</var>, <var>AF</var>. [<a href=\"#elem.1.38\">I. 38</a>]",
        "But the triangle <var>ABC</var> is equal to the triangle <var>DCE</var>; therefore the triangle <var>DCE</var> is also equal to the triangle <var>FCE</var>, [<a href=\"#elem.1.c.n.1\">C.N. 1</a>] the greater to the less: which is impossible. Therefore <var>AF</var> is not parallel to <var>BE</var>.\n        ",
        "Similarly we can prove that neither is any other straight line except <var>AD</var>; therefore <var>AD</var> is parallel to <var>BE</var>.",
        "Therefore etc."
      ],
      "qed": "Q. E. D."
    },
    {
      "id": "elem.1.41",
      "claim": "If a parallelogram have the same base with a triangle and be in the same parallels, the parallelogram is double of the triangle.",
      "proof": [
        "For let the parallelogram <var>ABCD</var> have the same base <var>BC</var> with the triangle <var>EBC</var>, and let it be in the same parallels <var>BC</var>, <var>AE</var>;",
        "I say that the parallelogram <var>ABCD</var> is double of the triangle <var>BEC</var>.",
        "For let <var>AC</var> be joined.",
        "Then the triangle <var>ABC</var> is equal to the triangle <var>EBC</var>; for it is on the same base <var>BC</var> with it and in the same parallels <var>BC</var>, <var>AE</var>. [<a href=\"#elem.1.37\">I. 37</a>] ",
        "But the parallelogram <var>ABCD</var> is double of the triangle <var>ABC</var>; for the diameter <var>AC</var> bisects it; [<a href=\"#elem.1.34\">I. 34</a>] so that the parallelogram <var>ABCD</var> is also double of the triangle <var>EBC</var>.",
        "Therefore etc."
      ],
      "qed": "Q. E. D."
    },
    {
      "id": "elem.1.42",
      "claim": "To construct, in a given rectilineal angle, a parallelogram equal to a given triangle.",
      "proof": [
        "Let <var>ABC</var> be the given triangle, and <var>D</var> the given rectilineal angle; thus it is required to construct in the rectilineal angle <var>D</var> a parallelogram equal to the triangle <var>ABC</var>. ",
        "Let <var>BC</var> be bisected at <var>E</var>, and let <var>AE</var> be joined; on the straight line <var>EC</var>, and at the point <var>E</var> on it, let the angle <var>CEF</var> be constructed equal to the angle <var>D</var>; [<a href=\"#elem.1.23\">I. 23</a>] through <var>A</var> let <var>AG</var> be drawn parallel to <var>EC</var>, and [<a href=\"#elem.1.31\">I. 31</a>] through <var>C</var> let <var>CG</var> be drawn parallel to <var>EF</var>.",
        "Then <var>FECG</var> is a parallelogram.",
        "And, since <var>BE</var> is equal to <var>EC</var>, the triangle <var>ABE</var> is also equal to the triangle <var>AEC</var>, for they are on equal bases <var>BE</var>, <var>EC</var> and in the same parallels <var>BC</var>, <var>AG</var>; [<a href=\"#elem.1.38\">I. 38</a>] therefore the triangle <var>ABC</var> is double of the triangle <var>AEC</var>.\n        ",
        "But the parallelogram <var>FECG</var> is also double of the triangle <var>AEC</var>, for it has the same base with it and is in the same parallels with it; [<a href=\"#elem.1.41\">I. 41</a>] therefore the parallelogram <var>FECG</var> is equal to the triangle <var>ABC</var>.",
        "And it has the angle <var>CEF</var> equal to the given angle <var>D</var>.",
        "Therefore the parallelogram <var>FECG</var> has been constructed equal to the given triangle <var>ABC</var>, in the angle <var>CEF</var> which is equal to <var>D</var>. Q. E. F."
      ]
    },
    {
      "id": "elem.1.43",
      "claim": "In any parallelogram the complements of the parallelograms about the diameter are equal to one another.",
      "proof": [
        "Let <var>ABCD</var> be a parallelogram, and <var>AC</var> its diameter; and about <var>AC</var> let <var>EH</var>, <var>FG</var> be parallelograms, and <var>BK</var>, <var>KD</var>\n        the so-called complements;",
        "I say that the complement <var>BK</var> is equal to the complement <var>KD</var>.",
        "For, since <var>ABCD</var> is a parallelogram, and <var>AC</var> its diameter, the triangle <var>ABC</var> is equal to the triangle <var>ACD</var>. [<a href=\"#elem.1.34\">I. 34</a>]",
        "Again, since <var>EH</var> is a parallelogram, and <var>AK</var> is its diameter, the triangle <var>AEK</var> is equal to the triangle <var>AHK</var>.\n        \n        For the same reason the triangle <var>KFC</var> is also equal to <var>KGC</var>.",
        "Now, since the triangle <var>AEK</var> is equal to the triangle <var>AHK</var>, and <var>KFC</var> to <var>KGC</var>,\n        the triangle <var>AEK</var> together with <var>KGC</var> is equal to the triangle <var>AHK</var> together with <var>KFC</var>. [<a href=\"#elem.1.c.n.2\">C.N. 2</a>]",
        "And the whole triangle <var>ABC</var> is also equal to the whole <var>ADC</var>; therefore the complement <var>BK</var> which remains is equal to the complement <var>KD</var> which remains. [<a href=\"#elem.1.c.n.3\">C.N. 3</a>]",
        "Therefore etc."
      ],
      "qed": "Q. E. D."
    },
    {
      "id": "elem.1.44",
      "claim": "To a given straight line to apply, in a given rectilineal angle, a parallelogram equal to a given triangle.",
      "proof": [
        "Let <var>AB</var> be the given straight line, <var>C</var> the given triangle and <var>D</var> the given rectilineal angle; thus it is required to apply to the given straight line <var>AB</var>, in an angle equal to the angle <var>D</var>, a parallelogram equal to the given triangle <var>C</var>.",
        "Let the parallelogram <var>BEFG</var> be constructed equal to the triangle <var>C</var>, in the angle <var>EBG</var> which is equal to <var>D</var> [<a href=\"#elem.1.42\">I. 42</a>]; let it be placed so that <var>BE</var> is in a straight line with <var>AB</var>; let<var>FG</var> be drawn through to <var>H</var>, and let <var>AH</var> be drawn through <var>A</var> parallel to either <var>BG</var> or <var>EF</var>. [<a href=\"#elem.1.31\">I. 31</a>]",
        "Let <var>HB</var> be joined. ",
        "Then, since the straight line <var>HF</var> falls upon the parallels <var>AH</var>, <var>EF</var>, the angles <var>AHF</var>, <var>HFE</var> are equal to two right angles. [<a href=\"#elem.1.29\">I. 29</a>] Therefore the angles <var>BHG</var>, <var>GFE</var> are less than two right angles; and straight lines produced indefinitely from angles less than two right angles meet; [<a href=\"#elem.1.post.5\">Post. 5</a>] therefore <var>HB</var>, <var>FE</var>, when produced, will meet.",
        "Let them be produced and meet at <var>K</var>; through the point <var>K</var> let <var>KL</var> be drawn parallel to either <var>EA</var> or <var>FH</var>, [<a href=\"#elem.1.31\">I. 31</a>] and let <var>HA</var>, <var>GB</var> be produced to the points <var>L</var>, <var>M</var>. ",
        "Then <var>HLKF</var> is a parallelogram, <var>HK</var> is its diameter, and <var>AG</var>, <var>ME</var> are parallelograms. and <var>LB</var>, <var>BF</var> the so-called complements, about <var>HK</var>; therefore <var>LB</var> is equal to <var>BF</var>. [<a href=\"#elem.1.43\">I. 43</a>]",
        "But <var>BF</var> is equal to the triangle <var>C</var>; therefore <var>LB</var> is also equal to <var>C</var>. [<a href=\"#elem.1.c.n.1\">C.N. 1</a>]",
        "And, since the angle <var>GBE</var> is equal to the angle <var>ABM</var>, [<a href=\"#elem.1.15\">I. 15</a>] while the angle <var>GBE</var> is equal to <var>D</var>, the angle <var>ABM</var> is also equal to the angle <var>D</var>.",
        "Therefore the parallelogram <var>LB</var> equal to the given triangle <var>C</var> has been applied to the given straight line <var>AB</var>, in the angle <var>ABM</var> which is equal to <var>D</var>."
      ],
      "qed": "Q. E. F."
    },
    {
      "id": "elem.1.45",
      "claim": "To construct, in a given rectilineal angle, a parallelogram equal to a given rectilineal figure.",
      "proof": [
        "Let <var>ABCD</var> be the given rectilineal figure and <var>E</var> the given rectilineal angle; thus it is required to construct, in the given angle <var>E</var>, a parallelogram equal to the rectilineal figure <var>ABCD</var>. ",
        "Let <var>DB</var> be joined, and let the parallelogram <var>FH</var> be constructed equal to the triangle <var>ABD</var>, in the angle <var>HKF</var> which is equal to <var>E</var>; [<a href=\"#elem.1.42\">I. 42</a>] let the parallelogram <var>GM</var> equal to the triangle <var>DBC</var> be applied to the straight line <var>GH</var>, in the angle <var>GHM</var> which is equal to <var>E</var>. [<a href=\"#elem.1.44\">I. 44</a>]",
        "Then, since the angle <var>E</var> is equal to each of the angles <var>HKF</var>, <var>GHM</var>, the angle <var>HKF</var> is also equal to the angle <var>GHM</var>. [<a href=\"#elem.1.c.n.1\">C.N. 1</a>]\n        ",
        "Let the angle <var>KHG</var> be added to each; therefore the angles <var>FKH</var>, <var>KHG</var> are equal to the angles <var>KHG</var>, <var>GHM</var>.",
        "But the angles <var>FKH</var>, <var>KHG</var> are equal to two right angles; [<a href=\"#elem.1.29\">I. 29</a>] therefore the angles <var>KHG</var>, <var>GHM</var> are also equal to two right angles.",
        "Thus, with a straight line <var>GH</var>, and at the point <var>H</var> on it, two straight lines <var>KH</var>, <var>HM</var> not lying on the same side make the adjacent angles equal to two right angles; therefore <var>KH</var> is in a straight line with <var>HM</var>. [<a href=\"#elem.1.14\">I. 14</a>]",
        "And, since the straight line <var>HG</var> falls upon the parallels <var>KM</var>, <var>FG</var>, the alternate angles <var>MHG</var>, <var>HGF</var> are equal to one another. [<a href=\"#elem.1.29\">I. 29</a>]",
        "Let the angle <var>HGL</var> be added to each; therefore the angles <var>MHG</var>, <var>HGL</var> are equal to the angles <var>HGF</var>, <var>HGL</var>. [<a href=\"#elem.1.c.n.2\">C.N. 2</a>]",
        "But the angles <var>MHG</var>, <var>HGL</var> are equal to two right angles; [<a href=\"#elem.1.29\">I. 29</a>] therefore the angles <var>HGF</var>, <var>HGL</var> are also equal to two right angles. [<a href=\"#elem.1.c.n.1\">C.N. 1</a>] Therefore <var>FG</var> is in a straight line with <var>GL</var>. [<a href=\"#elem.1.14\">I. 14</a>]",
        "And, since <var>FK</var> is equal and parallel to <var>HG</var>, [<a href=\"#elem.1.34\">I. 34</a>] and <var>HG</var> to <var>ML</var> also,\n        <var>KF</var> is also equal and parallel to <var>ML</var>; [<a href=\"#elem.1.c.n.1\">C.N. 1</a>;<ref target=\"elem.1.30\" targOrder=\"U\"> I. 30</a>] and the straight lines <var>KM</var>, <var>FL</var> join them (at their extremities); therefore <var>KM</var>, <var>FL</var> are also equal and parallel. [<a href=\"#elem.1.33\">I. 33</a>] Therefore <var>KFLM</var> is a parallelogram.",
        "And, since the triangle <var>ABD</var> is equal to the parallelogram <var>FH</var>, and <var>DBC</var> to <var>GM</var>,\n        the whole rectilineal figure <var>ABCD</var> is equal to the whole parallelogram <var>KFLM</var>.",
        "Therefore the parallelogram <var>KFLM</var> has been constructed equal to the given rectilineal figure <var>ABCD</var>, in the angle <var>FKM</var> which is equal to the given angle <var>E</var>."
      ],
      "qed": "Q. E. F."
    },
    {
      "id": "elem.1.46",
      "claim": "On a given straight line to describe a square.",
      "proof": [
        "Let <var>AB</var> be the given straight line; thus it is required to describe a square on the straight line <var>AB</var>. \n        ",
        "Let <var>AC</var> be drawn at right angles to the straight line <var>AB</var> from the point <var>A</var> on it [<a href=\"#elem.1.11\">I. 11</a>], and let <var>AD</var> be made equal to <var>AB</var>; through the point <var>D</var> let <var>DE</var> be drawn parallel to <var>AB</var>, and through the point <var>B</var> let <var>BE</var> be drawn parallel to <var>AD</var>. [<a href=\"#elem.1.31\">I. 31</a>] ",
        "Therefore <var>ADEB</var> is a parallelogram; therefore <var>AB</var> is equal to <var>DE</var>, and <var>AD</var> to <var>BE</var>. [<a href=\"#elem.1.34\">I. 34</a>]",
        "But <var>AB</var> is equal to <var>AD</var>; therefore the four straight lines <var>BA</var>, <var>AD</var>, <var>DE</var>, <var>EB</var> are equal to one another; therefore the parallelogram <var>ADEB</var> is equilateral.",
        "I say next that it is also right-angled.",
        "For, since the straight line <var>AD</var> falls upon the parallels <var>AB</var>, <var>DE</var>, the angles <var>BAD</var>, <var>ADE</var> are equal to two right angles. [<a href=\"#elem.1.29\">I. 29</a>]",
        "But the angle <var>BAD</var> is right; therefore the angle <var>ADE</var> is also right.",
        "And in parallelogrammic areas the opposite sides and angles are equal to one another; [<a href=\"#elem.1.34\">I. 34</a>] therefore each of the opposite angles <var>ABE</var>, <var>BED</var> is also right. Therefore <var>ADEB</var> is right-angled.",
        "And it was also proved equilateral. ",
        "Therefore it is a square; and it is described on the straight line <var>AB</var>."
      ],
      "qed": "Q. E. F."
    },
    {
      "id": "elem.1.47",
      "claim": "In right-angled triangles the square on the side subtending the right angle is equal to the squares on the sides containing the right angle.",
      "proof": [
        "Let <var>ABC</var> be a right-angled triangle having the angle <var>BAC</var> right;",
        "I say that the square on <var>BC</var> is equal to the squares on <var>BA</var>, <var>AC</var>.",
        "For let there be described on <var>BC</var> the square <var>BDEC</var>, and on <var>BA</var>, <var>AC</var> the squares <var>GB</var>, <var>HC</var>; [<a href=\"#elem.1.46\">I. 46</a>] through <var>A</var> let <var>AL</var> be drawn parallel to either <var>BD</var> or <var>CE</var>, and let <var>AD</var>, <var>FC</var> be joined. \n        ",
        "Then, since each of the angles <var>BAC</var>, <var>BAG</var> is right, it follows that with a straight line <var>BA</var>, and at the point <var>A</var> on it, the two straight lines <var>AC</var>, <var>AG</var> not lying on the same side make the adjacent angles equal to two right angles; therefore <var>CA</var> is in a straight line with <var>AG</var>. [<a href=\"#elem.1.14\">I. 14</a>]\n        ",
        "For the same reason <var>BA</var> is also in a straight line with <var>AH</var>.",
        "And, since the angle <var>DBC</var> is equal to the angle <var>FBA</var>: for each is right: let the angle <var>ABC</var> be added to each; therefore the whole angle <var>DBA</var> is equal to the whole angle <var>FBC</var>. [<a href=\"#elem.1.c.n.2\">C.N. 2</a>]\n        ",
        "And, since <var>DB</var> is equal to <var>BC</var>, and <var>FB</var> to <var>BA</var>, the two sides <var>AB</var>, <var>BD</var> are equal to the two sides <var>FB</var>, <var>BC</var> respectively, and the angle <var>ABD</var> is equal to the angle <var>FBC</var>; therefore the base <var>AD</var> is equal to the base <var>FC</var>, and the triangle <var>ABD</var> is equal to the triangle <var>FBC</var>. [<a href=\"#elem.1.4\">I. 4</a>]",
        "Now the parallelogram <var>BL</var> is double of the triangle <var>ABD</var>, for they have the same base <var>BD</var> and are in the same parallels <var>BD</var>, <var>AL</var>. [<a href=\"#elem.1.41\">I. 41</a>]",
        "And the square <var>GB</var> is double of the triangle <var>FBC</var>, for they again have the same base <var>FB</var> and are in the same parallels <var>FB</var>, <var>GC</var>. [<a href=\"#elem.1.41\">I. 41</a>]",
        "[But the doubles of equals are equal to one another.] Therefore the parallelogram <var>BL</var> is also equal to the square <var>GB</var>.",
        "Similarly, if <var>AE</var>, <var>BK</var> be joined, the parallelogram <var>CL</var> can also be proved equal to the square <var>HC</var>; therefore the whole square <var>BDEC</var> is equal to the two squares <var>GB</var>, <var>HC</var>. [<a href=\"#elem.1.c.n.2\">C.N. 2</a>]",
        "And the square <var>BDEC</var> is described on <var>BC</var>, and the squares <var>GB</var>, <var>HC</var> on <var>BA</var>, <var>AC</var>.",
        "Therefore the square on the side <var>BC</var> is equal to the squares on the sides <var>BA</var>, <var>AC</var>.",
        "Therefore etc."
      ],
      "qed": "Q. E. D."
    },
    {
      "id": "elem.1.48",
      "claim": "If in a triangle the square on one of the sides be equal to the squares on the remaining two sides of the triangle, the angle contained by the remaining two sides of the triangle is right.",
      "proof": [
        "For in the triangle <var>ABC</var> let the square on one side <var>BC</var> be equal to the squares on the sides <var>BA</var>, <var>AC</var>;",
        "I say that the angle <var>BAC</var> is right.",
        "For let <var>AD</var> be drawn from the point <var>A</var> at right angles to the straight line <var>AC</var>, let <var>AD</var> be made equal to <var>BA</var>, and let <var>DC</var> be joined.",
        "Since <var>DA</var> is equal to <var>AB</var>, the square on <var>DA</var> is also equal to the square on <var>AB</var>. ",
        "Let the square on <var>AC</var> be added to each; therefore the squares on <var>DA</var>, <var>AC</var> are equal to the squares on <var>BA</var>, <var>AC</var>.",
        "But the square on <var>DC</var> is equal to the squares on <var>DA</var>, <var>AC</var>, for the angle <var>DAC</var> is right; [<a href=\"#elem.1.47\">I. 47</a>] and the square on <var>BC</var> is equal to the squares on <var>BA</var>, <var>AC</var>, for this is the hypothesis; therefore the square on <var>DC</var> is equal to the square on <var>BC</var>, so that the side <var>DC</var> is also equal to <var>BC</var>.",
        "And, since <var>DA</var> is equal to <var>AB</var>, and <var>AC</var> is common, the two sides <var>DA</var>, <var>AC</var> are equal to the two sides <var>BA</var>, <var>AC</var>; and the base <var>DC</var> is equal to the base <var>BC</var>; therefore the angle <var>DAC</var> is equal to the angle <var>BAC</var>. [<a href=\"#elem.1.8\">I. 8</a>] But the angle <var>DAC</var> is right; therefore the angle <var>BAC</var> is also right.",
        "Therefore etc."
      ],
      "qed": "Q. E. D."
    }
  ]
}
