{
  "num": 3,
  "definitions": [
    {
      "id": "elem.3.def.1",
      "text": "<hi rend=\"bold\">Equal circles are those the diameters of which are equal, or the radii of which are equal."
    },
    {
      "id": "elem.3.def.2",
      "text": "A straight line is said to <hi rend=\"bold\">touch a circle which, meeting the circle and being produced, does not cut the circle."
    },
    {
      "id": "elem.3.def.3",
      "text": "<hi rend=\"bold\">Circles are said to <hi rend=\"bold\">touch one another which, meeting one another, do not cut one another."
    },
    {
      "id": "elem.3.def.4",
      "text": "In a circle straight lines are said <hi rend=\"bold\">to be equally distant from the centre when the perpendiculars drawn to them from the centre are equal."
    },
    {
      "id": "elem.3.def.5",
      "text": "And that straight line is said to be <hi rend=\"bold\">at a greater distance on which the greater perpendicular falls."
    },
    {
      "id": "elem.3.def.6",
      "text": "A <hi rend=\"bold\">segment of a circle is the figure contained by a straight line and a circumference of a circle."
    },
    {
      "id": "elem.3.def.7",
      "text": "An <hi rend=\"bold\">angle of a segment is that contained by a straight line and a circumference of a circle."
    },
    {
      "id": "elem.3.def.8",
      "text": "An <hi rend=\"bold\">angle in a segment is the angle which, when a point is taken on the circumference of the segment and straight lines are joined from it to the extremities of the straight line which is the <hi rend=\"bold\">base of the segment, is contained by the straight lines so joined."
    },
    {
      "id": "elem.3.def.9",
      "text": "And, when the straight lines containing the angle cut off a circumference, the angle is said to <hi rend=\"bold\">stand upon that circumference."
    },
    {
      "id": "elem.3.def.10",
      "text": "A sector of a circle is the figure which, when an angle is constructed at the centre of the circle, is contained by the straight lines containing the angle and the circumference cut off by them."
    },
    {
      "id": "elem.3.def.11",
      "text": "<hi rend=\"bold\">Similar segments of circles are those which admit equal angles, or in which the angles are equal to one another."
    }
  ],
  "postulates": null,
  "common_notions": null,
  "propositions": [
    {
      "id": "elem.3.1",
      "text": "\n      <head>PROPOSITION 1.</head>\n      <p><emph>To find the centre of a given circle</emph>. </p>\n      <p>Let <emph>ABC</emph> be the given circle; thus it is required to find the centre of the circle <emph>ABC</emph>. </p>\n      <p>Let a straight line <emph>AB</emph> be drawn <lb n=\"5\" />through it at random, and let it be bisected at the point <emph>D</emph>; from <emph>D</emph> let <emph>DC</emph> be drawn at right angles to <emph>AB</emph> and let it be drawn through to <emph>E</emph>; let <emph>CE</emph> be bisected at <emph>F</emph>; <lb n=\"10\" />I say that <emph>F</emph> is the centre of the circle <emph>ABC</emph>. <figure />\n      </p>\n      <p>For suppose it is not, but, if possible, let <emph>G</emph> be the centre, and let <emph>GA</emph>, <emph>GD</emph>, <emph>GB</emph> be joined. <lb n=\"15\" /></p>\n      <p>Then, since <emph>AD</emph> is equal to <emph>DB</emph>, and <emph>DG</emph> is common, <hi rend=\"center\">the two sides <emph>AD</emph>, <emph>DG</emph> are equal to the two sides <emph>BD</emph>, <emph>DG</emph> respectively;</hi> and the base <emph>GA</emph> is equal to the base <emph>GB</emph>, for they are <lb n=\"20\" />radii; <hi rend=\"center\">therefore the angle <emph>ADG</emph> is equal to the angle <emph>GDB</emph>. [<ref target=\"elem.1.8\" targOrder=\"U\">I. 8</ref>]</hi>\n      </p>\n      <p>But, when a straight line set up on a straight line makes the adjacent angles equal to one another, each of the equal angles is right; [<ref target=\"elem.1.def.10\" targOrder=\"U\">I. Def. 10</ref>] <lb n=\"25\" /><hi rend=\"center\">therefore the angle <emph>GDB</emph> is right.</hi>\n       <pb n=\"7\" /></p>\n      <p>But the angle <emph>FDB</emph> is also right; therefore the angle <emph>FDB</emph> is equal to the angle <emph>GDB</emph>, the greater to the less: which is impossible. <hi rend=\"center\">Therefore <emph>G</emph> is not the centre of the circle <emph>ABC</emph>.</hi>\n       <lb n=\"30\" /></p>\n      <p>Similarly we can prove that neither is any other point except <emph>F</emph>. <hi rend=\"center\">Therefore the point <emph>F</emph> is the centre of the circle <emph>ABC</emph>.</hi>\n      </p>\n      <div4 id=\"elem.3.1.p.1\" type=\"porism\" org=\"uniform\" sample=\"complete\">\n       <head>PORISM.</head>\n       <p>From this it is manifest that, if in a circle a straight line cut a straight line into two equal parts and at <lb n=\"35\" />right angles, the centre of the circle is on the cutting straight line. Q. E. F.</p>\n      </div4>\n      <note n=\"12\" type=\"crit\" place=\"unspecified\" anchored=\"yes\">\n       <p>12. For suppose it is not. This is expressed in the Greek by the two words <foreign lang=\"greek\">Μὴ γάρ</foreign>, but such an elliptical phrase is impossible in English.</p>\n      </note>\n      <note n=\"17\" type=\"crit\" place=\"unspecified\" anchored=\"yes\">\n       <p><hi rend=\"bold\">the two sides AD, DG are equal to the two sides BD, DG respectively.</hi> As before observed, Euclid is not always careful to put the equals in corresponding order. The text here has <quote><emph>GD</emph>, <emph>DB</emph>.</quote>\n</p>\n      </note>\n     "
    },
    {
      "id": "elem.3.2",
      "text": "\n      <head>PROPOSITION 2.</head>\n      <p><emph>If on the circumference of a circle two points be taken at random</emph>, <emph>the straight line joining the points will fall within the circle</emph>. </p>\n      <p>Let <emph>ABC</emph> be a circle, and let two points <emph>A</emph>, <emph>B</emph> be taken at random on its circumference; I say that the straight line joined from <emph>A</emph> to <emph>B</emph> will fall within the circle. <figure />\n      </p>\n      <p>For suppose it does not, but, if possible, let it fall outside, as <emph>AEB</emph>; let the centre of the circle <emph>ABC</emph> be taken [<ref target=\"elem.3.1\" targOrder=\"U\">III. 1</ref>], and let it be <emph>D</emph>; let <emph>DA</emph>, <emph>DB</emph> be joined, and let <emph>DFE</emph> be drawn through. <pb n=\"9\" /></p>\n      <p>Then, since <emph>DA</emph> is equal to <emph>DB</emph>, <hi rend=\"center\">the angle <emph>DAE</emph> is also equal to the angle <emph>DBE</emph>. [<ref target=\"elem.1.5\" targOrder=\"U\">I. 5</ref>]</hi> And, since one side <emph>AEB</emph> of the triangle <emph>DAE</emph> is produced, <hi rend=\"center\">the angle <emph>DEB</emph> is greater than the angle <emph>DAE</emph>. [<ref target=\"elem.1.16\" targOrder=\"U\">I. 16</ref>]</hi>\n      </p>\n      <p>But the angle <emph>DAE</emph> is equal to the angle <emph>DBE</emph>; <hi rend=\"center\">therefore the angle <emph>DEB</emph> is greater than the angle <emph>DBE</emph>.</hi> And the greater angle is subtended by the greater side; [<ref target=\"elem.1.19\" targOrder=\"U\">I. 19</ref>] <hi rend=\"center\">therefore <emph>DB</emph> is greater than <emph>DE</emph>. But <emph>DB</emph> is equal to <emph>DF</emph>;</hi>\n       <hi rend=\"center\">therefore <emph>DF</emph> is greater than <emph>DE</emph>,</hi>\n       <hi rend=\"center\">the less than the greater : which is impossible.</hi>\n      </p>\n      <p>Therefore the straight line joined from <emph>A</emph> to <emph>B</emph> will not fall outside the circle. </p>\n      <p>Similarly we can prove that neither will it fall on the circumference itself; <hi rend=\"center\">therefore it will fall within.</hi>\n      </p>\n      <p>Therefore etc. Q. E. D.</p>\n     "
    },
    {
      "id": "elem.3.3",
      "text": "\n      <head>PROPOSITION 3.</head>\n      <p><emph>If in a circle a straight line through the centre bisect a straight line not through the centre</emph>, <emph>it also cuts it at right angles; and if it cut it at right angles</emph>, <emph>it also bisects it</emph>. </p>\n      <p>Let <emph>ABC</emph> be a circle, and in it let a straight line <emph>CD</emph>\n       <lb n=\"5\" />through the centre bisect a straight line <emph>AB</emph> not through the centre at the point <emph>F</emph>; <figure /> I say that it also cuts it at right angles. </p>\n      <p>For let the centre of the circle <emph>ABC</emph>\n       <lb n=\"10\" />be taken, and let it be <emph>E</emph>; let <emph>EA</emph>, <emph>EB</emph> be joined. </p>\n      <p>Then, since <emph>AF</emph> is equal to <emph>FB</emph>, and <emph>FE</emph> is common, <hi rend=\"center\">two sides are equal to two sides;</hi>\n       <lb n=\"15\" /><hi rend=\"center\">and the base <emph>EA</emph> is equal to the base <emph>EB</emph>; therefore the angle <emph>AFE</emph> is equal to the angle <emph>BFE</emph>. [<ref target=\"elem.1.8\" targOrder=\"U\">I. 8</ref>]</hi>\n      </p>\n      <p>But, when a straight line set up on a straight line makes the adjacent angles equal to one another, each of the equal angles is right; [<ref target=\"elem.1.def.10\" targOrder=\"U\">I. Def. 10</ref>] <lb n=\"20\" /><hi rend=\"center\">therefore each of the angles <emph>AFE</emph>, <emph>BFE</emph> is right.</hi>\n      </p>\n      <p>Therefore <emph>CD</emph>, which is through the centre, and bisects <emph>AB</emph> which is not through the centre, also cuts it at right angles. </p>\n      <p>Again, let <emph>CD</emph> cut <emph>AB</emph> at right angles; <lb n=\"25\" />I say that it also bisects it. that is, that <emph>AF</emph> is equal to <emph>FB</emph>. <pb n=\"11\" /></p>\n      <p>For, with the same construction, <hi rend=\"center\">since <emph>EA</emph> is equal to <emph>EB</emph>,</hi> the angle <emph>EAF</emph> is also equal to the angle <emph>EBF</emph>. [<ref target=\"elem.1.5\" targOrder=\"U\">I. 5</ref>] </p>\n      <p>But the right angle <emph>AFE</emph> is equal to the right angle <emph>BFE</emph>, <lb n=\"30\" />therefore <emph>EAF</emph>, <emph>EBF</emph> are two triangles having two angles equal to two angles and one side equal to one side, namely <emph>EF</emph>, which is common to them, and subtends one of the equal angles; <hi rend=\"center\">therefore they will also have the remaining sides equal to <lb n=\"35\" />the remaining sides; [<ref target=\"elem.1.26\" targOrder=\"U\">I. 26</ref>] therefore <emph>AF</emph> is equal to <emph>FB</emph>.</hi>\n      </p>\n      <p>Therefore etc. Q. E. D.\n<note n=\"26\" type=\"crit\" place=\"unspecified\" anchored=\"yes\">\n        <p>with the same construction, <foreign lang=\"greek\">τῶν αὐτῶν κατασκευασθέντων</foreign>.</p>\n       </note></p>\n     "
    },
    {
      "id": "elem.3.4",
      "text": "\n      <head>PROPOSITION 4.</head>\n      <p><emph>If in a circle two straight lines cut one another which are not through the centre</emph>, <emph>they do not bisect one another</emph>. </p>\n      <p>Let <emph>ABCD</emph> be a circle, and in it let the two straight lines <emph>AC</emph>, <emph>BD</emph>, which are not through the centre, cut one another at <emph>E</emph>; <figure /> I say that they do not bisect one another. </p>\n      <p>For, if possible, let them bisect one another, so that <emph>AE</emph> is equal to <emph>EC</emph>, and <emph>BE</emph> to <emph>ED</emph>; let the centre of the circle <emph>ABCD</emph> be taken [<ref target=\"elem.3.1\" targOrder=\"U\">III. 1</ref>], and let it be <emph>F</emph>; let <emph>FE</emph> be joined. </p>\n      <p>Then, since a straight line <emph>FE</emph> through the centre bisects a straight line <emph>AC</emph> not through the centre, <hi rend=\"center\">it also cuts it at right angles; [<ref target=\"elem.3.3\" targOrder=\"U\">III. 3</ref>] therefore the angle <emph>FEA</emph> is right.</hi>\n      </p>\n      <p>Again, since a straight line <emph>FE</emph> bisects a straight line <emph>BD</emph>, <hi rend=\"center\">it also cuts it at right angles; [<ref target=\"elem.3.3\" targOrder=\"U\">III. 3</ref>] therefore the angle <emph>FEB</emph> is right.</hi>\n       <pb n=\"12\" /></p>\n      <p>But the angle <emph>FEA</emph> was also proved right; <hi rend=\"center\">therefore the angle <emph>FEA</emph> is equal to the angle <emph>FEB</emph>, the less to the greater: which is impossible.</hi>\n      </p>\n      <p>Therefore <emph>AC</emph>, <emph>BD</emph> do not bisect one another. </p>\n      <p>Therefore etc. Q. E. D.</p>\n     "
    },
    {
      "id": "elem.3.5",
      "text": "\n      <head>PROPOSITION 5.</head>\n      <p><emph>If two circles cut one another</emph>, <emph>they will not have the same centre</emph>. </p>\n      <p>For let the circles <emph>ABC</emph>, <emph>CDG</emph> cut one another at the points <emph>B</emph>, <emph>C</emph>; I say that they will not have the same centre. <figure />\n      </p>\n      <p>For, if possible, let it be <emph>E</emph>; let <emph>EC</emph> be joined, and let <emph>EFG</emph> be drawn through at random. </p>\n      <p>Then, since the point <emph>E</emph> is the centre of the circle <emph>ABC</emph>, <hi rend=\"center\"><emph>EC</emph> is equal to <emph>EF</emph>. [<ref target=\"elem.1.def.15\" targOrder=\"U\">I. Def. 15</ref>]</hi>\n      </p>\n      <p>Again, since the point <emph>E</emph> is the centre of the circle <emph>CDG</emph>, <hi rend=\"center\"><emph>EC</emph> is equal to <emph>EG</emph>.</hi>\n      </p>\n      <p>But <emph>EC</emph> was proved equal to <emph>EF</emph> also; <hi rend=\"center\">therefore <emph>EF</emph> is also equal to <emph>EG</emph>, the less to the greater : which is impossible.</hi>\n      </p>\n      <p>Therefore the point <emph>E</emph> is not the centre of the circles <emph>ABC</emph>, <emph>CDG</emph>. </p>\n      <p>Therefore etc. Q. E. D.</p>\n     "
    },
    {
      "id": "elem.3.6",
      "text": "\n      <pb n=\"13\" />\n      <head>PROPOSITION 6.</head>\n      <p><emph>If two circles touch one another</emph>, <emph>they will not have the same centre</emph>. </p>\n      <p>For let the two circles <emph>ABC</emph>, <emph>CDE</emph> touch one another at the point <emph>C</emph>; I say that they will not have the same centre. <figure />\n      </p>\n      <p>For, if possible, let it be <emph>F</emph>; let <emph>FC</emph> be joined, and let <emph>FEB</emph> be drawn through at random. </p>\n      <p>Then, since the point <emph>F</emph> is the centre of the circle <emph>ABC</emph>, <hi rend=\"center\"><emph>FC</emph> is equal to <emph>FB</emph>.</hi>\n      </p>\n      <p>Again, since the point <emph>F</emph> is the centre of the circle <emph>CDE</emph>, <hi rend=\"center\"><emph>FC</emph> is equal to <emph>FE</emph>.</hi>\n      </p>\n      <p>But <emph>FC</emph> was proved equal to <emph>FB</emph>; <hi rend=\"center\">therefore <emph>FE</emph> is also equal to <emph>FB</emph>, the less to the greater: which is impossible.</hi>\n      </p>\n      <p>Therefore <emph>F</emph> is not the centre of the circles <emph>ABC</emph>, <emph>CDE</emph>. </p>\n      <p>Therefore etc. Q. E. D.</p>\n     "
    },
    {
      "id": "elem.3.7",
      "text": "\n      <pb n=\"14\" />\n      <head>PROPOSITION 7.</head>\n      <p><emph>If on the diameter of a circle a point be taken which is not the centre of the circle</emph>, <emph>and from the point straight lines fall upon the circle</emph>, <emph>that will be greatest on which the centre is</emph>, <emph>the remainder of the same diameter will be least</emph>, <emph>and of the rest</emph>\n       <lb n=\"5\" /><emph>the nearer to the straight line through the centre is always greater than the more remote</emph>, <emph>and only two equal straight lines will fall from the point on the circle</emph>, <emph>one on each side of the least straight line</emph>. </p>\n      <p>Let <emph>ABCD</emph> be a circle, and let <emph>AD</emph> be a diameter of it; <lb n=\"10\" />on <emph>AD</emph> let a point <emph>F</emph> be taken which is not the centre of the circle, let <emph>E</emph> be the centre of the circle, and from <emph>F</emph> let straight lines <emph>FB</emph>, <emph>FC</emph>, <emph>FG</emph> fall upon the circle <emph>ABCD</emph>; I say that <emph>FA</emph> is greatest, <emph>FD</emph> is least, and of the rest <emph>FB</emph> is <lb n=\"15\" />greater than <emph>FC</emph>, and <emph>FC</emph> than <emph>FG</emph>. </p>\n      <p>For let <emph>BE</emph>, <emph>CE</emph>, <emph>GE</emph> be joined. <figure />\n      </p>\n      <p>Then, since in any triangle two sides are greater than the remaining one, [<ref target=\"elem.1.20\" targOrder=\"U\">I. 20</ref>] <lb n=\"20\" /><hi rend=\"center\"><emph>EB</emph>, <emph>EF</emph> are greater than <emph>BF</emph>.</hi>\n      </p>\n      <p>But <emph>AE</emph> is equal to <emph>BE</emph>; <hi rend=\"center\">therefore <emph>AF</emph> is greater than <emph>BF</emph>.</hi>\n      </p>\n      <p>Again, since <emph>BE</emph> is equal to <emph>CE</emph>, and <emph>FE</emph> is common, <lb n=\"25\" />the two sides <emph>BE</emph>, <emph>EF</emph> are equal to the two sides <emph>CE</emph>, <emph>EF</emph>. </p>\n      <p>But the angle <emph>BEF</emph> is also greater than the angle <emph>CEF</emph>; therefore the base <emph>BF</emph> is greater than the base <emph>CF</emph>. [<ref target=\"elem.1.24\" targOrder=\"U\">I. 24</ref>] </p>\n      <p>For the same reason <hi rend=\"center\"><emph>CF</emph> is also greater than <emph>FG</emph>.</hi>\n       <lb n=\"30\" /></p>\n      <p>Again, since <emph>GF</emph>, <emph>FE</emph> are greater than <emph>EG</emph>, and <emph>EG</emph> is equal to <emph>ED</emph>, <hi rend=\"center\"><emph>GF</emph>, <emph>FE</emph> are greater than <emph>ED</emph>.</hi>\n      </p>\n      <p>Let <emph>EF</emph> be subtracted from each; <hi rend=\"center\">therefore the remainder <emph>GF</emph> is greater than the remainder <lb n=\"35\" /><emph>FD</emph>.</hi>\n      </p>\n      <p>Therefore <emph>FA</emph> is greatest, <emph>FD</emph> is least, and <emph>FB</emph> is greater than <emph>FC</emph>, and <emph>FC</emph> than <emph>FG</emph>. <pb n=\"15\" /></p>\n      <p>I say also that from the point <emph>F</emph> only two equal straight lines will fall on the circle <emph>ABCD</emph>, one on each side of the <lb n=\"40\" />least <emph>FD</emph>. </p>\n      <p>For on the straight line <emph>EF</emph>, and at the point <emph>E</emph> on it, let the angle <emph>FEH</emph> be constructed equal to the angle <emph>GEF</emph> [<ref target=\"elem.1.23\" targOrder=\"U\">I. 23</ref>], and let <emph>FH</emph> be joined. </p>\n      <p>Then, since <emph>GE</emph> is equal to <emph>EH</emph>, <lb n=\"45\" />and <emph>EF</emph> is common, <hi rend=\"center\">the two sides <emph>GE</emph>, <emph>EF</emph> are equal to the two sides <emph>HE</emph>, <emph>EF</emph>; and the angle <emph>GEF</emph> is equal to the angle <emph>HEF</emph>;</hi>\n       <hi rend=\"center\">therefore the base <emph>FG</emph> is equal to the base <emph>FH</emph>. [<ref target=\"elem.1.4\" targOrder=\"U\">I. 4</ref>]</hi>\n      </p>\n      <p>I say again that another straight line equal to <emph>FG</emph> will not <lb n=\"50\" />fall on the circle from the point <emph>F</emph>. </p>\n      <p>For, if possible, let <emph>FK</emph> so fall. </p>\n      <p>Then, since <emph>FK</emph> is equal to <emph>FG</emph>, and <emph>FH</emph> to <emph>FG</emph>, <hi rend=\"center\"><emph>FK</emph> is also equal to <emph>FH</emph>, the nearer to the straight line through the centre being <lb n=\"55\" />thus equal to the more remote: which is impossible.</hi>\n      </p>\n      <p>Therefore another straight line equal to <emph>GF</emph> will not fall from the point <emph>F</emph> upon the circle; <hi rend=\"center\">therefore only one straight line will so fall.</hi>\n      </p>\n      <p>Therefore etc. Q. E. D.\n<note n=\"4\" type=\"crit\" place=\"unspecified\" anchored=\"yes\">\n        <p><hi rend=\"bold\">of the same diameter</hi>. I have inserted these words for clearness' sake. The text has simply <foreign lang=\"greek\">ἐλαχίστη δὲ ἡ λοιπή</foreign>, <quote>and the remaining (straight line) least.</quote>\n</p>\n       </note>\n       <note n=\"7, 39\" type=\"crit\" place=\"unspecified\" anchored=\"yes\">\n        <p><hi rend=\"bold\">one on each side</hi>. The word <quote>one</quote>\n is not in the Greek, but is necessary to give the force of <foreign lang=\"greek\">ἐφ̓ ἑκάτερα τῆς ἐλαχίστης</foreign>, literally <quote>on both sides,</quote>\n or <quote>on each of the two sides, of the least.</quote>\n</p>\n       </note></p>\n     "
    },
    {
      "id": "elem.3.8",
      "text": "\n      <head>PROPOSITION 8.</head>\n      <p><emph>If a point be taken outside a circle and from the point straight lines be drawn through to the circle</emph>, <emph>one of which is through the centre and the others are drawn at random</emph>, <emph>then</emph>, <emph>of the straight lines which fall on the concave circumference</emph>, <emph>that through the centre is greatest</emph>, <emph>while of the rest</emph>\n       <pb n=\"18\" /><emph>the nearer to that through the centre is always greater than the more remote</emph>, <emph>but</emph>, <emph>of the straight lines falling on the convex circumference</emph>, <emph>that between the point and the diameter is least</emph>, <emph>while of the rest the nearer to the least is always less than the more remote</emph>, <emph>and only two equal straight lines will fall on the circle from the point</emph>, <emph>one on each side of the least</emph>. </p>\n      <p>Let <emph>ABC</emph> be a circle, and let a point <emph>D</emph> be taken outside <emph>ABC</emph>; let there be drawn through from it straight lines <emph>DA</emph>, <emph>DE</emph>, <emph>DF</emph>, <emph>DC</emph>, and let <emph>DA</emph> be through the centre; I say that, of the straight lines falling on the concave circumference <emph>AEFC</emph>, the straight line <emph>DA</emph> through the centre is greatest, <figure /> while <emph>DE</emph> is greater than <emph>DF</emph> and <emph>DF</emph> than <emph>DC</emph>.; but, of the straight lines falling on the convex circumference <emph>HLKG</emph>, the straight line <emph>DG</emph> between the point and the diameter <emph>AG</emph> is least; and the nearer to the least <emph>DG</emph> is always less than the more remote, namely <emph>DK</emph> than <emph>DL</emph>, and <emph>DL</emph> than <emph>DH</emph>. </p>\n      <p>For let the centre of the circle <emph>ABC</emph> be taken [<ref target=\"elem.3.1\" targOrder=\"U\">III. 1</ref>], and let it be <emph>M</emph>; let <emph>ME</emph>, <emph>MF</emph>, <emph>MC</emph>, <emph>MK</emph>, <emph>ML</emph>, <emph>MH</emph> be joined. </p>\n      <p>Then, since <emph>AM</emph> is equal to <emph>EM</emph>, let <emph>MD</emph> be added to each; <hi rend=\"center\">therefore <emph>AD</emph> is equal to <emph>EM</emph>, <emph>MD</emph>.</hi>\n      </p>\n      <p>But <emph>EM</emph>, <emph>MD</emph> are greater than <emph>ED</emph>; [<ref target=\"elem.1.20\" targOrder=\"U\">I. 20</ref>] <hi rend=\"center\">therefore <emph>AD</emph> is also greater than <emph>ED</emph>.</hi>\n      </p>\n      <p>Again, since <emph>ME</emph> is equal to <emph>MF</emph>, <hi rend=\"center\">and <emph>MD</emph> is common,</hi> therefore <emph>EM</emph>, <emph>MD</emph> are equal to <emph>FM</emph>, <emph>MD</emph>; <hi rend=\"center\">and the angle <emph>EMD</emph> is greater than the angle <emph>FMD</emph>;</hi>\n       <hi rend=\"center\">therefore the base <emph>ED</emph> is greater than the base <emph>FD</emph>. [<ref target=\"elem.1.24\" targOrder=\"U\">I. 24</ref>]</hi>\n      </p>\n      <p>Similarly we can prove that <emph>FD</emph> is greater than <emph>CD</emph>; therefore <emph>DA</emph> is greatest, while <emph>DE</emph> is greater than <emph>DF</emph>, and <emph>DF</emph> than <emph>DC</emph>. <pb n=\"19\" /></p>\n      <p>Next, since <emph>MK</emph>, <emph>KD</emph> are greater than <emph>MD</emph>, [<ref target=\"elem.1.20\" targOrder=\"U\">I. 20</ref>] and <emph>MG</emph> is equal to <emph>MK</emph>, therefore the remainder <emph>KD</emph> is greater than the remainder <emph>GD</emph>, <hi rend=\"center\">so that <emph>GD</emph> is less than <emph>KD</emph>.</hi>\n      </p>\n      <p>And, since on <emph>MD</emph>, one of the sides of the triangle <emph>MLD</emph>, two straight lines <emph>MK</emph>, <emph>KD</emph> were constructed meeting within the triangle, therefore <emph>MK</emph>, <emph>KD</emph> are less than <emph>ML</emph>, <emph>LD</emph>; [<ref target=\"elem.1.21\" targOrder=\"U\">I. 21</ref>] and <emph>MK</emph> is equal to <emph>ML</emph>; <hi rend=\"center\">therefore the remainder <emph>DK</emph> is less than the remainder <emph>DL</emph>.</hi>\n      </p>\n      <p>Similarly we can prove that <emph>DL</emph> is also less than <emph>DH</emph>; <hi rend=\"center\">therefore <emph>DG</emph> is least, while <emph>DK</emph> is less than <emph>DL</emph>, and <emph>DL</emph> than <emph>DH</emph>.</hi>\n      </p>\n      <p>I say also that only two equal straight lines will fall from the point <emph>D</emph> on the circle, one on each side of the least <emph>DG</emph>. </p>\n      <p>On the straight line <emph>MD</emph>, and at the point <emph>M</emph> on it, let the angle <emph>DMB</emph> be constructed equal to the angle <emph>KMD</emph>, and let <emph>DB</emph> be joined. </p>\n      <p>Then, since <emph>MK</emph> is equal to <emph>MB</emph>, and <emph>MD</emph> is common, <hi rend=\"center\">the two sides <emph>KM</emph>, <emph>MD</emph> are equal to the two sides <emph>BM</emph>, <emph>MD</emph> respectively;</hi> and the angle <emph>KMD</emph> is equal to the angle <emph>BMD</emph>; <hi rend=\"center\">therefore the base <emph>DK</emph> is equal to the base <emph>DB</emph>. [<ref target=\"elem.1.4\" targOrder=\"U\">I. 4</ref>]</hi>\n      </p>\n      <p>I say that no other straight line equal to the straight line <emph>DK</emph> will fall on the circle from the point <emph>D</emph>. </p>\n      <p>For, if possible, let a straight line so fall, and let it be <emph>DN</emph>. <hi rend=\"center\">Then, since <emph>DK</emph> is equal to <emph>DN</emph>,</hi>\n      </p>\n      <p>while <emph>DK</emph> is equal to <emph>DB</emph>, <hi rend=\"center\"><emph>DB</emph> is also equal to <emph>DN</emph>,</hi> that is, the nearer to the least <emph>DG</emph> equal to the more remote: which was proved impossible. </p>\n      <p>Therefore no more than two equal straight lines will fall on the circle <emph>ABC</emph> from the point <emph>D</emph>, one on each side of <emph>DG</emph> the least. </p>\n      <p>Therefore etc.</p>\n     "
    },
    {
      "id": "elem.3.9",
      "text": "\n      <head>PROPOSITION 9.</head>\n      <p><emph>If a point be taken within a circle</emph>, <emph>and more than two equal straight lines fall from the point on the circle</emph>, <emph>the point taken is the centre of the circle</emph>. </p>\n      <p>Let <emph>ABC</emph> be a circle and <emph>D</emph> a point within it, and from <emph>D</emph> let more than two equal straight lines, namely <emph>DA</emph>, <emph>DB</emph>, <emph>DC</emph>, fall on the circle <emph>ABC</emph>; I say that the point <emph>D</emph> is the centre of the circle <emph>ABC</emph>. <figure />\n      </p>\n      <p>For let <emph>AB</emph>, <emph>BC</emph> be joined and bisected at the points <emph>E</emph>, <emph>F</emph>, and let <emph>ED</emph>, <emph>FD</emph> be joined and drawn through to the points <emph>G</emph>, <emph>K</emph>, <emph>H</emph>, <emph>L</emph>. </p>\n      <p>Then, since <emph>AE</emph> is equal to <emph>EB</emph>, and <emph>ED</emph> is common, <hi rend=\"center\">the two sides <emph>AE</emph>, <emph>ED</emph> are equal to the two sides <emph>BE</emph>, <emph>ED</emph>;</hi> and the base <emph>DA</emph> is equal to the base <emph>DB</emph>; <hi rend=\"center\">therefore the angle <emph>AED</emph> is equal to the angle <emph>BED</emph>. [<ref target=\"elem.1.8\" targOrder=\"U\">I. 8</ref>]</hi>\n      </p>\n      <p>Therefore each of the angles <emph>AED</emph>, <emph>BED</emph> is right; [<ref target=\"elem.1.def.10\" targOrder=\"U\">I. Def. 10</ref>] therefore <emph>GK</emph> cuts <emph>AB</emph> into two equal parts and at right angles. </p>\n      <p>And since, if in a circle a straight line cut a straight line into two equal parts and at right angles, the centre of the circle is on the cutting straight line, [<ref target=\"elem.3.1.p.1\" targOrder=\"U\">III. 1, Por.</ref>] <hi rend=\"center\">the centre of the circle is on <emph>GK</emph>.</hi>\n       <pb n=\"22\" /></p>\n      <p>For the same reason <hi rend=\"center\">the centre of the circle <emph>ABC</emph> is also on <emph>HL</emph>.</hi>\n      </p>\n      <p>And the straight lines <emph>GK</emph>, <emph>HL</emph> have no other point common but the point <emph>D</emph>; <hi rend=\"center\">therefore the point <emph>D</emph> is the centre of the circle <emph>ABC</emph>.</hi>\n      </p>\n      <p>Therefore etc. Q. E. D.</p>\n     "
    },
    {
      "id": "elem.3.10",
      "text": "\n      <pb n=\"23\" />\n      <head>PROPOSITION 10.</head>\n      <p><emph>A circle does not cut a circle at more points than two</emph>. </p>\n      <p>For, if possible, let the circle <emph>ABC</emph> cut the circle <emph>DEF</emph> at more points than two, namely <emph>B</emph>, <emph>C</emph>, <emph>F</emph>, <emph>H</emph>; </p>\n      <p>let <emph>BH</emph>, <emph>BG</emph> be joined and bisected at the points <emph>K</emph>, <emph>L</emph>, and from <emph>K</emph>, <emph>L</emph> let <emph>KC</emph>, <emph>LM</emph> be drawn at right angles to <emph>BH</emph>, <emph>BG</emph> and carried through to the points <emph>A</emph>, <emph>E</emph>. <figure />\n      </p>\n      <p>Then, since in the circle <emph>ABC</emph> a straight line <emph>AC</emph> cuts a straight line <emph>BH</emph> into two equal parts and at right angles, <hi rend=\"center\">the centre of the circle <emph>ABC</emph> is on <emph>AC</emph>. [<ref target=\"elem.3.1.p.1\" targOrder=\"U\">III. 1, Por.</ref>]</hi>\n      </p>\n      <p>Again, since in the same circle <emph>ABC</emph> a straight line <emph>NO</emph> cuts a straight line <emph>BG</emph> into two equal parts and at right angles, <hi rend=\"center\">the centre of the circle <emph>ABC</emph> is on <emph>NO</emph>.</hi>\n      </p>\n      <p>But it was also proved to be on <emph>AC</emph>, and the straight lines <emph>AC</emph>, <emph>NO</emph> meet at no point except at <emph>P</emph>; <hi rend=\"center\">therefore the point <emph>P</emph> is the centre of the circle <emph>ABC</emph>.</hi>\n      </p>\n      <p>Similarly we can prove that <emph>P</emph> is also the centre of the circle <emph>DEF</emph>; <hi rend=\"center\">therefore the two circles <emph>ABC</emph>, <emph>DEF</emph> which cut one another have the same centre <emph>P</emph>: which is impossible. [<ref target=\"elem.3.5\" targOrder=\"U\">III. 5</ref>]</hi>\n      </p>\n      <p>Therefore etc. Q. E. D.\n<note n=\"1\" type=\"crit\" place=\"unspecified\" anchored=\"yes\">\n        <p>The word circle (<foreign lang=\"greek\">κύκλος</foreign>) is here employed in the unusual sense of the <emph>circumference</emph> (<foreign lang=\"greek\">περιφέρεια</foreign>) of a circle. Cf. note on <ref target=\"elem.1.def.15\" targOrder=\"U\">I. Def. 15</ref>.</p>\n       </note></p>\n     "
    },
    {
      "id": "elem.3.11",
      "text": "\n      <head>PROPOSITION 11.</head>\n      <p><emph>If two circles touch one another internally</emph>, <emph>and their centres be taken</emph>, <emph>the straight line joining their centres</emph>, <emph>if it be also produced</emph>, <emph>will fall on the point of contact of the circles</emph>. </p>\n      <p>For let the two circles <emph>ABC</emph>, <emph>ADE</emph> touch one another internally at the point <emph>A</emph>, and let the centre <emph>F</emph> of the circle <emph>ABC</emph>, and the centre <emph>G</emph> of <emph>ADE</emph>, be taken; I say that the straight line joined from <emph>G</emph> to <emph>F</emph> and produced will fall on <emph>A</emph>. <figure />\n      </p>\n      <p>For suppose it does not, but, if possible, let it fall as <emph>FGH</emph>, and let <emph>AF</emph>, <emph>AG</emph> be joined. </p>\n      <p>Then, since <emph>AG</emph>, <emph>GF</emph> are greater than <emph>FA</emph>, that is, than <emph>FH</emph>, </p>\n      <p>let <emph>FG</emph> be subtracted from each; therefore the remainder <emph>AG</emph> is greater than the remainder <emph>GH</emph>. <pb n=\"25\" /></p>\n      <p>But <emph>AG</emph> is equal to <emph>GD</emph>; <hi rend=\"center\">therefore <emph>GD</emph> is also greater than <emph>GH</emph>, the less than the greater: which is impossible.</hi>\n      </p>\n      <p>Therefore the straight line joined from <emph>F</emph> to <emph>G</emph> will not fall outside; <hi rend=\"center\">therefore it will fall at <emph>A</emph> on the point of contact.</hi>\n      </p>\n      <p>Therefore etc. Q. E. D.\n<note n=\"2\" type=\"crit\" place=\"unspecified\" anchored=\"yes\">\n        <p><hi rend=\"bold\">the straight line joining their centres</hi>, literally <quote>the straight line joined to their centres</quote>\n (<foreign lang=\"greek\">ἡ ἐπὶ τὰ κέντρα αὐτῶν ἐπιζευγνυμένη εὐθεῖα</foreign>).</p>\n       </note>\n       <note n=\"3\" type=\"crit\" place=\"unspecified\" anchored=\"yes\">\n        <p><hi rend=\"bold\">point of contact</hi> is here <foreign lang=\"greek\">συναφἡ</foreign>, and in the enunciation of the next proposition <foreign lang=\"greek\">ἐπαφἡ</foreign>.</p>\n       </note></p>\n     "
    },
    {
      "id": "elem.3.12",
      "text": "\n      <head>PROPOSITION 12.</head>\n      <p><emph>If two circles touch one another externally</emph>, <emph>the straight line joining their centres will pass through the point of contact</emph>. </p>\n      <p>For let the two circles <emph>ABC</emph>, <emph>ADE</emph> touch one another <lb n=\"5\" />externally at the point <emph>A</emph>, and let the centre <emph>F</emph> of <emph>ABC</emph>, and the centre <emph>G</emph> of <emph>ADE</emph>, be taken; <pb n=\"28\" />I say that the straight line joined from <emph>F</emph> to <emph>G</emph> will pass through the point of contact at <emph>A</emph>. </p>\n      <p>For suppose it does not, <lb n=\"10\" />but, if possible, let it pass as <emph>FCDG</emph>, and let <emph>AF</emph>, <emph>AG</emph> be joined. <figure />\n      </p>\n      <p>Then, since the point <emph>F</emph> is the centre of the circle <emph>ABC</emph>, <lb n=\"15\" /><hi rend=\"center\"><emph>FA</emph> is equal to <emph>FC</emph>.</hi>\n      </p>\n      <p>Again, since the point <emph>G</emph> is the centre of the circle <emph>ADE</emph>, <hi rend=\"center\"><emph>GA</emph> is equal to <emph>GD</emph>.</hi>\n      </p>\n      <p>But <emph>FA</emph> was also proved equal to <emph>FC</emph>; <lb n=\"20\" /><hi rend=\"center\">therefore <emph>FA</emph>, <emph>AG</emph> are equal to <emph>FC</emph>, <emph>GD</emph>, so that the whole <emph>FG</emph> is greater than <emph>FA</emph>, <emph>AG</emph>;</hi> but it is also less [<ref target=\"elem.1.20\" targOrder=\"U\">I. 20</ref>]: which is impossible. </p>\n      <p>Therefore the straight line joined from <emph>F</emph> to <emph>G</emph> will not fail to pass through the point of contact at <emph>A</emph>; <lb n=\"25\" /><hi rend=\"center\">therefore it will pass through it.</hi>\n      </p>\n      <p>Therefore etc. Q. E. D.]\n<note n=\"23\" type=\"crit\" place=\"unspecified\" anchored=\"yes\">\n        <p><hi rend=\"bold\">will not fail to pass</hi>. The Greek has the double negative, <foreign lang=\"greek\">οὐκ ἄρα ἡ...εὐθεῖα... οὐκ ἐλεύσεται</foreign>, literally <quote>the straight line...will not <emph>not</emph>-pass....</quote>\n</p>\n       </note></p>\n     "
    },
    {
      "id": "elem.3.13",
      "text": "\n      <head>PROPOSITION 13.</head>\n      <p><emph>A circle does not touch a circle at more points than one</emph>, <emph>whether it touch it internally or externally</emph>. </p>\n      <p>For, if possible, let the circle <emph>ABDC</emph> touch the circle <emph>EBFD</emph>, first internally, at more <lb n=\"5\" />points than one, namely <emph>D</emph>, <emph>B</emph>. </p>\n      <p>Let the centre <emph>G</emph> of the circle <emph>ABDC</emph>, and the centre <emph>H</emph> of <emph>EBFD</emph>, be taken. </p>\n      <p>Therefore the straight line <figure />\n       <lb n=\"10\" />joined from <emph>G</emph> to <emph>H</emph> will fall on <emph>B</emph>, <emph>D</emph>. [<ref target=\"elem.3.11\" targOrder=\"U\">III. 11</ref>] </p>\n      <p>Let it so fall, as <emph>BGHD</emph>. </p>\n      <p>Then, since the point <emph>G</emph> is the centre of the circle <emph>ABCD</emph>, <lb n=\"15\" /><hi rend=\"center\"><emph>BG</emph> is equal to <emph>GD</emph>;</hi>\n       <pb n=\"33\" /><hi rend=\"center\">therefore <emph>BG</emph> is greater than <emph>HD</emph>; therefore <emph>BH</emph> is much greater than <emph>HD</emph>.</hi>\n      </p>\n      <p>Again, since the point <emph>H</emph> is the centre of the circle <emph>EBFD</emph>, <lb n=\"20\" /><hi rend=\"center\"><emph>BH</emph> is equal to <emph>HD</emph>;</hi>\n       <hi rend=\"center\">but it was also proved much greater than it: which is impossible.</hi>\n      </p>\n      <p>Therefore a circle does not touch a circle internally at more points than one. <lb n=\"25\" /></p>\n      <p>I say further that neither does it so touch it externally. </p>\n      <p>For, if possible, let the circle <emph>ACK</emph> touch the circle <emph>ABDC</emph> at more points than one, namely <emph>A</emph>, <emph>C</emph>, and let <emph>AC</emph> be joined. </p>\n      <p>Then, since on the circumference of each of the circles <lb n=\"30\" /><emph>ABDC</emph>, <emph>ACK</emph> two points <emph>A</emph>, <emph>C</emph> have been taken at random, the straight line joining the points will fall within each circle; [<ref target=\"elem.3.2\" targOrder=\"U\">III. 2</ref>] <hi rend=\"center\">but it fell within the circle <emph>ABCD</emph> and outside <emph>ACK</emph> [<ref target=\"elem.3.def.3\" targOrder=\"U\">III. Def. 3</ref>]: which is absurd.</hi>\n       <lb n=\"35\" /></p>\n      <p>Therefore a circle does not touch a circle externally at more points than one. </p>\n      <p>And it was proved that neither does it so touch it internally. </p>\n      <p>Therefore etc. Q. E. D.\n<note n=\"3, 7, 14, 27, 30, 33\" type=\"crit\" place=\"unspecified\" anchored=\"yes\">\n        <p><hi rend=\"bold\">ABDC</hi>. Euclid writes <emph>ABCD</emph> (here and in the next proposition), notwithstanding the order in which the points are placed in the figure.</p>\n       </note>\n       <note n=\"25, 37\" type=\"crit\" place=\"unspecified\" anchored=\"yes\">\n        <p><hi rend=\"bold\">does it so touch it</hi>. It is necessary to supply these words which the Greek (<foreign lang=\"greek\">ὅτι οὐδὲ ἐκτός</foreign> and <foreign lang=\"greek\">ὅτι οὐδὲ ἐντός</foreign>) leaves to be understood.</p>\n       </note></p>\n     "
    },
    {
      "id": "elem.3.14",
      "text": "\n      <head>PROPOSITION 14.</head>\n      <p><emph>In a circle equal straight lines are equally distant from the centre</emph>, <emph>and those which are equally distant from the centre are equal to one another</emph>. </p>\n      <p>Let <emph>ABDC</emph> be a circle, and let <emph>AB</emph>, <emph>CD</emph> be equal straight lines in it; I say that <emph>AB</emph>, <emph>CD</emph> are equally distant from the centre. </p>\n      <p>For let the centre of the circle <emph>ABDC</emph> be taken [<ref target=\"elem.3.1\" targOrder=\"U\">III. 1</ref>], <pb n=\"35\" />and let it be <emph>E</emph>; from <emph>E</emph> let <emph>EF</emph>, <emph>EG</emph> be drawn perpendicular to <emph>AB</emph>, <emph>CD</emph>, and let <emph>AE</emph>, <emph>EC</emph> be joined. </p>\n      <p>Then, since a straight line <emph>EF</emph> through the centre cuts a straight line <emph>AB</emph> not through the centre at right angles, it also bisects it. [<ref target=\"elem.3.3\" targOrder=\"U\">III. 3</ref>] <figure />\n       <hi rend=\"center\">Therefore <emph>AF</emph> is equal to <emph>FB</emph>; therefore <emph>AB</emph> is double of <emph>AF</emph>.</hi>\n      </p>\n      <p>For the same reason <hi rend=\"center\"><emph>CD</emph> is also double of <emph>CG</emph>;</hi> and <emph>AB</emph> is equal to <emph>CD</emph>; <hi rend=\"center\">therefore <emph>AF</emph> is also equal to <emph>CG</emph>.</hi>\n      </p>\n      <p>And, since <emph>AE</emph> is equal to <emph>EC</emph>, <hi rend=\"center\">the square on <emph>AE</emph> is also equal to the square on <emph>EC</emph>.</hi> But the squares on <emph>AF</emph>, <emph>EF</emph> are equal to the square on <emph>AE</emph>, for the angle at <emph>F</emph> is right; and the squares on <emph>EG</emph>, <emph>GC</emph> are equal to the square on <emph>EC</emph>, for the angle at <emph>G</emph> is right; [<ref target=\"elem.1.47\" targOrder=\"U\">I. 47</ref>] <hi rend=\"center\">therefore the squares on <emph>AF</emph>, <emph>FE</emph> are equal to the squares on <emph>CG</emph>, <emph>GE</emph>,</hi> of which the square on <emph>AF</emph> is equal to the square on <emph>CG</emph>, for <emph>AF</emph> is equal to <emph>CG</emph>; <hi rend=\"center\">therefore the square on <emph>FE</emph> which remains is equal to the square on <emph>EG</emph>, therefore <emph>EF</emph> is equal to <emph>EG</emph>.</hi>\n      </p>\n      <p>But in a circle straight lines are said to be equally distant from the centre when the perpendiculars drawn to them from the centre are equal; [<ref target=\"elem.3.def.4\" targOrder=\"U\">III. Def. 4</ref>] <hi rend=\"center\">therefore <emph>AB</emph>, <emph>CD</emph> are equally distant from the centre.</hi>\n      </p>\n      <p>Next, let the straight lines <emph>AB</emph>, <emph>CD</emph> be equally distant from the centre; that is, let <emph>EF</emph> be equal to <emph>EG</emph>. </p>\n      <p>I say that <emph>AB</emph> is also equal to <emph>CD</emph>. </p>\n      <p>For, with the same construction, we can prove, similarly, that <emph>AB</emph> is double of <emph>AF</emph>, and <emph>CD</emph> of <emph>CG</emph>. </p>\n      <p>And, since <emph>AE</emph> is equal to <emph>CE</emph>, <hi rend=\"center\">the square on <emph>AE</emph> is equal to the square on <emph>CE</emph>.</hi> But the squares on <emph>EF</emph>, <emph>FA</emph> are equal to the square on <emph>AE</emph>, and the squares on <emph>EG</emph>, <emph>GC</emph> equal to the square on <emph>CE</emph>. [<ref target=\"elem.1.47\" targOrder=\"U\">I. 47</ref>] <pb n=\"36\" /></p>\n      <p>Therefore the squares on <emph>EF</emph>, <emph>FA</emph> are equal to the squares on <emph>EG</emph>, <emph>GC</emph>, of which the square on <emph>EF</emph> is equal to the square on <emph>EG</emph>, for <emph>EF</emph> is equal to <emph>EG</emph>; therefore the square on <emph>AF</emph> which remains is equal to the square on <emph>CG</emph>; <hi rend=\"center\">therefore <emph>AF</emph> is equal to <emph>CG</emph>.</hi> And <emph>AB</emph> is double of <emph>AF</emph>, and <emph>CD</emph> double of <emph>CG</emph>; <hi rend=\"center\">therefore <emph>AB</emph> is equal to <emph>CD</emph>.</hi>\n      </p>\n      <p>Therefore etc. Q. E. D.</p>\n     "
    },
    {
      "id": "elem.3.15",
      "text": "\n      <head>PROPOSITION 15.</head>\n      <p><emph>Of straight lines in a circle the diameter is greatest</emph>, <emph>and of the rest the nearer to the centre is always greater than the more remote</emph>. </p>\n      <p>Let <emph>ABCD</emph> be a circle, let <emph>AD</emph> be its diameter and <emph>E</emph> the centre; and let <emph>BC</emph> be nearer to the diameter <emph>AD</emph>, and <emph>FG</emph> more remote; I say that <emph>AD</emph> is greatest and <emph>BC</emph> greater than <emph>FG</emph>. </p>\n      <p>For from the centre <emph>E</emph> let <emph>EH</emph>, <emph>EK</emph>\n       <figure /> be drawn perpendicular to <emph>BC</emph>, <emph>FG</emph>. </p>\n      <p>Then, since <emph>BC</emph> is nearer to the centre and <emph>FG</emph> more remote, <emph>EK</emph> is greater than <emph>EH</emph>. [<ref target=\"elem.3.def.5\" targOrder=\"U\">III. Def. 5</ref>] </p>\n      <p>Let <emph>EL</emph> be made equal to <emph>EH</emph>, through <emph>L</emph> let <emph>LM</emph> be drawn at right angles to <emph>EK</emph> and carried through to <emph>N</emph>, and let <emph>ME</emph>, <emph>EN</emph>, <emph>FE</emph>, <emph>EG</emph> be joined. </p>\n      <p>Then, since <emph>EH</emph> is equal to <emph>EL</emph>, <hi rend=\"center\"><emph>BC</emph> is also equal to <emph>MN</emph>. [<ref target=\"elem.3.14\" targOrder=\"U\">III. 14</ref>]</hi>\n      </p>\n      <p>Again, since <emph>AE</emph> is equal to <emph>EM</emph>, and <emph>ED</emph> to <emph>EN</emph>, <hi rend=\"center\"><emph>AD</emph> is equal to <emph>ME</emph>, <emph>EN</emph>.</hi>\n       <pb n=\"37\" /></p>\n      <p>But <emph>ME</emph>, <emph>EN</emph> are greater than <emph>MN</emph>, [<ref target=\"elem.1.20\" targOrder=\"U\">I. 20</ref>] and <emph>MN</emph> is equal to <emph>BC</emph>; <hi rend=\"center\">therefore <emph>AD</emph> is greater than <emph>BC</emph>.</hi>\n      </p>\n      <p>And, since the two sides <emph>ME</emph>, <emph>EN</emph> are equal to the two sides <emph>FE</emph>, <emph>EG</emph>, and the angle <emph>MEN</emph> greater than the angle <emph>FEG</emph>, therefore the base <emph>MN</emph> is greater than the base <emph>FG</emph>. [<ref target=\"elem.1.24\" targOrder=\"U\">I. 24</ref>] </p>\n      <p>But <emph>MN</emph> was proved equal to <emph>BC</emph>. </p>\n      <p>Therefore the diameter <emph>AD</emph> is greatest and <emph>BC</emph> greater than <emph>FG</emph>. </p>\n      <p>Therefore etc. Q. E. D.\n<note n=\"1\" type=\"crit\" place=\"unspecified\" anchored=\"yes\">\n        <p><hi rend=\"bold\">Of straight lines</hi>. The Greek leaves these words to be understood.</p>\n       </note>\n       <note n=\"5\" type=\"crit\" place=\"unspecified\" anchored=\"yes\">\n        <p><hi rend=\"bold\">Nearer to the diameter AD.</hi> As <emph>BC</emph>, <emph>FG</emph> are not in general parallel to <emph>AD</emph>, Euclid should have said <quote>nearer to the centre.</quote>\n</p>\n       </note></p>\n     "
    },
    {
      "id": "elem.3.16",
      "text": "\n      <head>PROPOSITION 16.</head>\n      <p><emph>The straight line drawn at right angles to the diameter of a circle from its extremity will fall outside the circle</emph>, <emph>and into the space between the straight line and the circumference another straight line cannot be interposed; further the angle of the semicircle is greater</emph>, <emph>and the remaining angle less</emph>, <emph>than any acute rectilineal angle</emph>. </p>\n      <p>Let <emph>ABC</emph> be a circle about <emph>D</emph> as centre and <emph>AB</emph> as diameter; <pb n=\"38\" />I say that the straight line drawn from <emph>A</emph> at right angles to <emph>AB</emph> from its extremity will fall outside the circle. </p>\n      <p>For suppose it does not, but, if possible, let it fall within as <emph>CA</emph>, and let <emph>DC</emph> be joined. </p>\n      <p>Since <emph>DA</emph> is equal to <emph>DC</emph>, <figure />\n       <hi rend=\"center\">the angle <emph>DAC</emph> is also equal to the angle <emph>ACD</emph>. [<ref target=\"elem.1.5\" targOrder=\"U\">I. 5</ref>]</hi>\n      </p>\n      <p>But the angle <emph>DAC</emph> is right; <hi rend=\"center\">therefore the angle <emph>ACD</emph> is also right:</hi> thus, in the triangle <emph>ACD</emph>, the two angles <emph>DAC</emph>, <emph>ACD</emph> are equal to two right angles: which is impossible. [<ref target=\"elem.1.17\" targOrder=\"U\">I. 17</ref>] </p>\n      <p>Therefore the straight line drawn from the point <emph>A</emph> at right angles to <emph>BA</emph> will not fall within the circle. </p>\n      <p>Similarly we can prove that neither will it fall on the circumference; <hi rend=\"center\">therefore it will fall outside.</hi>\n      </p>\n      <p>Let it fall as <emph>AE</emph>; I say next that into the space between the straight line <emph>AE</emph> and the circumference <emph>CHA</emph> another straight line cannot be interposed. </p>\n      <p>For, if possible, let another straight line be so interposed, as <emph>FA</emph>, and let <emph>DG</emph> be drawn from the point <emph>D</emph> perpendicular to <emph>FA</emph>. </p>\n      <p>Then, since the angle <emph>AGD</emph> is right, <hi rend=\"center\">and the angle <emph>DAG</emph> is less than a right angle, <emph>AD</emph> is greater than <emph>DG</emph>. [<ref target=\"elem.1.19\" targOrder=\"U\">I. 19</ref>]</hi>\n      </p>\n      <p>But <emph>DA</emph> is equal to <emph>DH</emph>; <hi rend=\"center\">therefore <emph>DH</emph> is greater than <emph>DG</emph>, the less than the greater: which is impossible.</hi>\n      </p>\n      <p>Therefore another straight line cannot be interposed into the space between the straight line and the circumference. </p>\n      <p>I say further that the angle of the semicircle contained by the straight line <emph>BA</emph> and the circumference <emph>CHA</emph> is greater than any acute rectilineal angle, and the remaining angle contained by the circumference <emph>CHA</emph> and the straight line <emph>AE</emph> is less than any acute rectilineal angle. </p>\n      <p>For, if there is any rectilineal angle greater than the angle contained by the straight line <emph>BA</emph> and the circumference <pb n=\"39\" /><emph>CHA</emph>, and any rectilineal angle less than the angle contained by the circumference <emph>CHA</emph> and the straight line <emph>AE</emph>, then into the space between the circumference and the straight line <emph>AE</emph> a straight line will be interposed such as will make an angle contained by straight lines which is greater than the angle contained by the straight line <emph>BA</emph> and the circumference <emph>CHA</emph>, and another angle contained by straight lines which is less than the angle contained by the circumference <emph>CHA</emph> and the straight line <emph>AE</emph>. </p>\n      <p>But such a straight line cannot be interposed; </p>\n      <p>therefore there will not be any acute angle contained by straight lines which is greater than the angle contained by the straight line <emph>BA</emph> and the circumference <emph>CHA</emph>, nor yet any acute angle contained by straight lines which is less than the angle contained by the circumference <emph>CHA</emph> and the straight line <emph>AE</emph>.— </p>\n      <div4 id=\"elem.3.16.p.1\" type=\"porism\" org=\"uniform\" sample=\"complete\">\n       <head>PORISM.</head>\n       <p>From this it is manifest that the straight line drawn at right angles to the diameter of a circle from its extremity touches the circle. Q. E. D.</p>\n      </div4>\n      <note n=\"4\" type=\"crit\" place=\"unspecified\" anchored=\"yes\">\n       <p><hi rend=\"bold\">cannot be interposed</hi>, literally <quote>will not fall in between</quote>\n (<foreign lang=\"greek\">οὐ παρεμπεσεῖται</foreign>).</p>\n      </note>\n     "
    },
    {
      "id": "elem.3.17",
      "text": "\n      <head>PROPOSITION 17.</head>\n      <p><emph>From a given point to draw a straight line touching a given circle</emph>. </p>\n      <p>Let <emph>A</emph> be the given point, and <emph>BCD</emph> the given circle; thus it is required to draw from the point <emph>A</emph> a straight line touching the circle <emph>BCD</emph>. </p>\n      <p>For let the centre <emph>E</emph> of the circle be taken; [<ref target=\"elem.3.1\" targOrder=\"U\">III. 1</ref>] let <emph>AE</emph> be joined, and with centre <emph>E</emph> and distance <emph>EA</emph> let the circle <emph>AFG</emph> be described; <figure /> from <emph>D</emph> let <emph>DF</emph> be drawn at right angles to <emph>EA</emph>, and let <emph>EF</emph>, <emph>AB</emph> be joined; I say that <emph>AB</emph> has been drawn from the point <emph>A</emph> touching the circle <emph>BCD</emph>. </p>\n      <p>For, since <emph>E</emph> is the centre of the circles <emph>BCD</emph>, <emph>AFG</emph>, <hi rend=\"center\"><emph>EA</emph> is equal to <emph>EF</emph>, and <emph>ED</emph> to <emph>EB</emph>;</hi> therefore the two sides <emph>AE</emph>, <emph>EB</emph> are equal to the two sides <emph>FE</emph>, <emph>ED</emph>: and they contain a common angle, the angle at <emph>E</emph>; <hi rend=\"center\">therefore the base <emph>DF</emph> is equal to the base <emph>AB</emph>, and the triangle <emph>DEF</emph> is equal to the triangle <emph>BEA</emph>, and the remaining angles to the remaining angles; [<ref target=\"elem.1.4\" targOrder=\"U\">I. 4</ref>] therefore the angle <emph>EDF</emph> is equal to the angle <emph>EBA</emph>.</hi>\n      </p>\n      <p>But the angle <emph>EDF</emph> is right; <hi rend=\"center\">therefore the angle <emph>EBA</emph> is also right.</hi>\n      </p>\n      <p>Now <emph>EB</emph> is a radius; and the straight line drawn at right angles to the diameter of a circle, from its extremity, touches the circle; [<ref target=\"elem.3.16.p.1\" targOrder=\"U\">III. 16, Por.</ref>] <hi rend=\"center\">therefore <emph>AB</emph> touches the circle <emph>BCD</emph>.</hi>\n      </p>\n      <p>Therefore from the given point <emph>A</emph> the straight line <emph>AB</emph> has been drawn touching the circle <emph>BCD</emph>.</p>\n     "
    },
    {
      "id": "elem.3.18",
      "text": "\n      <head>PROPOSITION 18.</head>\n      <p><emph>If a straight line touch a circle</emph>, <emph>and a straight line be joined from the centre to the point of contact</emph>, <emph>the straight line so joined will be perpendicular to the tangent</emph>. </p>\n      <p>For let a straight line <emph>DE</emph> touch the circle <emph>ABC</emph> at the point <emph>C</emph>, let the centre <emph>F</emph> of the circle <emph>ABC</emph> be taken, and let <emph>FC</emph> be joined from <emph>F</emph> to <emph>C</emph>; I say that <emph>FC</emph> is perpendicular to <emph>DE</emph>. <figure />\n      </p>\n      <p>For, if not, let <emph>FG</emph> be drawn from <emph>F</emph> perpendicular to <emph>DE</emph>. </p>\n      <p>Then, since the angle <emph>FGC</emph> is right, <hi rend=\"center\">the angle <emph>FCG</emph> is acute; [<ref target=\"elem.1.17\" targOrder=\"U\">I. 17</ref>]</hi> and the greater angle is subtended by the greater side; [<ref target=\"elem.1.19\" targOrder=\"U\">I. 19</ref>] <hi rend=\"center\">therefore <emph>FC</emph> is greater than <emph>FG</emph>.</hi>\n      </p>\n      <p>But <emph>FC</emph> is equal to <emph>FB</emph>; <hi rend=\"center\">therefore <emph>FB</emph> is also greater than <emph>FG</emph>, the less than the greater: which is impossible.</hi>\n      </p>\n      <p>Therefore <emph>FG</emph> is not perpendicular to <emph>DE</emph>. </p>\n      <p>Similarly we can prove that neither is any other straight line except <emph>FC</emph>; <hi rend=\"center\">therefore <emph>FC</emph> is perpendicular to <emph>DE</emph>.</hi>\n      </p>\n      <p>Therefore etc. Q. E. D.<note place=\"unspecified\" anchored=\"yes\">\n        <pb n=\"45\" />\n        <note n=\"3\" type=\"crit\" place=\"unspecified\" anchored=\"yes\">\n         <p><hi rend=\"bold\">the tangent</hi>, <foreign lang=\"greek\">ἡ ἐφαπτομένη</foreign>.</p>\n        </note>\n       </note></p>\n     "
    },
    {
      "id": "elem.3.19",
      "text": "\n      <head>PROPOSITION 19.</head>\n      <p><emph>If a straight line touch a circle</emph>, <emph>and from the point of contact a straight line be drawn at right angles to the tangent</emph>, <emph>the centre of the circle will be on the straight line so drawn</emph>. </p>\n      <p>For let a straight line <emph>DE</emph> touch the circle <emph>ABC</emph> at the point <emph>C</emph>, and from <emph>C</emph> let <emph>CA</emph> be drawn at right angles to <emph>DE</emph>; I say that the centre of the circle is on <emph>AC</emph>. </p>\n      <p>For suppose it is not, but, if <figure /> possible, let <emph>F</emph> be the centre, and let <emph>CF</emph> be joined. </p>\n      <p>Since a straight line <emph>DE</emph> touches the circle <emph>ABC</emph>, and <emph>FC</emph> has been joined from the centre to the point of contact, <hi rend=\"center\"><emph>FC</emph> is perpendicular to <emph>DE</emph>; [<ref target=\"elem.3.18\" targOrder=\"U\">III. 18</ref>] therefore the angle <emph>FCE</emph> is right.</hi>\n      </p>\n      <p>But the angle <emph>ACE</emph> is also right; <hi rend=\"center\">therefore the angle <emph>FCE</emph> is equal to the angle <emph>ACE</emph>, the less to the greater: which is impossible.</hi>\n      </p>\n      <p>Therefore <emph>F</emph> is not the centre of the circle <emph>ABC</emph>. </p>\n      <p>Similarly we can prove that neither is any other point except a point on <emph>AC</emph>. </p>\n      <p>Therefore etc. Q. E. D.</p>\n     "
    },
    {
      "id": "elem.3.20",
      "text": "\n      <head>PROPOSITION 20.</head>\n      <p><emph>In a circle the angle at the centre is double of the angle at the circumference</emph>, <emph>when the angles have the same circumference as base</emph>. </p>\n      <p>Let <emph>ABC</emph> be a circle, let the angle <emph>BEC</emph> be an angle <lb n=\"5\" />at its centre, and the angle <emph>BAC</emph> an angle at the circumference, and let them have the same circumference <emph>BC</emph> as base; I say that the angle <emph>BEC</emph> is double of <lb n=\"10\" />the angle <emph>BAC</emph>. <figure />\n      </p>\n      <p>For let <emph>AE</emph> be joined and drawn through to <emph>F</emph>. </p>\n      <p>Then, since <emph>EA</emph> is equal to <emph>EB</emph>, <hi rend=\"center\">the angle <emph>EAB</emph> is also equal to the <lb n=\"15\" />angle <emph>EBA</emph>; [<ref target=\"elem.1.5\" targOrder=\"U\">I. 5</ref>]</hi> therefore the angles <emph>EAB</emph>, <emph>EBA</emph> are double of the angle <emph>EAB</emph>. </p>\n      <p>But the angle <emph>BEF</emph> is equal to the angles <emph>EAB</emph>, <emph>EBA</emph>; [<ref target=\"elem.1.32\" targOrder=\"U\">I. 32</ref>] therefore the angle <emph>BEF</emph> is also double of the angle <lb n=\"20\" /><emph>EAB</emph>. </p>\n      <p>For the same reason <hi rend=\"center\">the angle <emph>FEC</emph> is also double of the angle <emph>EAC</emph>.</hi>\n      </p>\n      <p>Therefore the whole angle <emph>BEC</emph> is double of the whole angle <emph>BAC</emph>. <lb n=\"25\" /></p>\n      <p>Again let another straight line be inflected, and let there be another angle <emph>BDC</emph>; let <emph>DE</emph> be joined and produced to <emph>G</emph>. <pb n=\"47\" /></p>\n      <p>Similarly then we can prove that the angle <emph>GEC</emph> is double of the angle <emph>EDC</emph>, <lb n=\"30\" /><hi rend=\"center\">of which the angle <emph>GEB</emph> is double of the angle <emph>EDB</emph>; therefore the angle <emph>BEC</emph> which remains is double of the angle <emph>BDC</emph>.</hi>\n      </p>\n      <p>Therefore etc. Q. E. D.\n<note n=\"25\" type=\"crit\" place=\"unspecified\" anchored=\"yes\">\n        <p><hi rend=\"bold\">let another straight line be inflected</hi>, <foreign lang=\"greek\">κεκλάσθω δὴ πάλιν</foreign> (without <foreign lang=\"greek\">εὐθεῖα</foreign>). The verb <foreign lang=\"greek\">κλάω</foreign> (to <emph>break off</emph>) was the regular technical term for drawing from a point a (broken) straight line which first meets another straight line or curve and is then <emph>bent back</emph> from it to another point, or (in other words) for drawing straight lines from two points meeting at a point on a curve or another straight line. <foreign lang=\"greek\">κεκλάσθαι</foreign> is one of the geometrical terms the definition of which must according to Aristotle be assumed (<xref n=\"Aristot. Post. Anal. 76b 9\" from=\"ROOT\" to=\"DITTO\" targOrder=\"U\"><title>Anal. Post.</title> I. 10, 76 b 9</xref>).</p>\n       </note></p>\n     "
    },
    {
      "id": "elem.3.21",
      "text": "\n      <head>PROPOSITION 21.</head>\n      <p><emph>In a circle the angles in the same segment are equal to one another</emph>. </p>\n      <p>Let <emph>ABCD</emph> be a circle, and let the angles <emph>BAD</emph>, <emph>BED</emph> be angles in the same segment <emph>BAED</emph>; I say that the angles <emph>BAD</emph>, <emph>BED</emph> are equal to one another. </p>\n      <p>For let the centre of the circle <emph>ABCD</emph> be taken, and let it be <emph>F</emph>; let <figure />\n       <emph>BF</emph>, <emph>FD</emph> be joined. </p>\n      <p>Now, since the angle <emph>BFD</emph> is at the centre, <hi rend=\"center\">and the angle <emph>BAD</emph> at the circumference, and they have the same circumference <emph>BCD</emph> as base, therefore the angle <emph>BFD</emph> is double of the angle <emph>BAD</emph>. [<ref target=\"elem.3.20\" targOrder=\"U\">III. 20</ref>]</hi>\n      </p>\n      <p>For the same reason <hi rend=\"center\">the angle <emph>BFD</emph> is also double of the angle <emph>BED</emph>; therefore the angle <emph>BAD</emph> is equal to the angle <emph>BED</emph>.</hi>\n      </p>\n      <p>Therefore etc. Q. E. D.</p>\n     "
    },
    {
      "id": "elem.3.22",
      "text": "\n      <head>PROPOSITION 22.</head>\n      <p><emph>The opposite angles of quadrilaterals in circles are equal to two right angles</emph>. </p>\n      <p>Let <emph>ABCD</emph> be a circle, and let <emph>ABCD</emph> be a quadrilateral in it; I say that the opposite angles are equal to two right angles. </p>\n      <p>Let <emph>AC</emph>, <emph>BD</emph> be joined. </p>\n      <p>Then, since in any triangle the three angles are equal to two right angles, [<ref target=\"elem.1.32\" targOrder=\"U\">I. 32</ref>] <pb n=\"52\" /><hi rend=\"center\">the three angles <emph>CAB</emph>, <emph>ABC</emph>, <emph>BCA</emph> of the triangle <emph>ABC</emph> are equal to two right angles.</hi>\n      </p>\n      <p>But the angle <emph>CAB</emph> is equal to the angle <emph>BDC</emph>, for they are in the same segment <emph>BADC</emph>; [<ref target=\"elem.3.21\" targOrder=\"U\">III. 21</ref>] and the angle <emph>ACB</emph> is equal to the angle <figure />\n       <emph>ADB</emph>, for they are in the same segment <emph>ADCB</emph>; therefore the whole angle <emph>ADC</emph> is equal to the angles <emph>BAC</emph>, <emph>ACB</emph>. </p>\n      <p>Let the angle <emph>ABC</emph> be added to each; therefore the angles <emph>ABC</emph>, <emph>BAC</emph>, <emph>ACB</emph> are equal to the angles <emph>ABC</emph>, <emph>ADC</emph>. But the angles <emph>ABC</emph>, <emph>BAC</emph>, <emph>ACB</emph> are equal to two right angles; therefore the angles <emph>ABC</emph>, <emph>ADC</emph> are also equal to two right angles. </p>\n      <p>Similarly we can prove that the angles <emph>BAD</emph>, <emph>DCB</emph> are also equal to two right angles. </p>\n      <p>Therefore etc. Q. E. D.</p>\n     "
    },
    {
      "id": "elem.3.23",
      "text": "\n      <head>PROPOSITION 23.</head>\n      <p><emph>On the same straight line there cannot be constructed two similar and unequal segments of circles on the same side</emph>. </p>\n      <p>For, if possible, on the same straight line <emph>AB</emph> let two similar and unequal segments of circles <emph>ACB</emph>, <emph>ADB</emph> be constructed on the same side; <figure /> let <emph>ACD</emph> be drawn through, and let <emph>CB</emph>, <emph>DB</emph> be joined. </p>\n      <p>Then, since the segment <emph>ACB</emph> is similar to the segment <emph>ADB</emph>, <pb n=\"53\" />and similar segments of circles are those which admit equal angles, [<ref target=\"elem.3.def.11\" targOrder=\"U\">III. Def. 11</ref>] <hi rend=\"center\">the angle <emph>ACB</emph> is equal to the angle <emph>ADB</emph>, the exterior to the interior: which is impossible. [<ref target=\"elem.1.16\" targOrder=\"U\">I. 16</ref>]</hi>\n      </p>\n      <p>Therefore etc. Q. E. D.\n<note n=\"1\" type=\"crit\" place=\"unspecified\" anchored=\"yes\">\n        <p><hi rend=\"bold\">cannot be constructed</hi>, <foreign lang=\"greek\">οὐ συσταθήσεται</foreign>, the same phrase as in 1. 7.</p>\n       </note></p>\n     "
    },
    {
      "id": "elem.3.24",
      "text": "\n      <head>PROPOSITION 24.</head>\n      <p><emph>Similar segments of circles on equal straight lines are equal to one another</emph>. </p>\n      <p>For let <emph>AEB</emph>, <emph>CFD</emph> be similar segments of circles on equal straight lines <emph>AB</emph>, <emph>CD</emph>; <lb n=\"5\" />I say that the segment <emph>AEB</emph> is equal to the segment <emph>CFD</emph>. </p>\n      <p>For, if the segment <emph>AEB</emph> be applied to <emph>CFD</emph>, and if the point <emph>A</emph> be placed on <emph>C</emph> and the straight line <emph>AB</emph> on <emph>CD</emph>, <pb n=\"54\" /><hi rend=\"center\">the point <emph>B</emph> will also coincide with the point <emph>D</emph>, because <emph>AB</emph> is equal to <emph>CD</emph>;</hi>\n       <lb n=\"10\" /><hi rend=\"center\">and, <emph>AB</emph> coinciding with <emph>CD</emph>, the segment <emph>AEB</emph> will also coincide with <emph>CFD</emph>.</hi>\n       <figure />\n      </p>\n      <p>For, if the straight line <emph>AB</emph> coincide with <emph>CD</emph> but the segment <emph>AEB</emph> do not coincide with <emph>CFD</emph>, it will either fall with it, or outside it; <lb n=\"15\" />or it will fall awry, as <emph>CGD</emph>, and a circle cuts a circle at more points than two : which is impossible. [<ref target=\"elem.3.10\" targOrder=\"U\">III. 10</ref>] </p>\n      <p>Therefore, if the straight line <emph>AB</emph> be applied to <emph>CD</emph>, the segment <emph>AEB</emph> will not fail to coincide with <emph>CFD</emph> also; <hi rend=\"center\">therefore it will coincide with it and will be equal to it.</hi>\n       <lb n=\"20\" /></p>\n      <p>Therefore etc. Q. E. D.\n<note n=\"15\" type=\"crit\" place=\"unspecified\" anchored=\"yes\">\n        <p><hi rend=\"bold\">fall awry</hi>, <foreign lang=\"greek\">παραλλάξει</foreign>, the same word as used in the like case in <ref target=\"elem.1.8\" targOrder=\"U\">I. 8</ref>. The word implies that the applied figure will partly fall short of, and partly overlap, the figure to which it is applied.</p>\n       </note></p>\n     "
    },
    {
      "id": "elem.3.25",
      "text": "\n      <head>PROPOSITION 25.</head>\n      <p><emph>Given a segment of a circle</emph>, <emph>to describe the complete circle of which it is a segment</emph>. </p>\n      <p>Let <emph>ABC</emph> be the given segment of a circle; thus it is required to describe the complete circle belonging to the segment <emph>ABC</emph>, that is, of which it is a segment. </p>\n      <p>For let <emph>AC</emph> be bisected at <emph>D</emph>, let <emph>DB</emph> be drawn from the point <emph>D</emph> at right angles to <emph>AC</emph>, and let <emph>AB</emph>. be joined; <pb n=\"55\" /><hi rend=\"center\">the angle <emph>ABD</emph> is then greater than, equal to, or less than the angle <emph>BAD</emph>.</hi>\n      </p>\n      <p>First let it be greater; and on the straight line <emph>BA</emph>, and at the point <emph>A</emph> on it, let the angle <emph>BAE</emph> be constructed equal to the angle <emph>ABD</emph>; let <emph>DB</emph> be drawn through to <emph>E</emph>, and let <emph>EC</emph> be joined. </p>\n      <p>Then, since the angle <emph>ABE</emph> is equal to the angle <emph>BAE</emph>, <figure />\n       <hi rend=\"center\">the straight line <emph>EB</emph> is also equal to <emph>EA</emph>. [<ref target=\"elem.1.6\" targOrder=\"U\">I. 6</ref>]</hi>\n      </p>\n      <p>And, since <emph>AD</emph> is equal to <emph>DC</emph>, and <emph>DE</emph> is common, <hi rend=\"center\">the two sides <emph>AD</emph>, <emph>DE</emph> are equal to the two sides <emph>CD</emph>, <emph>DE</emph> respectively;</hi> and the angle <emph>ADE</emph> is equal to the angle <emph>CDE</emph>, for each is right; <hi rend=\"center\">therefore the base <emph>AE</emph> is equal to the base <emph>CE</emph>.</hi>\n      </p>\n      <p>But <emph>AE</emph> was proved equal to <emph>BE</emph>; <hi rend=\"center\">therefore <emph>BE</emph> is also equal to <emph>CE</emph>;</hi> therefore the three straight lines <emph>AE</emph>, <emph>EB</emph>, <emph>EC</emph> are equal to one another. </p>\n      <p>Therefore the circle drawn with centre <emph>E</emph> and distance one of the straight lines <emph>AE</emph>, <emph>EB</emph>, <emph>EC</emph> will also pass through the remaining points and will have been completed. [<ref target=\"elem.3.9\" targOrder=\"U\">III. 9</ref>] </p>\n      <p>Therefore, given a segment of a circle, the complete circle has been described. </p>\n      <p>And it is manifest that the segment <emph>ABC</emph> is less than a semicircle, because the centre <emph>E</emph> happens to be outside it. </p>\n      <p>Similarly, even if the angle <emph>ABD</emph> be equal to the angle <emph>BAD</emph>, <emph>AD</emph> being equal to each of the two <emph>BD</emph>, <emph>DC</emph>, <hi rend=\"center\">the three straight lines <emph>DA</emph>, <emph>DB</emph>, <emph>DC</emph> will be equal to one another, <figure />\n        <emph>D</emph> will be the centre of the completed circle, and <emph>ABC</emph> will clearly be a semicircle.</hi>\n       <pb n=\"56\" /></p>\n      <p>But, if the angle <emph>ABD</emph> be less than the angle <emph>BAD</emph>, and if we construct, on the straight line <emph>BA</emph> and at the point <emph>A</emph> on it, an angle equal to the angle <emph>ABD</emph>, the centre will fall on <emph>DB</emph> within the segment <emph>ABC</emph>, and the segment <figure />\n       <emph>ABC</emph> will clearly be greater than a semicircle. </p>\n      <p>Therefore, given a segment of a circle, the complete circle has been described. Q. E. F.\n<note n=\"1\" type=\"crit\" place=\"unspecified\" anchored=\"yes\">\n        <p><hi rend=\"bold\">to describe the complete circle</hi>, <foreign lang=\"greek\">προσαναγράψαι τὸν κύκλον</foreign>, literally “to describe the circle <emph>on to it</emph>.’</p>\n       </note></p>\n     "
    },
    {
      "id": "elem.3.26",
      "text": "\n      <head>PROPOSITION 26.</head>\n      <p><emph>In equal circles equal angles stand on equal circumferences</emph>, <emph>whether they stand at the centres or at the circumferences</emph>. <pb n=\"57\" /></p>\n      <p>Let <emph>ABC</emph>, <emph>DEF</emph> be equal circles, and in them let there be equal angles, namely at the centres the angles <emph>BGC</emph>, <emph>EHF</emph>, and at the circumferences the angles <emph>BAC</emph>, <emph>EDF</emph>; I say that the circumference <emph>BKC</emph> is equal to the circumference <emph>ELF</emph>. <figure />\n      </p>\n      <p>For let <emph>BC</emph>, <emph>EF</emph> be joined. </p>\n      <p>Now, since the circles <emph>ABC</emph>, <emph>DEF</emph> are equal, <hi rend=\"center\">the radii are equal.</hi>\n      </p>\n      <p>Thus the two straight lines <emph>BG</emph>, <emph>GC</emph> are equal to the two straight lines <emph>EH</emph>, <emph>HF</emph>; <hi rend=\"center\">and the angle at <emph>G</emph> is equal to the angle at <emph>H</emph>; therefore the base <emph>BC</emph> is equal to the base <emph>EF</emph>. [<ref target=\"elem.1.4\" targOrder=\"U\">I. 4</ref>]</hi>\n      </p>\n      <p>And, since the angle at <emph>A</emph> is equal to the angle at <emph>D</emph>, <hi rend=\"center\">the segment <emph>BAC</emph> is similar to the segment <emph>EDF</emph>; [<ref target=\"elem.3.def.11\" targOrder=\"U\">III. Def. 11</ref>]</hi> and they are upon equal straight lines. </p>\n      <p>But similar segments of circles on equal straight lines are equal to one another; [<ref target=\"elem.3.24\" targOrder=\"U\">III. 24</ref>] <hi rend=\"center\">therefore the segment <emph>BAC</emph> is equal to <emph>EDF</emph>.</hi> But the whole circle <emph>ABC</emph> is also equal to the whole circle <emph>DEF</emph>; therefore the circumference <emph>BKC</emph> which remains is equal to the circumference <emph>ELF</emph>. </p>\n      <p>Therefore etc. Q. E. D.</p>\n     "
    },
    {
      "id": "elem.3.27",
      "text": "\n      <head>PROPOSITION 27.</head>\n      <p><emph>In equal circles angles standing on equal circumferences are equal to one another</emph>, <emph>whether they stand at the centres or at the circumferences</emph>. </p>\n      <p>For in equal circles <emph>ABC</emph>, <emph>DEF</emph>, on equal circumferences <emph>BC</emph>, <emph>EF</emph>, let the angles <emph>BGC</emph>, <emph>EHF</emph> stand at the centres <emph>G</emph>, <emph>H</emph>, and the angles <emph>BAC</emph>, <emph>EDF</emph> at the circumferences; I say that the angle <emph>BGC</emph> is equal to the angle <emph>EHF</emph>, and the angle <emph>BAC</emph> is equal to the angle <emph>EDF</emph>. <figure />\n      </p>\n      <p>For, if the angle <emph>BGC</emph> is unequal to the angle <emph>EHF</emph>, <hi rend=\"center\">one of them is greater.</hi> Let the angle <emph>BGC</emph> be greater : and on the straight line <emph>BG</emph>, and at the point <emph>G</emph> on it, let the angle <emph>BGK</emph> be constructed equal to the angle <emph>EHF</emph>. [<ref target=\"elem.1.23\" targOrder=\"U\">I. 23</ref>] </p>\n      <p>Now equal angles stand on equal circumferences, when they are at the centres; [<ref target=\"elem.3.26\" targOrder=\"U\">III. 26</ref>] <hi rend=\"center\">therefore the circumference <emph>BK</emph> is equal to the circumference <emph>EF</emph>.</hi>\n      </p>\n      <p>But <emph>EF</emph> is equal to <emph>BC</emph>; <hi rend=\"center\">therefore <emph>BK</emph> is also equal to <emph>BC</emph>, the less to the greater : which is impossible.</hi>\n      </p>\n      <p>Therefore the angle <emph>BGC</emph> is not unequal to the angle <emph>EHF</emph>; <hi rend=\"center\">therefore it is equal to it.</hi>\n       <pb n=\"59\" /></p>\n      <p>And the angle at <emph>A</emph> is half of the angle <emph>BGC</emph>, <hi rend=\"center\">and the angle at <emph>D</emph> half of the angle <emph>EHF</emph>; [<ref target=\"elem.3.20\" targOrder=\"U\">III. 20</ref>]</hi> therefore the angle at <emph>A</emph> is also equal to the angle at <emph>D</emph>. </p>\n      <p>Therefore etc. Q. E. D.</p>\n     "
    },
    {
      "id": "elem.3.28",
      "text": "\n      <head>PROPOSITION 28.</head>\n      <p><emph>In equal circles equal straight lines cut off equal circumferences</emph>, <emph>the greater equal to the greater and the less to the less</emph>. </p>\n      <p>Let <emph>ABC</emph>, <emph>DEF</emph> be equal circles, and in the circles let <emph>AB</emph>, <emph>DE</emph> be equal straight lines cutting off <emph>ACB</emph>, <emph>DFE</emph> as greater circumferences and <emph>AGB</emph>, <emph>DHE</emph> as lesser; I say that the greater circumference <emph>ACB</emph> is equal to the greater circumference <emph>DFE</emph>, and the less circumference <emph>AGB</emph> to <emph>DHE</emph>. <figure />\n      </p>\n      <p>For let the centres <emph>K</emph>, <emph>L</emph> of the circles be taken, and let <emph>AK</emph>, <emph>KB</emph>, <emph>DL</emph>, <emph>LE</emph> be joined. </p>\n      <p>Now, since the circles are equal, <hi rend=\"center\">the radii are also equal; therefore the two sides <emph>AK</emph>, <emph>KB</emph> are equal to the two sides <emph>DL</emph>, <emph>LE</emph>;</hi> and the base <emph>AB</emph> is equal to the base <emph>DE</emph>; <hi rend=\"center\">therefore the angle <emph>AKB</emph> is equal to the angle <emph>DLE</emph>. [<ref target=\"elem.1.8\" targOrder=\"U\">I. 8</ref>]</hi>\n      </p>\n      <p>But equal angles stand on equal circumferences, when they are at the centres; [<ref target=\"elem.3.26\" targOrder=\"U\">III. 26</ref>] <hi rend=\"center\">therefore the circumference <emph>AGB</emph> is equal to <emph>DHE</emph>.</hi>\n       <pb n=\"60\" /></p>\n      <p>And the whole circle <emph>ABC</emph> is also equal to the whole circle <emph>DEF</emph>; therefore the circumference <emph>ACB</emph> which remains is also equal to the circumference <emph>DFE</emph> which remains. </p>\n      <p>Therefore etc. Q. E. D.</p>\n     "
    },
    {
      "id": "elem.3.29",
      "text": "\n      <head>PROPOSITION 29.</head>\n      <p><emph>In equal circles equal circumferences are subtended by equal straight lines</emph>. </p>\n      <p>Let <emph>ABC</emph>, <emph>DEF</emph> be equal circles, and in them let equal circumferences <emph>BGC</emph>, <emph>EHF</emph> be cut off; and let the straight lines <emph>BC</emph>, <emph>EF</emph> be joined; I say that <emph>BC</emph> is equal to <emph>EF</emph>. <figure />\n      </p>\n      <p>For let the centres of the circles be taken, and let them be <emph>K</emph>, <emph>L</emph>; let <emph>BK</emph>, <emph>KC</emph>, <emph>EL</emph>, <emph>LF</emph> be joined. </p>\n      <p>Now, since the circumference <emph>BGC</emph> is equal to the circumference <emph>EHF</emph>, <hi rend=\"center\">the angle <emph>BKC</emph> is also equal to the angle <emph>ELF</emph>. [<ref target=\"elem.3.27\" targOrder=\"U\">III. 27</ref>]</hi>\n      </p>\n      <p>And, since the circles <emph>ABC</emph>, <emph>DEF</emph> are equal, <hi rend=\"center\">the radii are also equal; therefore the two sides <emph>BK</emph>, <emph>KC</emph> are equal to the two sides <emph>EL</emph>, <emph>LF</emph>; and they contain equal angles; therefore the base <emph>BC</emph> is equal to the base <emph>EF</emph>. [<ref target=\"elem.1.4\" targOrder=\"U\">I. 4</ref>]</hi>\n      </p>\n      <p>Therefore etc.</p>\n     "
    },
    {
      "id": "elem.3.30",
      "text": "\n      <head>PROPOSITION 30.</head>\n      <p><emph>To bisect a given circumference</emph>. </p>\n      <p>Let <emph>ADB</emph> be the given circumference; thus it is required to bisect the circumference <emph>ADB</emph>. </p>\n      <p>Let <emph>AB</emph> be joined and bisected at <emph>C</emph>; from the point <emph>C</emph> let <emph>CD</emph> be drawn at right angles to the straight line <emph>AB</emph>, <figure /> and let <emph>AD</emph>, <emph>DB</emph> be joined. </p>\n      <p>Then, since <emph>AC</emph> is equal to <emph>CB</emph>, and <emph>CD</emph> is common, <hi rend=\"center\">the two sides <emph>AC</emph>, <emph>CD</emph> are equal to the two sides <emph>BC</emph>, <emph>CD</emph>;</hi> and the angle <emph>ACD</emph> is equal to the angle <emph>BCD</emph>, for each is right; <hi rend=\"center\">therefore the base <emph>AD</emph> is equal to the base <emph>DB</emph>. [<ref target=\"elem.1.4\" targOrder=\"U\">I. 4</ref>]</hi>\n      </p>\n      <p>But equal straight lines cut off equal circumferences, the greater equal to the greater, and the less to the less; [<ref target=\"elem.3.28\" targOrder=\"U\">III. 28</ref>] <hi rend=\"center\">and each of the circumferences <emph>AD</emph>, <emph>DB</emph> is less than a semicircle; therefore the circumference <emph>AD</emph> is equal to the circumference <emph>DB</emph>.</hi>\n      </p>\n      <p>Therefore the given circumference has been bisected at the point <emph>D</emph>. Q. E. F.</p>\n     "
    },
    {
      "id": "elem.3.31",
      "text": "\n      <head>PROPOSITION 31.</head>\n      <p><emph>In a circle the angle in the semicircle is right</emph>, <emph>that in a greater segment less than a right angle</emph>, <emph>and that in a less segment greater than a right angle; and further the angle of the greater segment is greater than a right angle</emph>, <emph>and the angle of the less segment less than a right angle</emph>. <pb n=\"62\" /></p>\n      <p>Let <emph>ABCD</emph> be a circle, let <emph>BC</emph> be its diameter, and <emph>E</emph> its centre, and let <emph>BA</emph>, <emph>AC</emph>, <emph>AD</emph>, <emph>DC</emph> be joined; I say that the angle <emph>BAC</emph> in the semicircle <emph>BAC</emph> is right, the angle <emph>ABC</emph> in the segment <emph>ABC</emph> greater than the semicircle is less <figure /> than a right angle, and the angle <emph>ADC</emph> in the segment <emph>ADC</emph> less than the semicircle is greater than a right angle. </p>\n      <p>Let <emph>AE</emph> be joined, and let <emph>BA</emph> be carried through to <emph>F</emph>. </p>\n      <p>Then, since <emph>BE</emph> is equal to <emph>EA</emph>, <hi rend=\"center\">the angle <emph>ABE</emph> is also equal to the angle <emph>BAE</emph>. [<ref target=\"elem.1.5\" targOrder=\"U\">I. 5</ref>]</hi>\n      </p>\n      <p>Again, since <emph>CE</emph> is equal to <emph>EA</emph>, <hi rend=\"center\">the angle <emph>ACE</emph> is also equal to the angle <emph>CAE</emph>. [<ref target=\"elem.1.5\" targOrder=\"U\">I. 5</ref>]</hi>\n      </p>\n      <p>Therefore the whole angle <emph>BAC</emph> is equal to the two angles <emph>ABC</emph>, <emph>ACB</emph>. </p>\n      <p>But the angle <emph>FAC</emph> exterior to the triangle <emph>ABC</emph> is also equal to the two angles <emph>ABC</emph>, <emph>ACB</emph>; [<ref target=\"elem.1.32\" targOrder=\"U\">I. 32</ref>] <hi rend=\"center\">therefore the angle <emph>BAC</emph> is also equal to the angle <emph>FAC</emph>; therefore each is right; [<ref target=\"elem.1.def.10\" targOrder=\"U\">I. Def. 10</ref>] therefore the angle <emph>BAC</emph> in the semicircle <emph>BAC</emph> is right.</hi>\n      </p>\n      <p>Next, since in the triangle <emph>ABC</emph> the two angles <emph>ABC</emph>, <emph>BAC</emph> are less than two right angles, [<ref target=\"elem.1.17\" targOrder=\"U\">I. 17</ref>] and the angle <emph>BAC</emph> is a right angle, <hi rend=\"center\">the angle <emph>ABC</emph> is less than a right angle;</hi> and it is the angle in the segment <emph>ABC</emph> greater than the semicircle. </p>\n      <p>Next, since <emph>ABCD</emph> is a quadrilateral in a circle, and the opposite angles of quadrilaterals in circles are equal to two right angles, [<ref target=\"elem.3.22\" targOrder=\"U\">III. 22</ref>] while the angle <emph>ABC</emph> is less than a right angle, therefore the angle <emph>ADC</emph> which remains is greater than a right angle; and it is the angle in the segment <emph>ADC</emph> less than the semicircle. <pb n=\"63\" /></p>\n      <p>I say further that the angle of the greater segment, namely that contained by the circumference <emph>ABC</emph> and the straight line <emph>AC</emph>, is greater than a right angle; and the angle of the less segment, namely that contained by the circumference <emph>ADC</emph> and the straight line <emph>AC</emph>, is less than a right angle. </p>\n      <p>This is at once manifest. For, since the angle contained by the straight lines <emph>BA</emph>, <emph>AC</emph> is right, <hi rend=\"center\">the angle contained by the circumference <emph>ABC</emph> and the straight line <emph>AC</emph> is greater than a right angle.</hi>\n      </p>\n      <p>Again, since the angle contained by the straight lines <emph>AC</emph>, <emph>AF</emph> is right, <hi rend=\"center\">the angle contained by the straight line <emph>CA</emph> and the circumference <emph>ADC</emph> is less than a right angle.</hi>\n      </p>\n      <p>Therefore etc. Q. E. D.</p>\n     "
    },
    {
      "id": "elem.3.32",
      "text": "\n      <head>PROPOSITION 32.</head>\n      <p><emph>If a straight line touch a circle</emph>, <emph>and from the point of contact there be drawn across</emph>, <emph>in the circle</emph>, <emph>a straight line cutting the circle</emph>, <emph>the angles which it makes with the tangent will be equal to the angles in the alternate segments of the circle</emph>. </p>\n      <p>For let a straight line <emph>EF</emph> touch the circle <emph>ABCD</emph> at the point <emph>B</emph>, and from the point <emph>B</emph> let there be drawn across, in the circle <emph>ABCD</emph>, a straight line <emph>BD</emph> cutting it; I say that the angles which <emph>BD</emph> makes with the tangent <emph>EF</emph> will be equal to the angles in the alternate segments of the <pb n=\"66\" />circle, that is, that the angle <emph>FBD</emph> is equal to the angle constructed in the segment <emph>BAD</emph>, and the angle <emph>EBD</emph> is equal to the angle constructed in the segment <emph>DCB</emph>. </p>\n      <p>For let <emph>BA</emph> be drawn from <emph>B</emph> at right angles to <emph>EF</emph>, let a point <emph>C</emph> be taken at random on the circumference <emph>BD</emph>, <figure /> and let <emph>AD</emph>, <emph>DC</emph>, <emph>CB</emph> be joined. </p>\n      <p>Then, since a straight line <emph>EF</emph> touches the circle <emph>ABCD</emph> at <emph>B</emph>, and <emph>BA</emph> has been drawn from the point of contact at right angles to the tangent, the centre of the circle <emph>ABCD</emph> is on <emph>BA</emph>. [<ref target=\"elem.3.19\" targOrder=\"U\">III. 19</ref>] </p>\n      <p>Therefore <emph>BA</emph> is a diameter of the circle <emph>ABCD</emph>; <hi rend=\"center\">therefore the angle <emph>ADB</emph>, being an angle in a semicircle, is right. [<ref target=\"elem.3.31\" targOrder=\"U\">III. 31</ref>]</hi>\n      </p>\n      <p>Therefore the remaining angles <emph>BAD</emph>, <emph>ABD</emph> are equal to one right angle. [<ref target=\"elem.1.32\" targOrder=\"U\">I. 32</ref>] </p>\n      <p>But the angle <emph>ABF</emph> is also right; therefore the angle <emph>ABF</emph> is equal to the angles <emph>BAD</emph>, <emph>ABD</emph>. </p>\n      <p>Let the angle <emph>ABD</emph> be subtracted from each; therefore the angle <emph>DBF</emph> which remains is equal to the angle <emph>BAD</emph> in the alternate segment of the circle. </p>\n      <p>Next, since <emph>ABCD</emph> is a quadrilateral in a circle, its opposite angles are equal to two right angles. [<ref target=\"elem.3.22\" targOrder=\"U\">III. 22</ref>] </p>\n      <p>But the angles <emph>DBF</emph>, <emph>DBE</emph> are also equal to two right angles; therefore the angles <emph>DBF</emph>, <emph>DBE</emph> are equal to the angles <emph>BAD</emph>, <emph>BCD</emph>, <hi rend=\"center\">of which the angle <emph>BAD</emph> was proved equal to the angle <emph>DBF</emph>; therefore the angle <emph>DBE</emph> which remains is equal to the angle <emph>DCB</emph> in the alternate segment <emph>DCB</emph> of the circle.</hi>\n      </p>\n      <p>Therefore etc. Q. E. D.</p>\n     "
    },
    {
      "id": "elem.3.33",
      "text": "\n      <head>PROPOSITION 33.</head>\n      <p><emph>On a given straight line to describe a segment of a circle admitting an angle equal to a given rectilineal angle</emph>. </p>\n      <p>Let <emph>AB</emph> be the given straight line, and the angle at <emph>C</emph> the given rectilineal angle; thus it is required to describe on the given straight line <emph>AB</emph> a segment of a circle admitting an angle equal to the angle at <emph>C</emph>. <figure />\n      </p>\n      <p>The angle at <emph>C</emph> is then acute, or right, or obtuse. </p>\n      <p>First let it be acute, and, as in the first figure, on the straight line <emph>AB</emph>, and at the point <emph>A</emph>, let the angle <emph>BAD</emph> be constructed equal to the angle at <emph>C</emph>; <hi rend=\"center\">therefore the angle <emph>BAD</emph> is also acute.</hi>\n      </p>\n      <p>Let <emph>AE</emph> be drawn at right angles to <emph>DA</emph>, let <emph>AB</emph> be <pb n=\"68\" />bisected at <emph>F</emph>, let <emph>FG</emph> be drawn from the point <emph>F</emph> at right angles to <emph>AB</emph>, and let <emph>GB</emph> be joined. </p>\n      <p>Then, since <emph>AF</emph> is equal to <emph>FB</emph>, and <emph>FG</emph> is common, <hi rend=\"center\">the two sides <emph>AF</emph>, <emph>FG</emph> are equal to the two sides <emph>BF</emph>, <emph>FG</emph>;</hi> and the angle <emph>AFG</emph> is equal to the angle <emph>BFG</emph>; <hi rend=\"center\">therefore the base <emph>AG</emph> is equal to the base <emph>BG</emph>. [<ref target=\"elem.1.4\" targOrder=\"U\">I. 4</ref>]</hi>\n      </p>\n      <p>Therefore the circle described with centre <emph>G</emph> and distance <emph>GA</emph> will pass through <emph>B</emph> also. </p>\n      <p>Let it be drawn, and let it be <emph>ABE</emph>; let <emph>EB</emph> be joined. </p>\n      <p>Now, since <emph>AD</emph> is drawn from <emph>A</emph>, the extremity of the diameter <emph>AE</emph>, at right angles to <emph>AE</emph>, <hi rend=\"center\">therefore <emph>AD</emph> touches the circle <emph>ABE</emph>. [<ref target=\"elem.3.16.p.1\" targOrder=\"U\">III. 16, Por.</ref>]</hi>\n      </p>\n      <p>Since then a straight line <emph>AD</emph> touches the circle <emph>ABE</emph>, and from the point of contact at <emph>A</emph> a straight line <emph>AB</emph> is drawn across in the circle <emph>ABE</emph>, <hi rend=\"center\">the angle <emph>DAB</emph> is equal to the angle <emph>AEB</emph> in the alternate segment of the circle. [<ref target=\"elem.3.32\" targOrder=\"U\">III. 32</ref>]</hi>\n      </p>\n      <p>But the angle <emph>DAB</emph> is equal to the angle at <emph>C</emph>; therefore the angle at <emph>C</emph> is also equal to the angle <emph>AEB</emph>. </p>\n      <p>Therefore on the given straight line <emph>AB</emph> the segment <emph>AEB</emph> of a circle has been described admitting the angle <emph>AEB</emph> equal to the given angle, the angle at <emph>C</emph>. </p>\n      <p>Next let the angle at <emph>C</emph> be right; <figure /> and let it be again required to describe on <emph>AB</emph> a segment of a circle admitting an angle equal to the right angle at <emph>C</emph>. </p>\n      <p>Let the angle <emph>BAD</emph> be constructed equal to the right angle at <emph>C</emph>, as is the case in the second figure; <pb n=\"69\" />let <emph>AB</emph> be bisected at <emph>F</emph>, and with centre <emph>F</emph> and distance either <emph>FA</emph> or <emph>FB</emph> let the circle <emph>AEB</emph> be described. </p>\n      <p>Therefore the straight line <emph>AD</emph> touches the circle <emph>ABE</emph>, because the angle at <emph>A</emph> is right. [<ref target=\"elem.3.16.p.1\" targOrder=\"U\">III. 16, Por.</ref>] </p>\n      <p>And the angle <emph>BAD</emph> is equal to the angle in the segment <emph>AEB</emph>, for the latter too is itself a right angle, being an angle in a semicircle. [<ref target=\"elem.3.31\" targOrder=\"U\">III. 31</ref>] </p>\n      <p>But the angle <emph>BAD</emph> is also equal to the angle at <emph>C</emph>. </p>\n      <p>Therefore the angle <emph>AEB</emph> is also equal to the angle at <emph>C</emph>. </p>\n      <p>Therefore again the segment <emph>AEB</emph> of a circle has been described on <emph>AB</emph> admitting an angle equal to the angle at <emph>C</emph>. </p>\n      <p>Next, let the angle at <emph>C</emph> be obtuse; <figure /> and on the straight line <emph>AB</emph>, and at the point <emph>A</emph>, let the angle <emph>BAD</emph> be constructed equal to it, as is the case in the third figure; let <emph>AE</emph> be drawn at right angles to <emph>AD</emph>, let <emph>AB</emph> be again bisected at <emph>F</emph>, let <emph>FG</emph> be drawn at right angles to <emph>AB</emph>, and let <emph>GB</emph> be joined. </p>\n      <p>Then, since <emph>AF</emph> is again equal to <emph>FB</emph>, and <emph>FG</emph> is common, <hi rend=\"center\">the two sides <emph>AF</emph>, <emph>FG</emph> are equal to the two sides <emph>BF</emph>, <emph>FG</emph>;</hi> and the angle <emph>AFG</emph> is equal to the angle <emph>BFG</emph>; <hi rend=\"center\">therefore the base <emph>AG</emph> is equal to the base <emph>BG</emph>. [<ref target=\"elem.1.4\" targOrder=\"U\">I. 4</ref>]</hi>\n      </p>\n      <p>Therefore the circle described with centre <emph>G</emph> and distance <emph>GA</emph> will pass through <emph>B</emph> also; let it so pass, as <emph>AEB</emph>. </p>\n      <p>Now, since <emph>AD</emph> is drawn at right angles to the diameter <emph>AE</emph> from its extremity, <hi rend=\"center\"><emph>AD</emph> touches the circle <emph>AEB</emph>. [<ref target=\"elem.3.16.p.1\" targOrder=\"U\">III. 16, Por.</ref>]</hi>\n      </p>\n      <p>And <emph>AB</emph> has been drawn across from the point of contact at <emph>A</emph>; <hi rend=\"center\">therefore the angle <emph>BAD</emph> is equal to the angle constructed in the alternate segment <emph>AHB</emph> of the circle. [<ref target=\"elem.3.32\" targOrder=\"U\">III. 32</ref>]</hi>\n       <pb n=\"70\" /></p>\n      <p>But the angle <emph>BAD</emph> is equal to the angle at <emph>C</emph>. </p>\n      <p>Therefore the angle in the segment <emph>AHB</emph> is also equal to the angle at <emph>C</emph>. </p>\n      <p>Therefore on the given straight line <emph>AB</emph> the segment <emph>AHB</emph> of a circle has been described admitting an angle equal to the angle at <emph>C</emph>. Q. E. F.</p>\n     "
    },
    {
      "id": "elem.3.34",
      "text": "\n      <head>PROPOSITION 34.</head>\n      <p><emph>From a given circle to cut off a segment admitting an angle equal to a given rectilineal angle</emph>. </p>\n      <p>Let <emph>ABC</emph> be the given circle, and the angle at <emph>D</emph> the given rectilineal angle; thus it is required to cut off from the circle <emph>ABC</emph> a segment admitting an angle equal to the given rectilineal angle, the angle at <emph>D</emph>. </p>\n      <p>Let <emph>EF</emph> be drawn touching <emph>ABC</emph> at the point <emph>B</emph>, and on the straight line <emph>FB</emph>, and at the point <emph>B</emph> on it, let the angle <emph>FBC</emph> be constructed equal to the angle at <emph>D</emph>. [<ref target=\"elem.1.23\" targOrder=\"U\">I. 23</ref>] </p>\n      <p>Then, since a straight line <emph>EF</emph> touches the circle <emph>ABC</emph>, <pb n=\"71\" /><hi rend=\"center\">and <emph>BC</emph> has been drawn across from the point of contact at <emph>B</emph>,</hi> the angle <emph>FBC</emph> is equal to the angle constructed in the alternate segment <emph>BAC</emph>. [<ref target=\"elem.3.32\" targOrder=\"U\">III. 32</ref>] <figure />\n      </p>\n      <p>But the angle <emph>FBC</emph> is equal to the angle at <emph>D</emph>; <hi rend=\"center\">therefore the angle in the segment <emph>BAC</emph> is equal to the angle at <emph>D</emph>.</hi>\n      </p>\n      <p>Therefore from the given circle <emph>ABC</emph> the segment <emph>BAC</emph>. has been cut off admitting an angle equal to the given rectilineal angle, the angle at <emph>D</emph>. Q. E. F.</p>\n     "
    },
    {
      "id": "elem.3.35",
      "text": "\n      <head>PROPOSITION 35.</head>\n      <p><emph>If in a circle two straight lines cut one another</emph>, <emph>the rectangle contained by the segments of the one is equal to the rectangle contained by the segments of the other</emph>. </p>\n      <p>For in the circle <emph>ABCD</emph> let the two straight lines <emph>AC</emph>, <emph>BD</emph> cut one another at the point <emph>E</emph>; I say that the rectangle contained by <emph>AE</emph>, <emph>EC</emph> is equal to the rectangle contained by <emph>DE</emph>, <emph>EB</emph>. <figure />\n      </p>\n      <p>If now <emph>AC</emph>, <emph>BD</emph> are through the centre, so that <emph>E</emph> is the centre of the circle <emph>ABCD</emph>, it is manifest that, <emph>AE</emph>, <emph>EC</emph>, <emph>DE</emph>, <emph>EB</emph> being equal, the rectangle contained by <emph>AE</emph>, <emph>EC</emph> is also equal to the rectangle contained by <emph>DE</emph>, <emph>EB</emph>. <pb n=\"72\" /></p>\n      <p>Next let <emph>AC</emph>, <emph>DB</emph> not be through the centre; let the centre of <emph>ABCD</emph> be taken, and let it be <emph>F</emph>; from <emph>F</emph> let <emph>FG</emph>, <emph>FH</emph> be drawn perpendicular to the straight lines <emph>AC</emph>, <emph>DB</emph>, and let <emph>FB</emph>, <emph>FC</emph>, <emph>FE</emph> be joined. <figure />\n      </p>\n      <p>Then, since a straight line <emph>GF</emph> through the centre cuts a straight line <emph>AC</emph> not through the centre at right angles, <hi rend=\"center\">it also bisects it; [<ref target=\"elem.3.3\" targOrder=\"U\">III. 3</ref>] therefore <emph>AG</emph> is equal to <emph>GC</emph>.</hi>\n      </p>\n      <p>Since, then, the straight line <emph>AC</emph> has been cut into equal parts at <emph>G</emph> and into unequal parts at <emph>E</emph>, the rectangle contained by <emph>AE</emph>, <emph>EC</emph> together with the square on <emph>EG</emph> is equal to the square on <emph>GC</emph>; [<ref target=\"elem.2.5\" targOrder=\"U\">II. 5</ref>] </p>\n      <p>Let the square on <emph>GF</emph> be added; therefore the rectangle <emph>AE</emph>, <emph>EC</emph> together with the squares on <emph>GE</emph>, <emph>GF</emph> is equal to the squares on <emph>CG</emph>, <emph>GF</emph>. </p>\n      <p>But the square on <emph>FE</emph> is equal to the squares on <emph>EG</emph>, <emph>GF</emph>, and the square on <emph>FC</emph> is equal to the squares on <emph>CG</emph>, <emph>GF</emph>; [<ref target=\"elem.1.47\" targOrder=\"U\">I. 47</ref>] <hi rend=\"center\">therefore the rectangle <emph>AE</emph>, <emph>EC</emph> together with the square on <emph>FE</emph> is equal to the square on <emph>FC</emph>.</hi>\n      </p>\n      <p>And <emph>FC</emph> is equal to <emph>FB</emph>; therefore the rectangle <emph>AE</emph>, <emph>EC</emph> together with the square on <emph>EF</emph> is equal to the square on <emph>FB</emph>. </p>\n      <p>For the same reason, also, the rectangle <emph>DE</emph>, <emph>EB</emph> together with the square on <emph>FE</emph> is equal to the square on <emph>FB</emph>. </p>\n      <p>But the rectangle <emph>AE</emph>, <emph>EC</emph> together with the square on <emph>FE</emph> was also proved equal to the square on <emph>FB</emph>; therefore the rectangle <emph>AE</emph>, <emph>EC</emph> together with the square on <emph>FE</emph> is equal to the rectangle <emph>DE</emph>, <emph>EB</emph> together with the square on <emph>FE</emph>. </p>\n      <p>Let the square on <emph>FE</emph> be subtracted from each; therefore the rectangle contained by <emph>AE</emph>, <emph>EC</emph> which remains is equal to the rectangle contained by <emph>DE</emph>, <emph>EB</emph>. </p>\n      <p>Therefore etc.</p>\n     "
    },
    {
      "id": "elem.3.36",
      "text": "\n      <head>PROPOSITION 36.</head>\n      <p><emph>If a point be taken outside a circle and from it there fall on the circle two straight lines</emph>, <emph>and if one of them cut the circle and the other touch it</emph>, <emph>the rectangle contained by the whole of the straight line which cuts the circle and the straight <pb n=\"74\" />line intercepted on it outside between the point and the convex circumference will be equal to the square on the tangent</emph>. </p>\n      <p>For let a point <emph>D</emph> be taken outside the circle <emph>ABC</emph>, and from <emph>D</emph> let the two straight lines <emph>DCA</emph>, <emph>DB</emph> fall on the circle <emph>ABC</emph>; let <emph>DCA</emph> cut the circle <emph>ABC</emph> and let <emph>BD</emph> touch it; I say that the rectangle contained by <emph>AD</emph>, <emph>DC</emph> is equal to the square on <emph>DB</emph>. <figure />\n      </p>\n      <p>Then <emph>DCA</emph> is either through the centre or not through the centre. </p>\n      <p>First let it be through the centre, and let <emph>F</emph> be the centre of the circle <emph>ABC</emph>; let <emph>FB</emph> be joined; <hi rend=\"center\">therefore the angle <emph>FBD</emph> is right. [<ref target=\"elem.3.18\" targOrder=\"U\">III. 18</ref>]</hi>\n      </p>\n      <p>And, since <emph>AC</emph> has been bisected at <emph>F</emph>, and <emph>CD</emph> is added to it, the rectangle <emph>AD</emph>, <emph>DC</emph> together with the square on <emph>FC</emph> is equal to the square on <emph>FD</emph>. [<ref target=\"elem.2.6\" targOrder=\"U\">II. 6</ref>] </p>\n      <p>But <emph>FC</emph> is equal to <emph>FB</emph>; therefore the rectangle <emph>AD</emph>, <emph>DC</emph> together with the square on <emph>FB</emph> is equal to the square on <emph>FD</emph>. </p>\n      <p>And the squares on <emph>FB</emph>, <emph>BD</emph> are equal to the square on <emph>FD</emph>; [<ref target=\"elem.1.47\" targOrder=\"U\">I. 47</ref>] therefore the rectangle <emph>AD</emph>, <emph>DC</emph> together with the square on <emph>FB</emph> is equal to the squares on <emph>FB</emph>, <emph>BD</emph>. </p>\n      <p>Let the square on <emph>FB</emph> be subtracted from each; therefore the rectangle <emph>AD</emph>, <emph>DC</emph> which remains is equal to the square on the tangent <emph>DB</emph>. </p>\n      <p>Again, let <emph>DCA</emph> not be through the centre of the circle <emph>ABC</emph>; let the centre <emph>E</emph> be taken, and from <emph>E</emph> let <emph>EF</emph> be drawn perpendicular to <emph>AC</emph>; let <emph>EB</emph>, <emph>EC</emph>, <emph>ED</emph> be joined. </p>\n      <p>Then the angle <emph>EBD</emph> is right. [<ref target=\"elem.3.18\" targOrder=\"U\">III. 18</ref>] <figure />\n      </p>\n      <p>And, since a straight line <emph>EF</emph> through the centre cuts a straight line <emph>AC</emph> not through the centre at right angles, <hi rend=\"center\">it also bisects it; [<ref target=\"elem.3.3\" targOrder=\"U\">III. 3</ref>] therefore <emph>AF</emph> is equal to <emph>FC</emph>.</hi>\n       <pb n=\"75\" /></p>\n      <p>Now, since the straight line <emph>AC</emph> has been bisected at the point <emph>F</emph>, and <emph>CD</emph> is added to it, the rectangle contained by <emph>AD</emph>, <emph>DC</emph> together with the square on <emph>FC</emph> is equal to the square on <emph>FD</emph>. [<ref target=\"elem.2.6\" targOrder=\"U\">II. 6</ref>] </p>\n      <p>Let the square on <emph>FE</emph> be added to each; therefore the rectangle <emph>AD</emph>, <emph>DC</emph> together with the squares on <emph>CF</emph>, <emph>FE</emph> is equal to the squares on <emph>FD</emph>, <emph>FE</emph>. </p>\n      <p>But the square on <emph>EC</emph> is equal to the squares on <emph>CF</emph>, <emph>FE</emph>, for the angle <emph>EFC</emph> is right; [<ref target=\"elem.1.47\" targOrder=\"U\">I. 47</ref>] and the square on <emph>ED</emph> is equal to the squares on <emph>DF</emph>, <emph>FE</emph>; therefore the rectangle <emph>AD</emph>, <emph>DC</emph> together with the square on <emph>EC</emph> is equal to the square on <emph>ED</emph>. </p>\n      <p>And <emph>EC</emph> is equal to <emph>EB</emph>; therefore the rectangle <emph>AD</emph>, <emph>DC</emph> together with the square on <emph>EB</emph> is equal to the square on <emph>ED</emph>. </p>\n      <p>But the squares on <emph>EB</emph>, <emph>BD</emph> are equal to the square on <emph>ED</emph>, for the angle <emph>EBD</emph> is right; [<ref target=\"elem.1.47\" targOrder=\"U\">I. 47</ref>] therefore the rectangle <emph>AD</emph>, <emph>DC</emph> together with the square on <emph>EB</emph> is equal to the squares on <emph>EB</emph>, <emph>BD</emph>. </p>\n      <p>Let the square on <emph>EB</emph> be subtracted from each; therefore the rectangle <emph>AD</emph>, <emph>DC</emph> which remains is equal to the square on <emph>DB</emph>. </p>\n      <p>Therefore etc. Q. E. D.</p>\n     "
    },
    {
      "id": "elem.3.37",
      "text": "\n      <head>PROPOSITION 37.</head>\n      <p><emph>If a point be taken outside a circle and from the point there fall on the circle two straight lines</emph>, <emph>if one of them cut the circle</emph>, <emph>and the other fall on it</emph>, <emph>and if further the rectangle contained by the whole of the straight line which cuts <pb n=\"76\" />the circle and the straight line intercepted on it outside between the point and the convex circumference be equal to the square on the straight line which falls on the circle</emph>, <emph>the straight line which falls on it will touch the circle</emph>. </p>\n      <p>For let a point <emph>D</emph> be taken outside the circle <emph>ABC</emph>; from <emph>D</emph> let the two straight lines <emph>DCA</emph>, <emph>DB</emph> fall on the circle <emph>ACB</emph>; let <emph>DCA</emph> cut the circle and <emph>DB</emph> fall on it; and let the rectangle <emph>AD</emph>, <emph>DC</emph> be equal to the square on <emph>DB</emph>. <figure />\n      </p>\n      <p>I say that <emph>DB</emph> touches the circle <emph>ABC</emph>. </p>\n      <p>For let <emph>DE</emph> be drawn touching <emph>ABC</emph>; let the centre of the circle <emph>ABC</emph> be taken, and let it be <emph>F</emph>; let <emph>FE</emph>, <emph>FB</emph>, <emph>FD</emph> be joined. </p>\n      <p>Thus the angle <emph>FED</emph> is right. [<ref target=\"elem.3.18\" targOrder=\"U\">III. 18</ref>] </p>\n      <p>Now, since <emph>DE</emph> touches the circle <emph>ABC</emph>, and <emph>DCA</emph> cuts it, the rectangle <emph>AD</emph>, <emph>DC</emph> is equal to the square on <emph>DE</emph>. [<ref target=\"elem.3.36\" targOrder=\"U\">III. 36</ref>] </p>\n      <p>But the rectangle <emph>AD</emph>, <emph>DC</emph> was also equal to the square on <emph>DB</emph>; therefore the square on <emph>DE</emph> is equal to the square on <emph>DB</emph>; <hi rend=\"center\">therefore <emph>DE</emph> is equal to <emph>DB</emph>.</hi>\n      </p>\n      <p>And <emph>FE</emph> is equal to <emph>FB</emph>; therefore the two sides <emph>DE</emph>, <emph>EF</emph> are equal to the two sides <emph>DB</emph>, <emph>BF</emph>; and <emph>FD</emph> is the common base of the triangles; <hi rend=\"center\">therefore the angle <emph>DEF</emph> is equal to the angle <emph>DBF</emph>. [<ref target=\"elem.1.8\" targOrder=\"U\">I. 8</ref>]</hi>\n      </p>\n      <p>But the angle <emph>DEF</emph> is right; <hi rend=\"center\">therefore the angle <emph>DBF</emph> is also right.</hi>\n      </p>\n      <p>And <emph>FB</emph> produced is a diameter; and the straight line drawn at right angles to the diameter of a circle, from its extremity, touches the circle; [<ref target=\"elem.3.16.p.1\" targOrder=\"U\">III. 16, Por.</ref>] <hi rend=\"center\">therefore <emph>DB</emph> touches the circle.</hi>\n      </p>\n      <p>Similarly this can be proved to be the case even if the centre be on <emph>AC</emph>. </p>\n      <p>Therefore etc. Q. E. D.</p>\n     "
    }
  ]
}
