{
  "num": 4,
  "definitions": [
    {
      "id": "elem.4.def.1",
      "text": "\n<head>1</head>\n<p>A rectilineal figure is said to be <hi rend=\"bold\">inscribed in a rectilineal figure</hi> when the respective angles of the inscribed figure lie on the respective sides of that in which it is inscribed.</p>\n     "
    },
    {
      "id": "elem.4.def.2",
      "text": "\n<head>2</head>\n<p>Similarly a figure is said to be <hi rend=\"bold\">circumscribed about a figure</hi> when the respective sides of the circumscribed figure pass through the respective angles of that about which it is circumscribed.</p>\n     "
    },
    {
      "id": "elem.4.def.3",
      "text": "\n<head>3</head>\n<p>A rectilineal figure is said to be <hi rend=\"bold\">inscribed in a circle</hi> when each angle of the inscribed figure lies on the circumference of the circle.</p>\n     "
    },
    {
      "id": "elem.4.def.4",
      "text": "\n<head>4</head>\n<p>A rectilineal figure is said to be <hi rend=\"bold\">circumscribed about a circle</hi>, when each side of the circumscribed figure touches the circumference of the circle.</p>\n     "
    },
    {
      "id": "elem.4.def.5",
      "text": "\n<head>5</head>\n<p>Similarly a circle is said to be <hi rend=\"bold\">inscribed in a figure</hi> when the circumference of the circle touches each side of the figure in which it is inscribed.</p>\n     "
    },
    {
      "id": "elem.4.def.6",
      "text": "\n<head>6</head>\n<p>A circle is said to be <hi rend=\"bold\">circumscribed about a figure</hi> when the circumference of the circle passes through each angle of the figure about which it is circumscribed.</p>\n     "
    },
    {
      "id": "elem.4.def.7",
      "text": "\n<head>7</head>\n<p>A straight line is said to be <hi rend=\"bold\">fitted into a circle</hi> when its extremities are on the circumference of the circle.</p>\n     "
    }
  ],
  "postulates": null,
  "common_notions": null,
  "propositions": [
    {
      "id": "elem.4.1",
      "text": "\n      <head>PROPOSITION 1.</head>\n      <p><emph>Into a given circle to fit a straight line equal to a given straight line which is not greater than the diameter of the circle</emph>. </p>\n      <p>Let <emph>ABC</emph> be the given circle, and <emph>D</emph> the given straight line not greater than the diameter of the circle; thus it is required to fit into the circle <emph>ABC</emph> a straight line equal to the straight line <emph>D</emph>. <figure />\n      </p>\n      <p>Let a diameter <emph>BC</emph> of the circle <emph>ABC</emph> be drawn. </p>\n      <p>Then, if <emph>BC</emph> is equal to <emph>D</emph>, that which was enjoined will have been done; for <emph>BC</emph> has been fitted into the circle <emph>ABC</emph> equal to the straight line <emph>D</emph>. </p>\n      <p>But, if <emph>BC</emph> is greater than <emph>D</emph>, let <emph>CE</emph> be made equal to <emph>D</emph>, and with centre <emph>C</emph> and distance <emph>CE</emph> let the circle <emph>EAF</emph> be described; let <emph>CA</emph> be joined. </p>\n      <p>Then, since the point <emph>C</emph> is the centre of the circle <emph>EAF</emph>, <hi rend=\"center\"><emph>CA</emph> is equal to <emph>CE</emph>.</hi>\n      </p>\n      <p>But <emph>CE</emph> is equal to <emph>D</emph>; <hi rend=\"center\">therefore <emph>D</emph> is also equal to <emph>CA</emph>.</hi>\n      </p>\n      <p>Therefore into the given circle <emph>ABC</emph> there has been fitted <emph>CA</emph> equal to the given straight line <emph>D</emph>.</p>\n     "
    },
    {
      "id": "elem.4.2",
      "text": "\n      <head>PROPOSITION 2.</head>\n      <p><emph>In a given circle to inscribe a triangle equiangular with a given triangle</emph>. </p>\n      <p>Let <emph>ABC</emph> be the given circle, and <emph>DEF</emph> the given triangle; thus it is required to inscribe in the circle <emph>ABC</emph> a triangle equiangular with the triangle <emph>DEF</emph>. </p>\n      <p>Let <emph>GH</emph> be drawn touching the circle <emph>ABC</emph> at <emph>A</emph> [<ref target=\"elem.3.16.p.1\" targOrder=\"U\">III. 16, Por.</ref>]; <pb n=\"82\" />on the straight line <emph>AH</emph>, and at the point <emph>A</emph> on it, let the angle <emph>HAC</emph> be constructed equal to the angle <emph>DEF</emph>, and on the straight line <emph>AG</emph>, and at the point <emph>A</emph> on it, let the angle <emph>GAB</emph> be constructed equal to the angle <emph>DFE</emph>; [<ref target=\"elem.1.23\" targOrder=\"U\">I. 23</ref>] let <emph>BC</emph> be joined. <figure />\n      </p>\n      <p>Then, since a straight line <emph>AH</emph> touches the circle <emph>ABC</emph>, and from the point of contact at <emph>A</emph> the straight line <emph>AC</emph> is drawn across in the circle, therefore the angle <emph>HAC</emph> is equal to the angle <emph>ABC</emph> in the alternate segment of the circle. [<ref target=\"elem.3.32\" targOrder=\"U\">III. 32</ref>] </p>\n      <p>But the angle <emph>HAC</emph> is equal to the angle <emph>DEF</emph>; therefore the angle <emph>ABC</emph> is also equal to the angle <emph>DEF</emph>. </p>\n      <p>For the same reason <hi rend=\"center\">the angle <emph>ACB</emph> is also equal to the angle <emph>DFE</emph>;</hi> therefore the remaining angle <emph>BAC</emph> is also equal to the remaining angle <emph>EDF</emph>. [<ref target=\"elem.1.32\" targOrder=\"U\">I. 32</ref>] </p>\n      <p>Therefore in the given circle there has been inscribed a triangle equiangular with the given triangle. Q. E. F.</p>\n     "
    },
    {
      "id": "elem.4.3",
      "text": "\n      <head>PROPOSITION 3.</head>\n      <p><emph>About a given circle to circumscribe a triangle equiangular with a given triangle</emph>. </p>\n      <p>Let <emph>ABC</emph> be the given circle, and <emph>DEF</emph> the given triangle; <lb n=\"5\" />thus it is required to circumscribe about the circle <emph>ABC</emph> a triangle equiangular with the triangle <emph>DEF</emph>. <figure />\n      </p>\n      <p>Let <emph>EF</emph> be produced in both directions to the points <emph>G</emph>, <emph>H</emph>, let the centre <emph>K</emph> of the circle <emph>ABC</emph> be taken [<ref target=\"elem.3.1\" targOrder=\"U\">III. 1</ref>], and let <lb n=\"10\" />the straight line <emph>KB</emph> be drawn across at random; on the straight line <emph>KB</emph>, and at the point <emph>K</emph> on it, let the angle <emph>BKA</emph> be constructed equal to the angle <emph>DEG</emph>, and the angle <emph>BKC</emph> equal to the angle <emph>DFH</emph>; [<ref target=\"elem.1.23\" targOrder=\"U\">I. 23</ref>] and through the points <emph>A</emph>, <emph>B</emph>, <emph>C</emph> let <emph>LAM</emph>, <emph>MBN</emph>, <emph>NCL</emph> be <lb n=\"15\" />drawn touching the circle <emph>ABC</emph>. [<ref target=\"elem.3.16.p.1\" targOrder=\"U\">III. 16, Por.</ref>] </p>\n      <p>Now, since <emph>LM</emph>, <emph>MN</emph>, <emph>NL</emph> touch the circle <emph>ABC</emph> at the points <emph>A</emph>, <emph>B</emph>, <emph>C</emph>, and <emph>KA</emph>, <emph>KB</emph>, <emph>KC</emph> have been joined from the centre <emph>K</emph> to the points <emph>A</emph>, <emph>B</emph>, <emph>C</emph>, <pb n=\"84\" /><lb n=\"20\" />therefore the angles at the points <emph>A</emph>, <emph>B</emph>, <emph>C</emph> are right. [<ref target=\"elem.3.18\" targOrder=\"U\">III. 18</ref>] </p>\n      <p>And, since the four angles of the quadrilateral <emph>AMBK</emph> are equal to four right angles, inasmuch as <emph>AMBK</emph> is in fact divisible into two triangles, <hi rend=\"center\">and the angles <emph>KAM</emph>, <emph>KBM</emph> are right,</hi>\n       <lb n=\"25\" />therefore the remaining angles <emph>AKB</emph>, <emph>AMB</emph> are equal to two right angles. </p>\n      <p>But the angles <emph>DEG</emph>, <emph>DEF</emph> are also equal to two right angles; [<ref target=\"elem.1.13\" targOrder=\"U\">I. 13</ref>] therefore the angles <emph>AKB</emph>, <emph>AMB</emph> are equal to the angles <lb n=\"30\" /><emph>DEG</emph>, <emph>DEF</emph>, of which the angle <emph>AKB</emph> is equal to the angle <emph>DEG</emph>; <hi rend=\"center\">therefore the angle <emph>AMB</emph> which remains is equal to the angle <emph>DEF</emph> which remains.</hi>\n      </p>\n      <p>Similarly it can be proved that the angle <emph>LNB</emph> is also <lb n=\"35\" />equal to the angle <emph>DFE</emph>; <hi rend=\"center\">therefore the remaining angle <emph>MLN</emph> is equal to the angle <emph>EDF</emph>. [<ref target=\"elem.1.32\" targOrder=\"U\">I. 32</ref>]</hi>\n      </p>\n      <p>Therefore the triangle <emph>LMN</emph> is equiangular with the triangle <emph>DEF</emph>; and it has been circumscribed about the <lb n=\"40\" />circle <emph>ABC</emph>. </p>\n      <p>Therefore about a given circle there has been circumscribed a triangle equiangular with the given triangle. Q. E. F.\n<note n=\"10\" type=\"crit\" place=\"unspecified\" anchored=\"yes\">\n        <p><hi rend=\"bold\">at random</hi>, literally <quote>as it may chance,</quote>\n <foreign lang=\"greek\">ὡς ἕτυχεν</foreign>. The same expression is used in <ref target=\"elem.3.1\" targOrder=\"U\">III. 1</ref> and commonly.</p>\n       </note>\n       <note n=\"22\" type=\"crit\" place=\"unspecified\" anchored=\"yes\">\n        <p><hi rend=\"bold\">is in fact divisible</hi>, <foreign lang=\"greek\">καὶ διαιρεῖται</foreign>, literally <quote>is actually divided.</quote>\n</p>\n       </note></p>\n     "
    },
    {
      "id": "elem.4.4",
      "text": "\n      <head>PROPOSITION 4.</head>\n      <p><emph>In a given triangle to inscribe a circle</emph>. </p>\n      <p>Let <emph>ABC</emph> be the given triangle; thus it is required to inscribe a circle in the triangle <emph>ABC</emph>. </p>\n      <p>Let the angles <emph>ABC</emph>, <emph>ACB</emph>\n       <lb n=\"5\" />be bisected by the straight lines <emph>BD</emph>, <emph>CD</emph> [<ref target=\"elem.1.9\" targOrder=\"U\">I. 9</ref>], and let these meet one another at the point <emph>D</emph>; from <emph>D</emph> let <emph>DE</emph>, <emph>DF</emph>, <emph>DG</emph> be drawn perpendicular to the straight <lb n=\"10\" />lines <emph>AB</emph>, <emph>BC</emph>, <emph>CA</emph>. <figure />\n      </p>\n      <p>Now, since the angle <emph>ABD</emph> is equal to the angle <emph>CBD</emph>, and the right angle <emph>BED</emph> is also equal to the right angle <emph>BFD</emph>, <lb n=\"15\" /><emph>EBD</emph>, <emph>FBD</emph> are two triangles having two angles equal to two angles and one side equal to one side, namely that subtending one of the equal angles, which is <emph>BD</emph> common to the triangles; <hi rend=\"center\">therefore they will also have the remaining sides equal to <lb n=\"20\" />the remaining sides; [<ref target=\"elem.1.26\" targOrder=\"U\">I. 26</ref>]</hi>\n       <hi rend=\"center\">therefore <emph>DE</emph> is equal to <emph>DF</emph>.</hi>\n      </p>\n      <p>For the same reason <hi rend=\"center\"><emph>DG</emph> is also equal to <emph>DF</emph>.</hi>\n      </p>\n      <p>Therefore the three straight lines <emph>DE</emph>, <emph>DF</emph>, <emph>DG</emph> are equal <lb n=\"25\" />to one another; <hi rend=\"center\">therefore the circle described with centre <emph>D</emph> and distance one of the straight lines <emph>DE</emph>, <emph>DF</emph>, <emph>DG</emph> will pass also through the remaining points, and will touch the straight lines <emph>AB</emph>, <emph>BC</emph>, <emph>CA</emph>, because the angles at the points <emph>E</emph>, <emph>F</emph>, <emph>G</emph>\n        <lb n=\"30\" />are right.</hi>\n      </p>\n      <p>For, if it cuts them, the straight line drawn at right angles to the diameter of the circle from its extremity will be found to fall within the circle : which was proved absurd; [<ref target=\"elem.3.16\" targOrder=\"U\">III. 16</ref>] <pb n=\"86\" /><hi rend=\"center\">therefore the circle described with centre <emph>D</emph> and distance <lb n=\"35\" />one of the straight lines <emph>DE</emph>, <emph>DF</emph>, <emph>DG</emph> will not cut the straight lines <emph>AB</emph>, <emph>BC</emph>, <emph>CA</emph>;</hi>\n       <hi rend=\"center\">therefore it will touch them, and will be the circle inscribed in the triangle <emph>ABC</emph>. [<ref target=\"elem.4.def.5\" targOrder=\"U\">IV. Def. 5</ref>]</hi>\n      </p>\n      <p>Let it be inscribed, as <emph>FGE</emph>. <lb n=\"40\" /></p>\n      <p>Therefore in the given triangle <emph>ABC</emph> the circle <emph>EFG</emph> has been inscribed. Q. E. F.\n<note n=\"26, 34\" type=\"crit\" place=\"unspecified\" anchored=\"yes\">\n        <p><hi rend=\"bold\">and distance one of the (straight lines D)E, (D)F, (D)G.</hi> The words and letters here shown in brackets are put in to fill out the rather careless language of the Greek. Here and in several other places in Book IV. Euclid says literally <quote>and with distance one of the (points) <emph>E</emph>, <emph>F</emph>, <emph>G</emph></quote>\n (<foreign lang=\"greek\">καὶ διαστήματι ὲνὶ τῶν</foreign> E, Z, H) and the like. In one case (<ref target=\"elem.4.13\" targOrder=\"U\">IV. 13</ref>) he actually has <quote>with distance one of the <emph>points G</emph>, <emph>H</emph>, <emph>K</emph>, <emph>L</emph>, <emph>M</emph></quote>\n (<foreign lang=\"greek\">διαστήματι ὲνὶ τῶν Η, Θ, Κ, Λ, Μ σημείων</foreign>). Heiberg notes <quote>Graecam locutionem satis miram et negligentem,</quote>\n but, in view of its frequent occurrence in good MSS., does not venture to correct it.</p>\n       </note></p>\n     "
    },
    {
      "id": "elem.4.5",
      "text": "\n      <head>PROPOSITION 5.</head>\n      <p><emph>About a given triangle to circumscribe a circle</emph>. </p>\n      <p>Let <emph>ABC</emph> be the given triangle; thus it is required to circumscribe a circle about the given triangle <emph>ABC</emph>. <figure />\n      </p>\n      <p>Let the straight lines <emph>AB</emph>, <emph>AC</emph> be bisected at the points <emph>D</emph>, <emph>E</emph> [<ref target=\"elem.1.10\" targOrder=\"U\">I. 10</ref>], and from the points <emph>D</emph>, <emph>E</emph> let <emph>DF</emph>, <emph>EF</emph> be drawn at right angles to <emph>AB</emph>, <emph>AC</emph>; they will then meet within the triangle <emph>ABC</emph>, or on the straight line <emph>BC</emph>, or outside <emph>BC</emph>. <pb n=\"89\" /></p>\n      <p>First let them meet within at <emph>F</emph>, and let <emph>FB</emph>, <emph>FC</emph>, <emph>FA</emph> be joined. </p>\n      <p>Then, since <emph>AD</emph> is equal to <emph>DB</emph>, and <emph>DF</emph> is common and at right angles, therefore the base <emph>AF</emph> is equal to the base <emph>FB</emph>. [<ref target=\"elem.1.4\" targOrder=\"U\">I. 4</ref>] </p>\n      <p>Similarly we can prove that <hi rend=\"center\"><emph>CF</emph> is also equal to <emph>AF</emph>;</hi> so that <emph>FB</emph> is also equal to <emph>FC</emph>; <hi rend=\"center\">therefore the three straight lines <emph>FA</emph>, <emph>FB</emph>, <emph>FC</emph> are equal to one another.</hi>\n      </p>\n      <p>Therefore the circle described with centre <emph>F</emph> and distance one of the straight lines <emph>FA</emph>, <emph>FB</emph>, <emph>FC</emph> will pass also through the remaining points, and the circle will have been circumscribed about the triangle <emph>ABC</emph>. </p>\n      <p>Let it be circumscribed, as <emph>ABC</emph>. </p>\n      <p>Next, let <emph>DF</emph>, <emph>EF</emph> meet on the straight line <emph>BC</emph> at <emph>F</emph>, as is the case in the second figure; and let <emph>AF</emph> be joined. </p>\n      <p>Then, similarly, we shall prove that the point <emph>F</emph> is the centre of the circle circumscribed about the triangle <emph>ABC</emph>. </p>\n      <p>Again, let <emph>DF</emph>, <emph>EF</emph> meet outside the triangle <emph>ABC</emph> at <emph>F</emph>, as is the case in the third figure, and let <emph>AF</emph>, <emph>BF</emph>, <emph>CF</emph> be joined. </p>\n      <p>Then again, since <emph>AD</emph> is equal to <emph>DB</emph>, and <emph>DF</emph> is common and at right angles, therefore the base <emph>AF</emph> is equal to the base <emph>BF</emph>. [<ref target=\"elem.1.4\" targOrder=\"U\">I. 4</ref>] </p>\n      <p>Similarly we can prove that <hi rend=\"center\"><emph>CF</emph> is also equal to <emph>AF</emph>;</hi> so that <emph>BF</emph> is also equal to <emph>FC</emph>; therefore the circle described with centre <emph>F</emph> and distance one of the straight lines <emph>FA</emph>, <emph>FB</emph>, <emph>FC</emph> will pass also through the remaining points, and will have been circumscribed about the triangle <emph>ABC</emph>. </p>\n      <p>Therefore about the given triangle a circle has been circumscribed. Q. E. F. </p>\n      <p>And it is manifest that, when the centre of the circle falls within the triangle, the angle <emph>BAC</emph>, being in a segment greater than the semicircle, is less than a right angle; <pb n=\"90\" />when the centre falls on the straight line <emph>BC</emph>, the angle <emph>BAC</emph>, being in a semicircle, is right; and when the centre of the circle falls outside the triangle, the angle <emph>BAC</emph>, being in a segment less than the semicircle, is greater than a right angle. [<ref target=\"elem.3.31\" targOrder=\"U\">III. 31</ref>]</p>\n     "
    },
    {
      "id": "elem.4.6",
      "text": "\n      <pb n=\"91\" />\n      <head>PROPOSITION 6.</head>\n      <p><emph>In a given circle to inscribe a square</emph>. </p>\n      <p>Let <emph>ABCD</emph> be the given circle; thus it is required to inscribe a square in the circle <emph>ABCD</emph>. </p>\n      <p>Let two diameters <emph>AC</emph>, <emph>BD</emph> of the circle <emph>ABCD</emph> be drawn at right angles to one another, and let <emph>AB</emph>, <emph>BC</emph>, <emph>CD</emph>, <emph>DA</emph> be joined. <figure />\n      </p>\n      <p>Then, since <emph>BE</emph> is equal to <emph>ED</emph>, for <emph>E</emph> is the centre, and <emph>EA</emph> is common and at right angles, therefore the base <emph>AB</emph> is equal to the base <emph>AD</emph>. [<ref target=\"elem.1.4\" targOrder=\"U\">I. 4</ref>] </p>\n      <p>For the same reason each of the straight lines <emph>BC</emph>, <emph>CD</emph> is also equal to each of the straight lines <emph>AB</emph>, <emph>AD</emph>; <hi rend=\"center\">therefore the quadrilateral <emph>ABCD</emph> is equilateral.</hi>\n      </p>\n      <p>I say next that it is also right-angled. </p>\n      <p>For, since the straight line <emph>BD</emph> is a diameter of the circle <emph>ABCD</emph>, therefore <emph>BAD</emph> is a semicircle; <hi rend=\"center\">therefore the angle <emph>BAD</emph> is right. [<ref target=\"elem.3.31\" targOrder=\"U\">III. 31</ref>]</hi>\n      </p>\n      <p>For the same reason each of the angles <emph>ABC</emph>, <emph>BCD</emph>, <emph>CDA</emph> is also right; <hi rend=\"center\">therefore the quadrilateral <emph>ABCD</emph> is right-angled.</hi>\n      </p>\n      <p>But it was also proved equilateral; therefore it is a square; [<ref target=\"elem.1.def.22\" targOrder=\"U\">I. Def. 22</ref>] and it has been inscribed in the circle <emph>ABCD</emph>. </p>\n      <p>Therefore in the given circle the square <emph>ABCD</emph> has been inscribed. Q. E. F.</p>\n     "
    },
    {
      "id": "elem.4.7",
      "text": "\n      <head>PROPOSITION 7.</head>\n      <p><emph>About a given circle to circumscribe a square</emph>. </p>\n      <p>Let <emph>ABCD</emph> be the given circle; thus it is required to circumscribe a square about the circle <emph>ABCD</emph>. </p>\n      <p>Let two diameters <emph>AC</emph>, <emph>BD</emph> of the circle <emph>ABCD</emph> be drawn at right angles to one another, and through the points <emph>A</emph>, <emph>B</emph>, <emph>C</emph>, <emph>D</emph> let <emph>FG</emph>, <emph>GH</emph>, <emph>HK</emph>, <emph>KF</emph> be drawn touching the circle <emph>ABCD</emph>. [<ref target=\"elem.3.16.p.1\" targOrder=\"U\">III. 16, Por.</ref>] <figure />\n      </p>\n      <p>Then, since <emph>FG</emph> touches the circle <emph>ABCD</emph>, and <emph>EA</emph> has been joined from the centre <emph>E</emph> to the point of contact at <emph>A</emph>, <hi rend=\"center\">therefore the angles at <emph>A</emph> are right. [<ref target=\"elem.3.18\" targOrder=\"U\">III. 18</ref>]</hi>\n      </p>\n      <p>For the same reason <hi rend=\"center\">the angles at the points <emph>B</emph>, <emph>C</emph>, <emph>D</emph> are also right.</hi>\n      </p>\n      <p>Now, since the angle <emph>AEB</emph> is right, and the angle <emph>EBG</emph> is also right, <hi rend=\"center\">therefore <emph>GH</emph> is parailel to <emph>AC</emph>. [<ref target=\"elem.1.28\" targOrder=\"U\">I. 28</ref>]</hi>\n       <pb n=\"93\" /></p>\n      <p>For the same reason <hi rend=\"center\"><emph>AC</emph> is also parallel to <emph>FK</emph>, so that <emph>GH</emph> is also parallel to <emph>FK</emph>. [<ref target=\"elem.1.30\" targOrder=\"U\">I. 30</ref>]</hi>\n      </p>\n      <p>Similarly we can prove that <hi rend=\"center\">each of the straight lines <emph>GF</emph>, <emph>HK</emph> is parallel to <emph>BED</emph>.</hi>\n      </p>\n      <p>Therefore <emph>GK</emph>, <emph>GC</emph>, <emph>AK</emph>, <emph>FB</emph>, <emph>BK</emph> are parallelograms; therefore <emph>GF</emph> is equal to <emph>HK</emph>, and <emph>GH</emph> to <emph>FK</emph>. [<ref target=\"elem.1.34\" targOrder=\"U\">I. 34</ref>] </p>\n      <p>And, since <emph>AC</emph> is equal to <emph>BD</emph>, and <emph>AC</emph> is also equal to each of the straight lines <emph>GH</emph>, <emph>FK</emph>, <hi rend=\"center\">while <emph>BD</emph> is equal to each of the straight lines <emph>GF</emph>, <emph>HK</emph>, [<ref target=\"elem.1.34\" targOrder=\"U\">I. 34</ref>] therefore the quadrilateral <emph>FGHK</emph> is equilateral.</hi>\n      </p>\n      <p>I say next that it is also right-angled. </p>\n      <p>For, since <emph>GBEA</emph> is a parallelogram, and the angle <emph>AEB</emph> is right, therefore the angle <emph>AGB</emph> is also right. [<ref target=\"elem.1.34\" targOrder=\"U\">I. 34</ref>] </p>\n      <p>Similarly we can prove that <hi rend=\"center\">the angles at <emph>H</emph>, <emph>K</emph>, <emph>F</emph> are also right.</hi>\n      </p>\n      <p>Therefore <emph>FGHK</emph> is right-angled. </p>\n      <p>But it was also proved equilateral; <hi rend=\"center\">therefore it is a square;</hi> and it has been circumscribed about the circle <emph>ABCD</emph>. </p>\n      <p>Therefore about the given circle a square has been circumscribed. Q. E. F.</p>\n     "
    },
    {
      "id": "elem.4.8",
      "text": "\n      <pb n=\"94\" />\n      <head>PROPOSITION 8.</head>\n      <p><emph>In a given square to inscribe a circle</emph>. </p>\n      <p>Let <emph>ABCD</emph> be the given square; thus it is required to inscribe a circle in the given square <emph>ABCD</emph>. <figure />\n      </p>\n      <p>Let the straight lines <emph>AD</emph>, <emph>AB</emph> be bisected at the points <emph>E</emph>, <emph>F</emph> respectively [<ref target=\"elem.1.10\" targOrder=\"U\">I. 10</ref>], through <emph>E</emph> let <emph>EH</emph> be drawn parallel to either <emph>AB</emph> or <emph>CD</emph>, and through <emph>F</emph> let <emph>FK</emph> be drawn parallel to either <emph>AD</emph> or <emph>BC</emph>; [<ref target=\"elem.1.31\" targOrder=\"U\">I. 31</ref>] therefore each of the figures <emph>AK</emph>, <emph>KB</emph>, <emph>AH</emph>, <emph>HD</emph>, <emph>AG</emph>, <emph>GC</emph>, <emph>BG</emph>, <emph>GD</emph> is a parallelogram, and their opposite sides are evidently equal. [<ref target=\"elem.1.34\" targOrder=\"U\">I. 34</ref>] </p>\n      <p>Now, since <emph>AD</emph> is equal to <emph>AB</emph>, and <emph>AE</emph> is half of <emph>AD</emph>, and <emph>AF</emph> half of <emph>AB</emph>, <hi rend=\"center\">therefore <emph>AE</emph> is equal to <emph>AF</emph>, so that the opposite sides are also equal;</hi>\n       <hi rend=\"center\">therefore <emph>FG</emph> is equal to <emph>GE</emph>.</hi>\n      </p>\n      <p>Similarly we can prove that each of the straight lines <emph>GH</emph>, <emph>GK</emph> is equal to each of the straight lines <emph>FG</emph>, <emph>GE</emph>; <hi rend=\"center\">therefore the four straight lines <emph>GE</emph>, <emph>GF</emph>, <emph>GH</emph>, <emph>GK</emph> are equal to one another.</hi>\n      </p>\n      <p>Therefore the circle described with centre <emph>G</emph> and distance one of the straight lines <emph>GE</emph>, <emph>GF</emph>, <emph>GH</emph>, <emph>GK</emph> will pass also through the remaining points. </p>\n      <p>And it will touch the straight lines <emph>AB</emph>, <emph>BC</emph>, <emph>CD</emph>, <emph>DA</emph>, because the angles at <emph>E</emph>, <emph>F</emph>, <emph>H</emph>, <emph>K</emph> are right. </p>\n      <p>For, if the circle cuts <emph>AB</emph>, <emph>BC</emph>, <emph>CD</emph>, <emph>DA</emph>, the straight line drawn at right angles to the diameter of the circle from its extremity will fall within the circle : which was proved absurd; [<ref target=\"elem.3.16\" targOrder=\"U\">III. 16</ref>] therefore the circle described with centre <emph>G</emph> and distance one of the straight lines <emph>GE</emph>, <emph>GF</emph>, <emph>GH</emph>, <emph>GK</emph> will not cut the straight lines <emph>AB</emph>, <emph>BC</emph>, <emph>CD</emph>, <emph>DA</emph>. </p>\n      <p>Therefore it will touch them, and will have been inscribed in the square <emph>ABCD</emph>. </p>\n      <p>Therefore in the given square a circle has been inscribed. Q. E. F.</p>\n     "
    },
    {
      "id": "elem.4.9",
      "text": "\n      <head>PROPOSITION 9.</head>\n      <p><emph>About a given square to circumscribe a circle</emph>. </p>\n      <p>Let <emph>ABCD</emph> be the given square; thus it is required to circumscribe a circle about the square <emph>ABCD</emph>. <figure />\n      </p>\n      <p>For let <emph>AC</emph>, <emph>BD</emph> be joined, and let them cut one another at <emph>E</emph>. </p>\n      <p>Then, since <emph>DA</emph> is equal to <emph>AB</emph>, and <emph>AC</emph> is common, therefore the two sides <emph>DA</emph>, <emph>AC</emph> are equal to the two sides <emph>BA</emph>, <emph>AC</emph>; and the base <emph>DC</emph> is equal to the base <emph>BC</emph>; <hi rend=\"center\">therefore the angle <emph>DAC</emph> is equal to the angle <emph>BAC</emph>. [<ref target=\"elem.1.8\" targOrder=\"U\">I. 8</ref>]</hi>\n      </p>\n      <p>Therefore the angle <emph>DAB</emph> is bisected by <emph>AC</emph>. </p>\n      <p>Similarly we can prove that each of the angles <emph>ABC</emph>, <emph>BCD</emph>, <emph>CDA</emph> is bisected by the straight lines <emph>AC</emph>, <emph>DB</emph>. </p>\n      <p>Now, since the angle <emph>DAB</emph> is equal to the angle <emph>ABC</emph>, and the angle <emph>EAB</emph> is half the angle <emph>DAB</emph>, and the angle <emph>EBA</emph> half the angle <emph>ABC</emph>, therefore the angle <emph>EAB</emph> is also equal to the angle <emph>EBA</emph>; so that the side <emph>EA</emph> is also equal to <emph>EB</emph>. [<ref target=\"elem.1.6\" targOrder=\"U\">I. 6</ref>] </p>\n      <p>Similarly we can prove that each of the straight lines <emph>EA</emph>, <emph>EB</emph> is equal to each of the straight lines <emph>EC</emph>, <emph>ED</emph>. </p>\n      <p>Therefore the four straight lines <emph>EA</emph>, <emph>EB</emph>, <emph>EC</emph>, <emph>ED</emph> are equal to one another. </p>\n      <p>Therefore the circle described with centre <emph>E</emph> and distance one of the straight lines <emph>EA</emph>, <emph>EB</emph>, <emph>EC</emph>, <emph>ED</emph> will pass also through the remaining points; and it will have been circumscribed about the square <emph>ABCD</emph>. </p>\n      <p>Let it be circumscribed, as <emph>ABCD</emph>. </p>\n      <p>Therefore about the given square a circle has been circumscribed. Q. E. F.</p>\n     "
    },
    {
      "id": "elem.4.10",
      "text": "\n      <pb n=\"96\" />\n      <head>PROPOSITION 10.</head>\n      <p><emph>To construct an isosceles triangle having each of the angles at the base double of the remaining one</emph>. </p>\n      <p>Let any straight line <emph>AB</emph> be set out, and let it be cut at the point <emph>C</emph> so that the rectangle contained by <emph>AB</emph>, <emph>BC</emph> is equal to the square on <emph>CA</emph>; [<ref target=\"elem.2.11\" targOrder=\"U\">II. 11</ref>] with centre <emph>A</emph> and distance <emph>AB</emph> let the circle <emph>BDE</emph> be described, and let there be fitted in the circle <emph>BDE</emph> the straight line <emph>BD</emph> equal to the straight line <emph>AC</emph> which is not greater than the diameter of the circle <emph>BDE</emph>. [<ref target=\"elem.4.1\" targOrder=\"U\">IV. 1</ref>] <figure />\n      </p>\n      <p>Let <emph>AD</emph>, <emph>DC</emph> be joined, and let the circle <emph>ACD</emph> be circumscribed about the triangle <emph>ACD</emph>. [<ref target=\"elem.4.5\" targOrder=\"U\">IV. 5</ref>] </p>\n      <p>Then, since the rectangle <emph>AB</emph>, <emph>BC</emph> is equal to the square on <emph>AC</emph>, and <emph>AC</emph> is equal to <emph>BD</emph>, therefore the rectangle <emph>AB</emph>, <emph>BC</emph> is equal to the square on <emph>BD</emph>. </p>\n      <p>And, since a point <emph>B</emph> has been taken outside the circle <emph>ACD</emph>, and from <emph>B</emph> the two straight lines <emph>BA</emph>, <emph>BD</emph> have fallen on the circle <emph>ACD</emph>, and one of them cuts it, while the other falls on it, and the rectangle <emph>AB</emph>, <emph>BC</emph> is equal to the square on <emph>BD</emph>, <hi rend=\"center\">therefore <emph>BD</emph> touches the circle <emph>ACD</emph>. [<ref target=\"elem.3.37\" targOrder=\"U\">III. 37</ref>]</hi>\n      </p>\n      <p>Since, then, <emph>BD</emph> touches it, and <emph>DC</emph> is drawn across from the point of contact at <emph>D</emph>, therefore the angle <emph>BDC</emph> is equal to the angle <emph>DAC</emph> in the alternate segment of the circle. [<ref target=\"elem.3.32\" targOrder=\"U\">III. 32</ref>] </p>\n      <p>Since, then, the angle <emph>BDC</emph> is equal to the angle <emph>DAC</emph>, let the angle <emph>CDA</emph> be added to each; therefore the whole angle <emph>BDA</emph> is equal to the two angles <emph>CDA</emph>, <emph>DAC</emph>. <pb n=\"97\" /></p>\n      <p>But the exterior angle <emph>BCD</emph> is equal to the angles <emph>CDA</emph>, <emph>DAC</emph>; [<ref target=\"elem.1.32\" targOrder=\"U\">I. 32</ref>] therefore the angle <emph>BDA</emph> is also equal to the angle <emph>BCD</emph>. </p>\n      <p>But the angle <emph>BDA</emph> is equal to the angle <emph>CBD</emph>, since the side <emph>AD</emph> is also equal to <emph>AB</emph>; [<ref target=\"elem.1.5\" targOrder=\"U\">I. 5</ref>] so that the angle <emph>DBA</emph> is also equal to the angle <emph>BCD</emph>. </p>\n      <p>Therefore the three angles <emph>BDA</emph>, <emph>DBA</emph>, <emph>BCD</emph> are equal to one another. </p>\n      <p>And, since the angle <emph>DBC</emph> is equal to the angle <emph>BCD</emph>, <hi rend=\"center\">the side <emph>BD</emph> is also equal to the side <emph>DC</emph>. [<ref target=\"elem.1.6\" targOrder=\"U\">I. 6</ref>]</hi>\n      </p>\n      <p>But <emph>BD</emph> is by hypothesis equal to <emph>CA</emph>; therefore <emph>CA</emph> is also equal to <emph>CD</emph>, <hi rend=\"center\">so that the angle <emph>CDA</emph> is also equal to the angle <emph>DAC</emph>; [<ref target=\"elem.1.5\" targOrder=\"U\">I. 5</ref>]</hi> therefore the angles <emph>CDA</emph>, <emph>DAC</emph> are double of the angle <emph>DAC</emph>. </p>\n      <p>But the angle <emph>BCD</emph> is equal to the angles <emph>CDA</emph>, <emph>DAC</emph>; therefore the angle <emph>BCD</emph> is also double of the angle <emph>CAD</emph>. </p>\n      <p>But the angle <emph>BCD</emph> is equal to each of the angles <emph>BDA</emph>, <emph>DBA</emph>; therefore each of the angles <emph>BDA</emph>, <emph>DBA</emph> is also double of the angle <emph>DAB</emph>. </p>\n      <p>Therefore the isosceles triangle <emph>ABD</emph> has been constructed having each of the angles at the base <emph>DB</emph> double of the remaining one. Q. E. F.</p>\n     "
    },
    {
      "id": "elem.4.11",
      "text": "\n      <head>PROPOSITION 11.</head>\n      <p><emph>In a given circle to inscribe an equilateral and equiangular pentagon</emph>. </p>\n      <p>Let <emph>ABCDE</emph> be the given circle; thus it is required to inscribe in the circle <emph>ABCDE</emph> an equilateral and equiangular pentagon. </p>\n      <p>Let the isosceles triangle <emph>FGH</emph> be set out having each of the angles at <emph>G</emph>, <emph>H</emph> double of the angle at <emph>F</emph>; [<ref target=\"elem.4.10\" targOrder=\"U\">IV. 10</ref>] <figure /> let there be inscribed in the circle <emph>ABCDE</emph> the triangle <emph>ACD</emph> equiangular with the triangle <emph>FGH</emph>, so that the angle <emph>CAD</emph> is equal to the angle at <emph>F</emph> and the angles at <emph>G</emph>, <emph>H</emph> respectively equal to the angles <emph>ACD</emph>, <emph>CDA</emph>; [<ref target=\"elem.4.2\" targOrder=\"U\">IV. 2</ref>] therefore each of the angles <emph>ACD</emph>, <emph>CDA</emph> is also double of the angle <emph>CAD</emph>. </p>\n      <p>Now let the angles <emph>ACD</emph>, <emph>CDA</emph> be bisected respectively by the straight lines <emph>CE</emph>, <emph>DB</emph> [<ref target=\"elem.1.9\" targOrder=\"U\">I. 9</ref>], and let <emph>AB</emph>, <emph>BC</emph>, <emph>DE</emph>, <emph>EA</emph> be joined. </p>\n      <p>Then, since each of the angles <emph>ACD</emph>, <emph>CDA</emph> is double of the angle <emph>CAD</emph>, and they have been bisected by the straight lines <emph>CE</emph>, <emph>DB</emph>, <pb n=\"101\" />therefore the five angles <emph>DAC</emph>, <emph>ACE</emph>, <emph>ECD</emph>, <emph>CDB</emph>, <emph>BDA</emph> are equal to one another. </p>\n      <p>But equal angles stand on equal circumferences; [<ref target=\"elem.3.26\" targOrder=\"U\">III. 26</ref>] therefore the five circumferences <emph>AB</emph>, <emph>BC</emph>, <emph>CD</emph>, <emph>DE</emph>, <emph>EA</emph> are equal to one another. </p>\n      <p>But equal circumferences are subtended by equal straight lines; [<ref target=\"elem.3.29\" targOrder=\"U\">III. 29</ref>] therefore the five straight lines <emph>AB</emph>, <emph>BC</emph>, <emph>CD</emph>, <emph>DE</emph>, <emph>EA</emph> are equal to one another; <hi rend=\"center\">therefore the pentagon <emph>ABCDE</emph> is equilateral.</hi>\n      </p>\n      <p>I say next that it is also equiangular. </p>\n      <p>For, since the circumference <emph>AB</emph> is equal to the circumference <emph>DE</emph>, let <emph>BCD</emph> be added to each; <hi rend=\"center\">therefore the whole circumference <emph>ABCD</emph> is equal to the whole circumference <emph>EDCB</emph>.</hi>\n      </p>\n      <p>And the angle <emph>AED</emph> stands on the circumference <emph>ABCD</emph>, and the angle <emph>BAE</emph> on the circumference <emph>EDCB</emph>; <hi rend=\"center\">therefore the angle <emph>BAE</emph> is also equal to the angle <emph>AED</emph>. [<ref target=\"elem.3.27\" targOrder=\"U\">III. 27</ref>]</hi>\n      </p>\n      <p>For the same reason each of the angles <emph>ABC</emph>, <emph>BCD</emph>, <emph>CDE</emph> is also equal to each of the angles <emph>BAE</emph>, <emph>AED</emph>; <hi rend=\"center\">therefore the pentagon <emph>ABCDE</emph> is equiangular.</hi>\n      </p>\n      <p>But it was also proved equilateral; <hi rend=\"center\">therefore in the given circle an equilateral and equiangular pentagon has been inscribed. Q. E. F.</hi></p>\n     "
    },
    {
      "id": "elem.4.12",
      "text": "\n      <head>PROPOSITION 12.</head>\n      <p><emph>About a given circle to circumscribe an equilateral and equiangular pentagon</emph>. </p>\n      <p>Let <emph>ABCDE</emph> be the given circle; thus it is required to circumscribe an equilateral and equiangular pentagon about the circle <emph>ABCDE</emph>. </p>\n      <p>Let <emph>A</emph>, <emph>B</emph>, <emph>C</emph>, <emph>D</emph>, <emph>E</emph> be conceived to be the angular points of the inscribed pentagon, so that the circumferences <emph>AB</emph>, <emph>BC</emph>, <emph>CD</emph>, <emph>DE</emph>, <emph>EA</emph> are equal; [<ref target=\"elem.4.11\" targOrder=\"U\">IV. 11</ref>] <figure /> through <emph>A</emph>, <emph>B</emph>, <emph>C</emph>, <emph>D</emph>, <emph>E</emph> let <emph>GH</emph>, <emph>HK</emph>, <emph>KL</emph>, <emph>LM</emph>, <emph>MG</emph> be drawn touching the circle; [<ref target=\"elem.3.16.p.1\" targOrder=\"U\">III. 16, Por.</ref>] let the centre <emph>F</emph> of the circle <emph>ABCDE</emph> be taken [<ref target=\"elem.3.1\" targOrder=\"U\">III. 1</ref>], and let <emph>FB</emph>, <emph>FK</emph>, <emph>FC</emph>, <emph>FL</emph>, <emph>FD</emph> be joined. </p>\n      <p>Then, since the straight line <emph>KL</emph> touches the circle <emph>ABCDE</emph> at <emph>C</emph>, and <emph>FC</emph> has been joined from the centre <emph>F</emph> to the point of contact at <emph>C</emph>, <hi rend=\"center\">therefore <emph>FC</emph> is perpendicular to <emph>KL</emph>; [<ref target=\"elem.3.18\" targOrder=\"U\">III. 18</ref>] therefore each of the angles at <emph>C</emph> is right.</hi>\n      </p>\n      <p>For the same reason <hi rend=\"center\">the angles at the points <emph>B</emph>, <emph>D</emph> are also right.</hi>\n       <pb n=\"103\" /></p>\n      <p>And, since the angle <emph>FCK</emph> is right, therefore the square on <emph>FK</emph> is equal to the squares on <emph>FC</emph>, <emph>CK</emph>. </p>\n      <p>For the same reason [<ref target=\"elem.1.47\" targOrder=\"U\">I. 47</ref>] <hi rend=\"center\">the square on <emph>FK</emph> is also equal to the squares on <emph>FB</emph>, <emph>BK</emph>; so that the squares on <emph>FC</emph>, <emph>CK</emph> are equal to the squares on <emph>FB</emph>, <emph>BK</emph>, of which the square on <emph>FC</emph> is equal to the square on <emph>FB</emph>;</hi> therefore the square on <emph>CK</emph> which remains is equal to the square on <emph>BK</emph>. </p>\n      <p>Therefore <emph>BK</emph> is equal to <emph>CK</emph>. </p>\n      <p>And, since <emph>FB</emph> is equal to <emph>FC</emph>, and <emph>FK</emph> common, <hi rend=\"center\">the two sides <emph>BF</emph>, <emph>FK</emph> are equal to the two sides <emph>CF</emph>, <emph>FK</emph>; and the base <emph>BK</emph> equal to the base <emph>CK</emph>; therefore the angle <emph>BFK</emph> is equal to the angle <emph>KFC</emph>, [<ref target=\"elem.1.8\" targOrder=\"U\">I. 8</ref>] and the angle <emph>BKF</emph> to the angle <emph>FKC</emph>.</hi> Therefore the angle <emph>BFC</emph> is double of the angle <emph>KFC</emph>, <hi rend=\"center\">and the angle <emph>BKC</emph> of the angle <emph>FKC</emph>.</hi>\n      </p>\n      <p>For the same reason <hi rend=\"center\">the angle <emph>CFD</emph> is also double of the angle <emph>CFL</emph>, and the angle <emph>DLC</emph> of the angle <emph>FLC</emph>.</hi>\n      </p>\n      <p>Now, since the circumference <emph>BC</emph> is equal to <emph>CD</emph>, the angle <emph>BFC</emph> is also equal to the angle <emph>CFD</emph>. [<ref target=\"elem.3.27\" targOrder=\"U\">III. 27</ref>] </p>\n      <p>And the angle <emph>BFC</emph> is double of the angle <emph>KFC</emph>, and the angle <emph>DFC</emph> of the angle <emph>LFC</emph>; <hi rend=\"center\">therefore the angle <emph>KFC</emph> is also equal to the angle <emph>LFC</emph>.</hi>\n      </p>\n      <p>But the angle <emph>FCK</emph> is also equal to the angle <emph>FCL</emph>; therefore <emph>FKC</emph>, <emph>FLC</emph> are two triangles having two angles equal to two angles and one side equal to one side, namely <emph>FC</emph> which is common to them; therefore they will also have the remaining sides equal to the remaining sides, and the remaining angle to the remaining angle; [<ref target=\"elem.1.26\" targOrder=\"U\">I. 26</ref>] <hi rend=\"center\">therefore the straight line <emph>KC</emph> is equal to <emph>CL</emph>, and the angle <emph>FKC</emph> to the angle <emph>FLC</emph>.</hi>\n      </p>\n      <p>And, since <emph>KC</emph> is equal to <emph>CL</emph>, therefore <emph>KL</emph> is double of <emph>KC</emph>. <pb n=\"104\" /></p>\n      <p>For the same reason it can be proved that <hi rend=\"center\"><emph>HK</emph> is also double of <emph>BK</emph>.</hi>\n      </p>\n      <p>And <emph>BK</emph> is equal to <emph>KC</emph>; <hi rend=\"center\">therefore <emph>HK</emph> is also equal to <emph>KL</emph>.</hi>\n      </p>\n      <p>Similarly each of the straight lines <emph>HG</emph>, <emph>GM</emph>, <emph>ML</emph> can also be proved equal to each of the straight lines <emph>HK</emph>, <emph>KL</emph>; <hi rend=\"center\">therefore the pentagon <emph>GHKLM</emph> is equilateral.</hi>\n      </p>\n      <p>I say next that it is also equiangular. </p>\n      <p>For, since the angle <emph>FKC</emph> is equal to the angle <emph>FLC</emph>, and the angle <emph>HKL</emph> was proved double of the angle <emph>FKC</emph>, <hi rend=\"center\">and the angle <emph>KLM</emph> double of the angle <emph>FLC</emph>, therefore the angle <emph>HKL</emph> is also equal to the angle <emph>KLM</emph>.</hi>\n      </p>\n      <p>Similarly each of the angles <emph>KHG</emph>, <emph>HGM</emph>, <emph>GML</emph> can also be proved equal to each of the angles <emph>HKL</emph>, <emph>KLM</emph>; therefore the five angles <emph>GHK</emph>, <emph>HKL</emph>, <emph>KLM</emph>, <emph>LMG</emph>, <emph>MGH</emph> are equal to one another. </p>\n      <p>Therefore the pentagon <emph>GHKLM</emph> is equiangular. </p>\n      <p>And it was also proved equilateral; and it has been circumscribed about the circle <emph>ABCDE</emph>. Q. E. F.</p>\n     "
    },
    {
      "id": "elem.4.13",
      "text": "\n      <head>PROPOSITION 13.</head>\n      <p><emph>In a given pentagon</emph>, <emph>which is equilateral and equiangular</emph>, <emph>to inscribe a circle</emph>. </p>\n      <p>Let <emph>ABCDE</emph> be the given equilateral and equiangular pentagon; thus it is required to inscribe a circle in the pentagon <emph>ABCDE</emph>. </p>\n      <p>For let the angles <emph>BCD</emph>, <emph>CDE</emph> be bisected by the straight lines <emph>CF</emph>, <emph>DF</emph> respectively; and from the point <emph>F</emph>, at <pb n=\"105\" />which the straight lines <emph>CF</emph>, <emph>DF</emph> meet one another, let the straight lines <emph>FB</emph>, <emph>FA</emph>, <emph>FE</emph> be joined. </p>\n      <p>Then, since <emph>BC</emph> is equal to <emph>CD</emph>, and <emph>CF</emph> common, the two sides <emph>BC</emph>, <emph>CF</emph> are equal to the two sides <emph>DC</emph>, <emph>CF</emph>; <figure /> and the angle <emph>BCF</emph> is equal to the angle <emph>DCF</emph>; <hi rend=\"center\">therefore the base <emph>BF</emph> is equal to the base <emph>DF</emph>,</hi> and the triangle <emph>BCF</emph> is equal to the triangle <emph>DCF</emph>, and the remaining angles will be equal to the remaining angles, namely those which the equal sides subtend. [<ref target=\"elem.1.4\" targOrder=\"U\">I. 4</ref>] </p>\n      <p>Therefore the angle <emph>CBF</emph> is equal to the angle <emph>CDF</emph>. </p>\n      <p>And, since the angle <emph>CDE</emph> is double of the angle <emph>CDF</emph>, and the angle <emph>CDE</emph> is equal to the angle <emph>ABC</emph>, while the angle <emph>CDF</emph> is equal to the angle <emph>CBF</emph>; therefore the angle <emph>CBA</emph> is also double of the angle <emph>CBF</emph>; <hi rend=\"center\">therefore the angle <emph>ABF</emph> is equal to the angle <emph>FBC</emph>;</hi> therefore the angle <emph>ABC</emph> has been bisected by the straight line <emph>BF</emph>. </p>\n      <p>Similarly it can be proved that the angles <emph>BAE</emph>, <emph>AED</emph> have also been bisected by the straight lines <emph>FA</emph>, <emph>FE</emph> respectively. </p>\n      <p>Now let <emph>FG</emph>, <emph>FH</emph>, <emph>FK</emph>, <emph>FL</emph>, <emph>FM</emph> be drawn from the point <emph>F</emph> perpendicular to the straight lines <emph>AB</emph>, <emph>BC</emph>, <emph>CD</emph>, <emph>DE</emph>, <emph>EA</emph>. </p>\n      <p>Then, since the angle <emph>HCF</emph> is equal to the angle <emph>KCF</emph>, and the right angle <emph>FHC</emph> is also equal to the angle <emph>FKC</emph>, <emph>FHC</emph>, <emph>FKC</emph> are two triangles having two angles equal to two angles and one side equal to one side, namely <emph>FC</emph> which is common to them and subtends one of the equal angles; therefore they will also have the remaining sides equal to the remaining sides; [<ref target=\"elem.1.26\" targOrder=\"U\">I. 26</ref>] therefore the perpendicular <emph>FH</emph> is equal to the perpendicular <emph>FK</emph>. </p>\n      <p>Similarly it can be proved that each of the straight lines <emph>FL</emph>, <emph>FM</emph>, <emph>FG</emph> is also equal to each of the straight lines <emph>FH</emph>, <emph>FK</emph>; <pb n=\"106\" />therefore the five straight lines <emph>FG</emph>, <emph>FH</emph>, <emph>FK</emph>, <emph>FL</emph>, <emph>FM</emph> are equal to one another. </p>\n      <p>Therefore the circle described with centre <emph>F</emph> and distance one of the straight lines <emph>FG</emph>, <emph>FH</emph>, <emph>FK</emph>, <emph>FL</emph>, <emph>FM</emph> will pass also through the remaining points; and it will touch the straight lines <emph>AB</emph>, <emph>BC</emph>, <emph>CD</emph>, <emph>DE</emph>, <emph>EA</emph>, because the angles at the points <emph>G</emph>, <emph>H</emph>, <emph>K</emph>, <emph>L</emph>, <emph>M</emph> are right. </p>\n      <p>For, if it does not touch them. but cuts them, it will result that the straight line drawn at right angles to the diameter of the circle from its extremity falls within the circle: which was proved absurd. [<ref target=\"elem.3.16\" targOrder=\"U\">III. 16</ref>] </p>\n      <p>Therefore the circle described with centre <emph>F</emph> and distance one of the straight lines <emph>FG</emph>, <emph>FH</emph>, <emph>FK</emph>, <emph>FL</emph>, <emph>FM</emph> will not cut the straight lines <emph>AB</emph>, <emph>BC</emph>, <emph>CD</emph>, <emph>DE</emph>, <emph>EA</emph>; <hi rend=\"center\">therefore it will touch them.</hi>\n      </p>\n      <p>Let it be described, as <emph>GHKLM</emph>. </p>\n      <p>Therefore in the given pentagon, which is equilateral and equiangular, a circle has been inscribed. Q. E. F.</p>\n     "
    },
    {
      "id": "elem.4.14",
      "text": "\n      <head>PROPOSITION 14.</head>\n      <p><emph>About a given pentagon</emph>, <emph>which is equilateral and equiangular</emph>, <emph>to circumscribe a circle</emph>. </p>\n      <p>Let <emph>ABCDE</emph> be the given pentagon, which is equilateral and equiangular; thus it is required to circumscribe a circle about the pentagon <emph>ABCDE</emph>. </p>\n      <p>Let the angles <emph>BCD</emph>, <emph>CDE</emph> be bisected by the straight lines <emph>CF</emph>, <emph>DF</emph> respectively, and from the point <emph>F</emph>, at which the straight lines meet, let the straight lines <emph>FB</emph>, <emph>FA</emph>, <emph>FE</emph> be joined to the points <emph>B</emph>, <emph>A</emph>, <emph>E</emph>. <figure />\n      </p>\n      <p>Then in manner similar to the preceding it can be proved that the angles <emph>CBA</emph>, <emph>BAE</emph>, <emph>AED</emph> have also been bisected by the straight lines <emph>FB</emph>, <emph>FA</emph>, <emph>FE</emph> respectively. <pb n=\"107\" /></p>\n      <p>Now, since the angle <emph>BCD</emph> is equal to the angle <emph>CDE</emph>, and the angle <emph>FCD</emph> is half of the angle <emph>BCD</emph>, and the angle <emph>CDF</emph> half of the angle <emph>CDE</emph>, therefore the angle <emph>FCD</emph> is also equal to the angle <emph>CDF</emph>, <hi rend=\"center\">so that the side <emph>FC</emph> is also equal to the side <emph>FD</emph>. [<ref target=\"elem.1.6\" targOrder=\"U\">I. 6</ref>]</hi>\n      </p>\n      <p>Similarly it can be proved that each of the straight lines <emph>FB</emph>, <emph>FA</emph>, <emph>FE</emph> is also equal to each of the straight lines <emph>FC</emph>, <emph>FD</emph>; therefore the five straight lines <emph>FA</emph>, <emph>FB</emph>, <emph>FC</emph>, <emph>FD</emph>, <emph>FE</emph> are equal to one another. </p>\n      <p>Therefore the circle described with centre <emph>F</emph> and distance one of the straight lines <emph>FA</emph>, <emph>FB</emph>, <emph>FC</emph>, <emph>FD</emph>, <emph>FE</emph> will pass also through the remaining points, and will have been circumscribed. </p>\n      <p>Let it be circumscribed, and let it be <emph>ABCDE</emph>. </p>\n      <p>Therefore about the given pentagon, which is equilateral and equiangular, a circle has been circumscribed. Q. E. F.</p>\n     "
    },
    {
      "id": "elem.4.15",
      "text": "\n      <head>PROPOSITION 15.</head>\n      <p><emph>In a given circle to inscribe an equilateral and equiangular hexagon</emph>. </p>\n      <p>Let <emph>ABCDEF</emph> be the given circle; thus it is required to inscribe an equilateral and equiangular hexagon in the circle <emph>ABCDEF</emph>. </p>\n      <p>Let the diameter <emph>AD</emph> of the circle <emph>ABCDEF</emph> be drawn; let the centre <emph>G</emph> of the circle be taken, and with centre <emph>D</emph> and distance <emph>DG</emph> let the circle <emph>EGCH</emph> be described; <figure /> let <emph>EG</emph>, <emph>CG</emph> be joined and carried through to the points <emph>B</emph>, <emph>F</emph>, and let <emph>AB</emph>, <emph>BC</emph>, <emph>CD</emph>, <emph>DE</emph>, <emph>EF</emph>, <emph>FA</emph> be joined. </p>\n      <p>I say that the hexagon <emph>ABCDEF</emph> is equilateral and equiangular. </p>\n      <p>For, since the point <emph>G</emph> is the centre of the circle <emph>ABCDEF</emph>, <hi rend=\"center\"><emph>GE</emph> is equal to <emph>GD</emph>.</hi>\n       <pb n=\"108\" /></p>\n      <p>Again, since the point <emph>D</emph> is the centre of the circle <emph>GCH</emph>, <hi rend=\"center\"><emph>DE</emph> is equal to <emph>DG</emph>.</hi>\n      </p>\n      <p>But <emph>GE</emph> was proved equal to <emph>GD</emph>; <hi rend=\"center\">therefore <emph>GE</emph> is also equal to <emph>ED</emph>; therefore the triangle <emph>EGD</emph> is equilateral;</hi> and therefore its three angles <emph>EGD</emph>, <emph>GDE</emph>, <emph>DEG</emph> are equal to one another, inasmuch as, in isosceles triangles, the angles at the base are equal to one another. [<ref target=\"elem.1.5\" targOrder=\"U\">I. 5</ref>] </p>\n      <p>And the three angles of the triangle are equal to two right angles; [<ref target=\"elem.1.32\" targOrder=\"U\">I. 32</ref>] <hi rend=\"center\">therefore the angle <emph>EGD</emph> is one-third of two right angles.</hi>\n      </p>\n      <p>Similarly, the angle <emph>DGC</emph> can also be proved to be onethird of two right angles. </p>\n      <p>And, since the straight line <emph>CG</emph> standing on <emph>EB</emph> makes the adjacent angles <emph>EGC</emph>, <emph>CGB</emph> equal to two right angles, therefore the remaining angle <emph>CGB</emph> is also one-third of two right angles. </p>\n      <p>Therefore the angles <emph>EGD</emph>, <emph>DGC</emph>, <emph>CGB</emph> are equal to one another; so that the angles vertical to them, the angles <emph>BGA</emph>, <emph>AGF</emph>, <emph>FGE</emph> are equal. [<ref target=\"elem.1.15\" targOrder=\"U\">I. 15</ref>] </p>\n      <p>Therefore the six angles <emph>EGD</emph>, <emph>DGC</emph>, <emph>CGB</emph>, <emph>BGA</emph>, <emph>AGF</emph>, <emph>FGE</emph> are equal to one another. </p>\n      <p>But equal angles stand on equal circumferences; [<ref target=\"elem.3.26\" targOrder=\"U\">III. 26</ref>] therefore the six circumferences <emph>AB</emph>, <emph>BC</emph>, <emph>CD</emph>, <emph>DE</emph>, <emph>EF</emph>, <emph>FA</emph> are equal to one another. </p>\n      <p>And equal circumferences are subtended by equal straight lines; [<ref target=\"elem.3.29\" targOrder=\"U\">III. 29</ref>] <hi rend=\"center\">therefore the six straight lines are equal to one another; therefore the hexagon <emph>ABCDEF</emph> is equilateral.</hi>\n      </p>\n      <p>I say next that it is also equiangular. </p>\n      <p>For, since the circumference <emph>FA</emph> is equal to the circumference <emph>ED</emph>, <hi rend=\"center\">let the circumference <emph>ABCD</emph> be added to each; therefore the whole <emph>FABCD</emph> is equal to the whole <emph>EDCBA</emph>;</hi>\n       <pb n=\"109\" />and the angle <emph>FED</emph> stands on the circumference <emph>FABCD</emph>, and the angle <emph>AFE</emph> on the circumference <emph>EDCBA</emph>; <hi rend=\"center\">therefore the angle <emph>AFE</emph> is equal to the angle <emph>DEF</emph>. [<ref target=\"elem.3.27\" targOrder=\"U\">III. 27</ref>]</hi>\n      </p>\n      <p>Similarly it can be proved that the remaining angles of the hexagon <emph>ABCDEF</emph> are also severally equal to each of the angles <emph>AFE</emph>, <emph>FED</emph>; <hi rend=\"center\">therefore the hexagon <emph>ABCDEF</emph> is equiangular.</hi>\n      </p>\n      <p>But it was also proved equilateral; and it has been inscribed in the circle <emph>ABCDEF</emph>. </p>\n      <p>Therefore in the given circle an equilateral and equiangular hexagon has been inscribed. Q. E. F. </p>\n      <div4 id=\"elem.4.15.p.1\" type=\"porism\" org=\"uniform\" sample=\"complete\">\n       <head>PORISM.</head>\n       <p>From this it is manifest that the side of the hexagon is equal to the radius of the circle. </p>\n       <p>And, in like manner as in the case of the pentagon, if through the points of division on the circle we draw tangents to the circle, there will be circumscribed about the circle an equilateral and equiangular hexagon in conformity with what was explained in the case of the pentagon. </p>\n       <p>And further by means similar to those explained in the case of the pentagon we can both inscribe a circle in a given hexagon and circumscribe one about it. Q. E. F.</p>\n      </div4>\n     "
    },
    {
      "id": "elem.4.16",
      "text": "\n      <pb n=\"110\" />\n      <head>PROPOSITION 16.</head>\n      <p><emph>In a given circle to inscribe a fifteen-angled figure which shall be both equilateral and equiangular</emph>. </p>\n      <p>Let <emph>ABCD</emph> be the given circle; thus it is required to inscribe in the circle <emph>ABCD</emph> a fifteenangled figure which shall be both equilateral and equiangular. <figure />\n      </p>\n      <p>In the circle <emph>ABCD</emph> let there be inscribed a side <emph>AC</emph> of the equilateral triangle inscribed in it, and a side <emph>AB</emph> of an equilateral pentagon; therefore, of the equal segments of which there are fifteen in the circle <emph>ABCD</emph>, there will be five in the circumference <emph>ABC</emph> which is one-third of the circle, and there will be three in the circumference <emph>AB</emph> which is one-fifth of the circle; <hi rend=\"center\">therefore in the remainder <emph>BC</emph> there will be two of the equal segments.</hi>\n      </p>\n      <p>Let <emph>BC</emph> be bisected at <emph>E</emph>; [<ref target=\"elem.3.30\" targOrder=\"U\">III. 30</ref>] therefore each of the circumferences <emph>BE</emph>, <emph>EC</emph> is a fifteenth of the circle <emph>ABCD</emph>. </p>\n      <p>If therefore we join <emph>BE</emph>, <emph>EC</emph> and fit into the circle <emph>ABCD</emph> straight lines equal to them and in contiguity, a fifteen-angled figure which is both equilateral and equiangular will have been inscribed in it. Q. E. F. </p>\n      <p>And, in like manner as in the case of the pentagon, if through the points of division on the circle we draw tangents to the circle, there will be circumscribed about the circle a fifteen-angled figure which is equilateral and equiangular. </p>\n      <p>And further, by proofs similar to those in the case of the pentagon, we can both inscribe a circle in the given fifteenangled figure and circumscribe one about it. Q. E. F.</p>\n     "
    }
  ]
}
